{"_id":{"$oid":"61017979d799b45506911d7a"},"imageUrl":"197f4ea3-8042-487f-8776-ba05f3234ca5","title":"New York shark sightings, potential attack forces officials to monitor beaches","description":"Shark sightings and a potential attack have forced beachgoers in New York out of the water this week.","url":"/us/new-york-beach-shark-sighting-potential-attack","publicationDate":"2021-07-28T11:08:17-04:00","lastPublishedDate":"2021-07-28T11:08:17-04:00","category":{"name":"US","url":"/category/us"},"isBreaking":false,"isLive":false,"duration":"","contents":"Shark sightings and a potential  have forced  in  out of the water this week. \n said Tuesday that they would use drones and helicopters to surveil Long Island beaches for the creatures after a lifeguard said he was bitten by something near Central Mall on Monday morning. \n\n, the Office of Parks, Recreation and Historic Preservation said that it would work together with New York State , increasing staffing and deploying patrol and surfboats to monitor the area. \n\"Long Island beaches are a crucial resource for New Yorkers in summer, and we must make sure people feel safe when visiting,\" . \"With assistance from New York State Police, we are expanding our measures to patrol for sharks and other potentially dangerous . I encourage all New Yorkers to familiarize themselves with the steps they can take to stay safe while enjoying a day at the beach.\"\nThe department noted that additional sightings had been reported at Jones Beach in the past week, including one on Tuesday, and that the investigation into Monday's incident was ongoing. \nA photo from  shows an injury on the lifeguard's left calf and George Gorman Jr., the regional director for the state park system, said the lifeguard \"felt a tug and then he saw a fin\" at around 11 a.m. ET that day. \nThe station reported that the lifeguard was treated at the scene before moving to a nearby  for \"further examination.\"\nBoth WNBC and  that the second sighting happened on Tuesday morning just after 11 a.m. ET, prompting an order for swimmers to get out of the water. \n\nAccording to PIX11, there were 20 confirmed shark sightings at Long Island beaches in the summer of 2020.\nIn June,  nicknamed \"Freya\" was seen off the coast of Long Island and the  shoreline.\n, the recovery of shark prey species is leading to an increase in shark bites around the world, rising from 157 incidents between 1970 and 1979 to almost 800 between 2010 and 2019.\nIn 2020, the U.S. experienced , the most in the world.\nThe state parks department assured that it will continue to follow shark alert protocols including suspending swimming while shores are inspected by drones.\n\"Swimming is only allowed to resume at least an hour after the last sighting. All sightings, including today's incident, are referred to the Long Island Coastal Awareness Group, which consists of 160 municipalities, agencies and private beach operators stretching from Queens through Long Island,\" the department wrote. \"State Parks created this alert system in 2018 after shark interactions off Fire Island. State Park lifeguards are continuously scanning and patrolling the waters and are on the lookout for any dangerous marine life, such as sharks.\"\n\nTo minimize the risk of shark interactions, the New York Department of Environmental Conservation advises that residents avoid areas with seals, schools of bait fish, areas with people fishing, murky water and isolation. \nAdditionally, the department recommends swimmers avoid swimming in the ocean at dusk, dawn or at night, swim close to shore in shallow water, follow the instructions of lifeguards and staff and adhere to all important signage. \n","author":" \n        By\n        Julia Musto   | Fox News"}
{"_id":{"$oid":"6101797cd799b45506911d7b"},"imageUrl":"f8d5795d-0f3d-4c9e-85d1-c935b3efe28f","title":"Pennsylvania officer faces child luring charge after being busted by ‘concerned citizens'","description":"A Pennsylvania police officer was busted in an underage sex sting conducted by a group of “concerned citizens” posing as children, police said.","url":"/us/pennsylvania-officer-child-luring-charge-busted-by-concerned-citizens","publicationDate":"2021-07-28T10:51:02-04:00","lastPublishedDate":"2021-07-28T10:51:02-04:00","category":{"name":"Police and Law Enforcement","url":"/category/us/crime/police-and-law-enforcement"},"isBreaking":false,"isLive":false,"duration":"","contents":"A  police officer was busted in an underage sex sting conducted by a group of \"concerned citizens\" posing as children, police said. \nClifford Horn, a 54-year-old corporal for the Central Bucks Regional , had little to say when approached in Atlantic City, New Jersey, Sunday by a man who runs Colorado Ped Patrol — a group that attempts to nab child predators, video shows. \n\"We’re just having a conversation with a gentleman trying to meet with a child,\" Thomas Fellows of the vigilante group tells Horn as the officer was allegedly caught in the act. \n\n\"Your zipper’s down, by the way,\" Fellows continues. \"You’re standing in front of the running car. We got your text messages. Listen, man, you want to talk and tell us why you’re here?\" \n\"I’m not trying to meet with a child,\" replies Horn, who apparently said his name was Matt in the purported texts. \nThe officer then starts to walk away as Fellows urges him to \"take accountability\" for his actions. \nHe was later arrested by waiting cops, video shows. \nAtlantic City police confirmed Horn’s arrest Sunday, saying in a statement he was among four men charged with luring/enticing a child by various means following \"assistance\" from the public. \n\"The concerned citizens were engaged in posing as underage children on various social media sites,\" police said. \"They would confront the individual and notify law enforcement.\" \n\nResponding cops were provided screenshots of conversations between the suspects and the citizen group prior to their arrests, police said. \nHorn, of Chalfont, allegedly went onto Grindr to set up a sex act with someone he thought was a 14-year-old boy, sending a photo of himself in his underwear, WPVI reported. \nFellows told the Philadelphia Inquirer he confronted Horn at a location that had been arranged online hours earlier. He said he was unaware that the man was a police officer, but suspected he was an attorney. \n\"He was just too good,\" Fellows told the newspaper. \"He wouldn’t talk.\" \nFellows, who started his group in April after one of his sons was sexually assaulted, said he creates dating app profiles posing as young teen girls or boys and waits for people to respond. Meetings then usually occur within hours, Fellows said. \n\"They reach out to us,\" he said. \"We never reach out to them.\" \n\nHorn and the three other men who were arrested since Thursday on the same charge were released on a summons, Atlantic City police said. \nThe other suspects were identified as Jose Machuca, 51, of Hyattsville, Maryland; Sambatrimiaina Raminoson, 26, of Atlantic City; and Eugene Pulley, 49, of Philadelphia. \nHorn was suspended late Monday without pay effective immediately, CBS Philadelphia reported. \nBucks County District Attorney Matt Weintraub said Monday his office will start evaluating all criminal cases in which Horn was involved. \n\n\"Our office has assigned personnel to assist New Jersey authorities in any capacity, and to investigate and prosecute any criminal activity that may have occurred in Bucks County,\" Weintraub said in a statement. \n\"This office protects all victims, regardless of whether the accused perpetrator is an officer of the law or not. No one is above the law.\" \n","author":"  New York Post"}
{"_id":{"$oid":"61017980d799b45506911d7c"},"imageUrl":"4ed96787-3005-4ae3-a0f0-02d1cff465af","title":"Illinois authorities hunt suspect who escaped prison transport van on way to jail","description":"Illinois authorities are searching for a suspect who escaped from custody by hopping out of a transport van on its way to jail","url":"/us/illinois-manhunt-suspect-escape-transport-van","publicationDate":"2021-07-28T10:32:25-04:00","lastPublishedDate":"2021-07-28T10:32:25-04:00","category":{"name":"Illinois","url":"/category/us/us-regions/midwest/illinois"},"isBreaking":false,"isLive":false,"duration":"","contents":" authorities are searching for a  who escaped from custody by hopping out of a transport van on its way to jail. \nHugo R. Avila, 21, was in custody of the Elgin Police Department in relation to felony traffic related offenses, and was being transported to the Kane County Sheriff’s Department when he escaped around 1:05 p.m. Tuesday from a transport vehicle in the area of Randall Road and Route 64 in St. Charles, Illinois, according to a .\nKane County Sheriff Ron Hain said Avila managed to slip out of his handcuffs and got out of the vehicle while the officer behind the wheel was stopped in traffic. Authorities checked several businesses along the the corridor between Route 64 and Dean Street, Hain added.\n\nElgin officers who responded to the scene were unsuccessful in locating Avila, who was last seen wearing a white T-shirt and blue jeans while fleeing from the area in a northeast direction. St. Charles Police Department and the Kane County Sheriff's Department are aiding in continuing search efforts.\nAvila is described as 5-foot-8, weighing about 125 pounds and having black hair and brown eyes. Police ask anyone who spots him to dial 911 and to avoid making contact.\n\nAccording to Kane County court records, Avila was charged on Monday with aggravated fleeing and eluding a police officer, speeding 21 mph over the speed limit, not having a valid driver's license and possessing drug paraphernalia, the Chicago Tribune reported.","author":" \n        By\n        Danielle Wallace   | Fox News"}
{"_id":{"$oid":"61017982d799b45506911d7d"},"imageUrl":"8d155a47-2514-436d-9466-d793410bc1f8","title":"Minnesota sets new state records for murders, assaults on police officers in 2020","description":"Minnesota saw the highest number of murders on record in 2020, as well the most assaults against police officers in the line of duty ever recorded within a one-year period, according to the annual uniform crime report released by the Bureau of Criminal Apprehension on Tuesday.","url":"/us/minnesota-murder-record-2020-assaults-police-officers","publicationDate":"2021-07-28T10:14:29-04:00","lastPublishedDate":"2021-07-28T10:14:29-04:00","category":{"name":"Minnesota","url":"/category/us/us-regions/midwest/minnesota"},"isBreaking":false,"isLive":false,"duration":"","contents":" saw the highest number of  on record in 2020, as well the most assaults against  in the line of duty ever recorded within a one-year period, according to the annual  released by the Bureau of Criminal Apprehension on Tuesday. \nJust a few months into last year, the onset of the coronavirus pandemic in the U.S. brought economic uncertainty, which further escalated as Minneapolis became the tipping point for sometimes violent demonstrations calling to \"defund the police\" in reaction to viral bystander video showing former Officer Derek Chauvin pressing his knee to the back of ’s neck until the Black man died. \nReeling from the aftermath, Minnesota recorded a 16.6% increase in violent crimes in 2020. There were 185 murders in 2020 in Minnesota compared to 117 in 2019, an increase of 58.1%, the report says. The 2020 number also tops by two the 183 total from 1995, which previously had been the highest total. Also, 75% of the murders in 2020 were committed with a firearm, up from 69% in 2019.\nThere were 667 incidents last year involving an officer or officers assaulted in the line of duty. That represents a 62% increase over 2019, and more than any other year on record, the report says. \n\nBias crimes spiked the highest in 15 years, rising sharply in 2020 with 223 incidents reported. According to the bureau, 41% of the 2020 incidents were motivated by anti-Black or African American bias.\nRev. Jerry McAfee, a civil rights activist who organized community patrols in north Minneapolis in response to a series of shootings that left at least two children dead this year, said the numbers of assaults, rapes and other violent crime counted by the bureau may be underreported. \n\"When you have a police force operating 200 under, the distrust some of the people have with the police department, some good, some bad, and the overall level of trauma that exists within our community, it's rough out here,\" McAfee told the . \nAfter his 6-year-old granddaughter was killed by stray bullets earlier this year, local peace activist K.G. Wilson, who’s worked for decades helping to keep children out of gangs and guns off the streets, said he’s choosing to leave Minneapolis amid the record-breaking crime surge.  \n\"I’m just done in Minneapolis. I don’t want to work here. I don’t want to be here,\" Wilson told  in an on-camera interview Tuesday. Despite his efforts, Wilson said, \"All I feel like I got in return is a murdered 6-year-old granddaughter and no arrests, and it’s been two months later.\" \nThe bureau report says there were 31 officer-involved shooting incidents recorded in 2020, an increase of six over 2019, and almost evenly split between the Twin Cities metro and Greater Minnesota.\nOut of the 45 use-of-force incidents reported by Minnesota agencies last year, 21 involved individuals who were White, 14 were Black, three were Asian, three were American Indian and five were unknown.\nAfter a significant downward trend over the past several years, arson rose 53.7% over 2019. There were 710 arsons reported in 2020 and 462 in 2019. Motor vehicle theft rose 19.7% in 2020 with 13,662 vehicles stolen as compared to 11,410 in 2019. The 2020 total is the highest since 2005.\nThe value of property stolen in 2020 topped $216 million, a 54.5% increase over 2019. Some of the biggest increases were in the value of stolen food and grooming products, money and vehicles.\nMinnesota Republicans argued that the report released Tuesday shows Democrats have been taking too lenient of an approach to crime and the data further supports the need for more law enforcement. \nBut Minneapolis officials have been supporting a measure that would allow voters in November to decide whether to \"replace\" the police department and are, meanwhile, fighting a judge’s ruling siding with northern Minneapolis residents wanting more cops hired to abide by the city charter. \n\nState Sen. Warren Limmer, chair of the Public Safety and Judiciary Committee and a Republican, said Tuesday’s report \"confirms what we've been talking about for several years at the Senate: Violent criminals are finding more victims and lenient accountability measures in the judicial system are not keeping people safe.\"  \nState Rep. Brian Johnson, another Republican, also released a statement highlighting GOP proposals in the House that would involve sending Minnesota State Patrol into high-risk areas of Minneapolis, expanding the police force and promoting the use of ShotSpotter technology, the Tribune reported. ","author":" \n        By\n        Danielle Wallace   | Fox News"}
{"_id":{"$oid":"61017985d799b45506911d7e"},"imageUrl":"84acac9c-1a67-463f-a5c9-1244a52b22d0","title":"San Francisco shoplifting: Women caught on video allegedly bolting from CVS with bags full of stolen goods","description":"A witness captured a group of women running out of a San Francisco CVS Pharmacy with bags allegedly stuffed full of stolen items as a spree of retail thefts continue to plague the city.","url":"/us/san-francisco-shoplifting-retail-cvs-pharmacy-video","publicationDate":"2021-07-28T10:14:08-04:00","lastPublishedDate":"2021-07-28T10:14:08-04:00","category":{"name":"San Francisco","url":"/category/us/san-francisco"},"isBreaking":false,"isLive":false,"duration":"","contents":"A witness captured a group of women running out of a  CVS Pharmacy with bags allegedly stuffed full of  items as a spree of retail thefts continue to plague the city.\nThe incident, first reported by , happened around 5 p.m. Monday at the drugstore located at Van Ness Avenue and Jackson Street.\n\nWitness Steve Adams told Lee that the four women were \"picking the place dry\" and that when he asked store employees if they were going to call police, \"they just shrugged.\"\n\"This sort of thing is becoming so normal,\" the witness told Lee.\nRetail thefts have been troubling major cities in recent months, forcing some stores .\nMultiple incidents in California have been captured on video, including  that shows a group of shoplifters dashing out of a Neiman Marcus department store in San Francisco and jumping into idling getaway cars.\nMeanwhile in Los Angeles, another  last week appears to show two men in the suburb of Granda Hills casually leaving a TJ Maxx store with their arms full of items.\nAuthorities and retail officials in San Francisco have said that packs of shoplifters have regularly made off with merchandise to be resold.\nShoplifters aren't stealing \"one or two items that someone might need to get by,\" San Francisco Police Department spokesman Robert Rueca . \"Our investigations have shown that there are organized fences where people are selling these products that they steal.\"\nMillions of dollars’ worth of merchandise has been stolen from retailers in San Francisco, California Retail Association President Rachel Michelin told Fox News, adding that the funds from stolen items are ultimately used by crime syndicates.\n\nState officials have begun making efforts to crack down on a surge of retail thefts and other crimes following the recent surge of incidents involving shoplifters. \nCalifornia Gov. Gavin Newsom, who is facing a recall vote,  around the California Highway Patrol and local agencies to address organized theft rings. \n","author":" \n        By\n        Stephen Sorace   | Fox News"}
{"_id":{"$oid":"61017989d799b45506911d7f"},"imageUrl":"06aeedf2-0e32-43e3-9156-6f31f2d9aeb6","title":"Expert slams NYC's data on sending social workers to 911 calls, suffers from selection bias","description":"The New York City Mayor’s Office of Community Mental Health has released the results of the first month of a new program designed to send social workers and other unarmed first responders to answer certain 911 calls.","url":"/us/new-york-city-social-workers-911","publicationDate":"2021-07-28T10:10:18-04:00","lastPublishedDate":"2021-07-28T10:10:18-04:00","category":{"name":"New York City","url":"/category/us/new-york-city"},"isBreaking":false,"isLive":false,"duration":"","contents":"The  Mayor’s Office of Community Mental Health has released the results of the first month of a new program designed to send social workers and other unarmed first responders to answer certain 911 calls instead of .\nThey show the Behavioral Health Emergency Assistance Response Division (B-HEARD) pilot program saw a positive outlook after its trial run in parts of Harlem last month – but critics note that the program had its choice of calls to respond to and selected easy ones, making the rosy outlook an obvious conclusion.\nAnd while the program may have freed up officers from having to respond to about 20% of specialized mental health 911 calls, experts don’t foresee the replacement or abolition of police.\n\n\"What you do when you disarm cops or when you send unarmed civilians in to do cop’s job is to expose civil employees to substantial risk, and then say you don't get the tools of the trade that are requisite to minimizing that risk,\" Charles F. Lehman, of the conservative Manhattan Institute think tank, told Fox News Tuesday. \"It's like denying a firefighter or mine worker or electrical worker his safety equipment.\"\nLehman outlined his conclusions in a column for the institute’s public policy magazine, the , also published Tuesday: Because social workers were not sent to high-risk calls, the data suffered from a selection bias and an \"apples-to-apples comparison\" is impossible.\nDispatchers sent about 25% of mental health calls to B-HEARD in its first month, according to the  and that is expected to rise to 50% in the future.\nBut those call exclude incidents involving suspected violence, imminent harm or a subject who requires hospitalization.\n\nOf the 138 calls 911 dispatchers sent to B-HEARD, the pilot program responded to only 107 of them.\n\"The remaining calls received the traditional response by NYPD and EMS, typically because the B-HEARD teams were busy responding to another call,\" the city said in a statement.\nOr because it was deemed too difficult or risky for an unarmed response, Lehman said, adding that the issue was not necessarily with how the city presented its data as much as with how the mainstream media touted the results.\nIn seven of those calls, B-HEARD responders called in NYPD backup. Comparatively, the NYPD requested assistance from B-HEARD on 14 occasions. The city report did not go into further detail but said \"inter-agency coordination is working well.\"\nThe B-HEARD data amounts to an experiment set up without a controlled variable, Lehman said, meaning what the city reported isn’t fair to use in a direct comparison to data on regular police responses.\n ran an article Friday with the headline, \"Mental Health Response Teams Yield Better Outcomes Than Police In NYC, Data Shows.\"\nIt highlighted the city’s finding that just half of B-HEARD mental health calls required a patient’s hospitalization compared to 82% of mental health 911 calls that saw a traditional response.\n\"A New York City pilot program that dispatches mental health specialists and paramedics instead of police for certain nonviolent emergency calls has resulted in more people accepting assistance and fewer people sent to the hospital, early data shows,\" the article reads.\nAnd New York City’s NBC affiliate  a \"New York City pilot program to respond to 911 calls for mental health crises with social workers instead of cops appears to be reducing unnecessary hospitalizations.\"\nBut of course, fewer people were sent to the hospital when calls that dispatchers knew would require hospitalization were not routed to B-HEARD from the start, Lehman noted.\n\"If you wanted to assess the relative success of B-HEARD versus traditional portion mechanism, what you would want to do is randomly assign mental health-related 911 calls to either B-HEARD or to the traditional sending in the NYPD officer,\" he said. \"They didn't do that.\"\nInstead, they responded to \"easier\" calls with less likelihood of violence, where subjects were not expected to require hospitalization, he added.\n\"It was set up such that B-HEARD was necessarily going to have a higher hit rate than the traditional NYPD officers because the NYPD officers were dealing with cases that B-HEARD was considered incompetent to handle,\" Lehman said. \"So if B-HEARD had been exposed to the same set of cases the NYPD was…one cannot rule out the possibility that they would have had essentially the same success rate as the NYPD police officers, just about 82% compliance.\"\n\nOn the bright side, however, Lehman said the program does show that sending EMTs, paramedics and social workers to certain low-risk calls can free up police officers to do more police work.\n\"If you want to have unarmed guys that go check on the guy who's talking to himself, that's fine,\" he said. \"But you're still going to need a guy who's prepared for when that situation turns violent.\"","author":" \n        By\n        Michael Ruiz   | Fox News"}
{"_id":{"$oid":"6101798bd799b45506911d80"},"imageUrl":"2de7cf73-5139-45bd-b4f6-4541fc938bf7","title":"Judge allows vaccinations in place of service hours for people on probation","description":"A judge in Baton Rouge, Louisiana, has offered some people on probation the option of getting the coronavirus vaccine instead of serving out court-mandated service hours.","url":"/us/judge-vaccines-baton-rouge-service-hours-probation","publicationDate":"2021-07-28T09:51:58-04:00","lastPublishedDate":"2021-07-28T09:51:58-04:00","category":{"name":"Louisiana","url":"/category/us/us-regions/southeast/louisiana"},"isBreaking":false,"isLive":false,"duration":"","contents":"A judge in Baton Rouge, , has offered some people on probation the option of getting the coronavirus  instead of serving out court-mandated service hours.\n\"Judges do innovative things like this all the time. For example, you have probably seen or heard in the past the judge would allow your donation of blood instead of community service work or instead of payment of the fine,\" . \"If a judge is going to make this offer, I think it's a reasonable one.\"\n\nJudge Fred T. Crifasi allowed at least two people the option to get the vaccine instead of finishing out their community service hours, according to court document reviewed by news outlet WBRZ. One of the offenders owed 33 hours of community service, according to the court records. \nThe district attorney added that anyone who is uncomfortable with the option can opt out. \n\"These judges in these circumstances are being totally reasonable, but I do understand that someone may think that way. And if that's the case, don't get vaccinated,\" Moore said.\nDefense Attorney Jarrett Ambeau, however, noted this might not be an appropriate offer, but added that Judge Crifasi is \"incredibly fair.\"\n\n\"I don't think the government is necessarily the right entity to be involved in me injecting something into my body,\" Ambeau said. \"Judge Crifasi himself, individually, is incredibly fair. The point is when a government actor steps in to ask you to do something like, 'will I suffer for not doing it?' And that is the question.\"\nThe incentive to get the vaccine has also spread to prisons in Louisiana, with the Department of Corrections saying inmates at state prisons are offered a $5 \"canteen credit\" for getting the shot, WBRZ reported. \n\nThe incentives come as the Biden administration continues encouraging Americans to get the vaccine, and says pushback against disinformation concerning the  is \nThe Centers for Disease Control and Prevention had said in May that fully vaccinated people were not required to wear masks indoors, but updated its mask guidance Tuesday for vaccinated people over the threat of the delta variant of the virus. It now urges people in some areas of the country with \"high\" or \"substantial\" COVID-19 transmission to mask up indoors. \nWhite House press secretary Jen Psaki noted Tuesday that vaccines \"work,\" adding masks are an \"extra step\" to protect against the virus.","author":" \n        By\n        Emma Colton   | Fox News"}
{"_id":{"$oid":"6101798ed799b45506911d81"},"imageUrl":"a59c233d-0521-42d8-a859-33398f287b9a","title":"NYC's Washington Square Park, once a hot spot in affluent neighborhood, succumbs to urban decay","description":"The latest available crime data from the NYPD's 6th Precinct, which includes Washington Square Park, shows rapes, robberies and felony assaults are up 100%, 42.4% and 10% year-to-date, respectively. Shooting incidents are up 200% year-to-date.","url":"/us/new-yorks-once-beautiful-washington-square-park-succumbs-to-urban-decay","publicationDate":"2021-07-26T08:02:51-04:00","lastPublishedDate":"2021-07-28T09:30:28-04:00","category":{"name":"New York City","url":"/category/us/new-york-city"},"isBreaking":false,"isLive":false,"duration":"","contents":"It was the backdrop for the popular TV show  the affluent neighborhood of , where real-life celebs have splurged on multimillion-dollar homes around Washington Square Park. But a lot has changed since then. The iconic urban oasis in Manhattan is succumbing to urban decay.\nAccording to the available  from the  6th Precinct as of July 28, 2021, which includes Washington Square Park, rapes, robberies and felony assaults are up 100%, 42.4% and 10% year-to-date, respectively. Shooting incidents are up 200% year-to-date. \n\nIn 2020, there were 95,593  of one of the seven major felony offenses, with Precinct 6 accounting for 1,427 of those . In Washington Square Park alone, there were four felony assault complaints and three grand larceny  between Jan. 1 and March 31, 2021. \nData obtained by  reveals local residents in Washington Square Park used New York's 311 service to file more than 190 requests between April 1 and June 15, with complaints ranging from drug use and homelessness to the park's cleanliness.\n\nFollowing an  with hundreds of concerned residents in attendance, the 6th Precinct stepped up its police presence and initiated a 10 p.m. curfew in June as part of an effort to reduce crime in the area. \nHowever, during a meeting last week, some residents criticized the police's effort as \"racist.\"\n\"This is all about affluent, White residents thinking that the park is their backyard and siccing the cops on Black and Brown, poor artists,\" one speaker named Ash said, according to .\nCritics of the move have pushed back against the effort with protests, resulting in  between park-goers and the NYPD. \n\nBut despite those critics of the 6th Precinct, others argue the city still isn't doing enough, including Andrew Giuliani, the son of former New York City Mayor Rudy Giuliani who has launched a bid for governor.\nAndrew Giuliani shared a video Sunday morning of a littered Washington Square Park after chaos over the weekend.\n\"It's a disaster, like a bomb went off in here,\" he said. \"It's crazy and chaos, that's all it is…it's time for a change.\"\nRepresentatives for the NYPD and Department of Homeless Services did not immediately return Fox News' requests for comment. \n","author":" \n        By\n        Lucas Manfredi   | Fox News"}
{"_id":{"$oid":"61017991d799b45506911d82"},"imageUrl":"dc8bf02e-91af-415a-be0f-96fd48ba5cd2","title":"Gunman opens fire in broad daylight in New York City, forcing woman pushing baby stroller to flee","description":"A gunman in Brooklyn was seen on surveillance video opening fire in broad daylight, forcing a woman pushing a baby stroller to flee the area.","url":"/us/brooklyn-gunman-nypd-broad-daylight","publicationDate":"2021-07-28T08:59:39-04:00","lastPublishedDate":"2021-07-28T08:59:39-04:00","category":{"name":"Crime","url":"/category/entertainment/genres/crime"},"isBreaking":false,"isLive":false,"duration":"","contents":"A gunman in  was seen on surveillance video opening fire in broad daylight, forcing passersby to flee the area, including a woman pushing a baby stroller. \n a black head covering and all black clothing opening  on another man near the corner of Wyckoff and Hoyt streets around 9 a.m. Monday morning. \n\nA woman pushing a baby stroller is seen leaving the scene as bullets fly, and another man is also seen running from the area. \n said a 53-year-old victim was shot in the foot and is being treated at a local hospital for his injuries. \nThe NYPD is asking the public for help identifying the suspect in the case. \n\nThe incident comes after New York City saw an especially bloody summer last year with 205 shooting incidents in June alone when protests and riots spread across the country in response to the death of George Floyd. Shootings dipped down this June, with police recording 165 shooting incidents.","author":" \n        By\n        Emma Colton   | Fox News"}
{"_id":{"$oid":"61017996d799b45506911d83"},"imageUrl":"f201cb3d-8433-4898-998b-553a1cd81008","title":"Heat warnings, advisories blanket most of central US","description":"Excessive Heat Warnings and Heat Advisories are widespread from the Northern Rockies to the Plains and Southeast as hot and humid conditions build with high temperatures climbing into the 90s and 100s.","url":"/us/heat-warnings-advisories-national-weather-forecast","publicationDate":"2021-07-28T08:03:36-04:00","lastPublishedDate":"2021-07-28T08:03:36-04:00","category":{"name":"Weather","url":"/category/weather"},"isBreaking":false,"isLive":false,"duration":"","contents":"Excessive Heat Warnings and Heat Advisories are widespread from the Northern Rockies to the Plains and Southeast as hot and humid conditions build with  climbing into the 90s and 100s.  \n will develop from the upper Midwest to the western Great Lakes.  \n\nLarge hail, damaging winds, and a few tornadoes are possible.  \nWith more than 80 large wildfires burning in the West and western Canada, upper-level winds will continue spreading smoke from the Northern Rockies to the Northeast, causing hazy skies and poor air quality.","author":" \n        By\n        Greg Norman   | Fox News"}
{"_id":{"$oid":"61017999d799b45506911d84"},"imageUrl":"bc892971-8e64-446e-8259-4c1d5fa9796e","title":"Austin police shortage at 'crisis' level, 911 callers forced to wait","description":"With fewer officers on the streets and no major recruitment plans in the works, law enforcement experts say it’s having a major ripple effect through one of the fastest-growing U.S. cities.","url":"/us/austin-police-department-down-150-cops-violent-crime-rate-soars","publicationDate":"2021-07-28T07:49:44-04:00","lastPublishedDate":"2021-07-28T07:49:44-04:00","category":{"name":"Austin","url":"/category/us/austin"},"isBreaking":false,"isLive":false,"duration":"","contents":"What would you do if somebody broke into your home? How would you handle seeing a  in progress? What if a loved one was in immediate danger? The majority of Americans would pick up the phone and dial 911 to request help from their . But what happens when there aren’t enough public servants to answer everybody’s plea?\nIn ’ capital city of  – home to a  and a spot that attracts millions of tourists annually – the man currently at the helm of the city’s police department is worried. He says his hands are effectively tied after the city council voted last August to .\n\"I call it a crisis because it is a crisis,\" interim Austin Police Chief Joseph Chacon said.\n\nChacon was referring to unprecedented staffing shortages inside his agency, including top administration leaders, as a result of the partial defunding. Chacon himself is currently vying with six other candidates in the ongoing national search for the department’s top spot, which is to be filled in August.\n\"About 150 positions are vacant right now,\" Chacon said. \"That’s not good for our overall crime rate in Austin.\"\nWith fewer officers on the streets and no major recruitment plans in the works, law enforcement experts say it’s having a major ripple effect through .\n\"Murders are up 96% compared to this time last year,\" Cary Roberts of the Greater Austin Crime Commission said.\nWhile Roberts stressed that Austin crime was going up even before the police department’s budget was cut, now the situation is even dicier. \n\"These are categories that concern the community so we need to do everything we can to address these problems, and to do it quickly,\" he said.\nTo make matters worse, now just getting officers to the scene of an emergency is proving to be a challenge. Current data shows the average police response time to a Priority 1 call (the most serious) is around nine minutes.\n\n\"When they get there, they then likely have to wait for back-up,\" said Kevin Lawrence, who serves as executive director of the Texas Municipal Police Association.\n\"They don’t have the resources they need to actually address whatever the situation is,\" he said.\nLawrence and others said the situation has  in the last year, after the Austin City Council cut $21.5 million from the police budget and diverted another $128 million away, injecting it into other city departments. That reduction accounted for a third of its total police budget. Austin was one of at least 20 major U.S. cities to trim police funding in the wake of 2020’s protests against police brutality.\nSupporters of the defund the police movement lauded the Austin City Council’s decision. Kathy Mitchell, with a group called \"Just Liberty,\" said it was much needed.\n\"We don’t want to have an overfunded Austin Police Department,\" she said.\nJoao Paolo, a member of the Austin Justice Coalition, agreed with that sentiment but expressed fears that change could soon be on the way. This week, the city council is expected to review and approve next year’s police budget. Paolo is afraid the members will cave to political pressure.\n\"Everything that we won last year is now at stake,\" he said.\n\nMembers of the law enforcement community don’t see it that way. They fear if the same amount of money is withheld again, the situation could easily go from bad to worse. \n\"We have to make evidence-based public policy decisions that keep the community safe \u0026 not be reactionary and reckless,\" said Cary Roberts of the Greater Austin Crime Commission.\nIn an effort to keep other Texas cities from following in Austin’s footsteps, Texas Republican  has since signed multiple pieces of legislation that would penalize communities for taking funds away from police budgets.\nIf a municipality larger than 225,000 residents takes away funding from law enforcement, the state would ban the city from increasing property taxes and sales tax revenues would be withheld. Larger metro areas (with more than 1 million residents) must now hold local elections before any reductions or allocations can be made with police department budgets.\n\"We have seen the consequences of  in communities across the country,\" said Abbott. \"This puts residents in danger and invites crime into communities and we can't allow this in Texas.\"","author":" \n        By\n        Casey Stegall   | Fox News"}
{"_id":{"$oid":"6101799cd799b45506911d85"},"imageUrl":"13cf4c8c-0264-4b3e-a136-ed2201e118e8","title":"Trump OMB chief Russ Vought investigating Biden admin ties to CRT group","description":"Russ Vought, a former top Trump administration official, on Wednesday demanded the Department of Education hand over documents that could show who was involved in promoting a radical critical race theory group in official government guidance.","url":"/us/critical-race-theory-biden-administration-russ-vought-investigation","publicationDate":"2021-07-28T07:37:02-04:00","lastPublishedDate":"2021-07-28T07:37:02-04:00","category":{"name":"EDUCATION","url":"/category/us/education"},"isBreaking":false,"isLive":false,"duration":"","contents":"Russ Vought, a former top  administration official, on Wednesday demanded the  hand over documents that could show who was involved in promoting a radical critical race theory group in official government guidance.\nVought, who is the president of the Center for Renewing America (the advocacy arm of his conservative think tank) and the former chief of the Office of Management and Budget, filed a Freedom of Information Act request for a number of communications regarding the Abolitionist Teaching Network. The Department of Education included a link to a guide the radical group developed in a handbook intended to help public schools reopen and spend American Rescue Plan funding.\n\"The American people deserve to know who at the highest levels in the  pushed this radical, racist group into reopening guidelines for our schools,\" Vought told Fox News in a statement.\n\"It's extremely troubling that  Department of Education promotes a group that accuses children of 'spirit murdering' other children based on their skin color,\" Vought continued. \"This Administration has made an Olympic sport out of State Sanctioned Racism and it's about time the curtain gets pulled back.\"\n\nThe Abolitionist Teaching Network's materials, including the guide the Department of Education linked to, incorporates language associated with critical race theory, Fox News .\n\"Abolitionist Teachers\" should \"[b]uild a school culture that engages in healing and advocacy. This requires a commitment to learning from students, families, and educators who disrupt Whiteness and other forms of oppression,\" the guide states, for example. It also discusses the \"spirit murder\" of people of color.\nThe group’s co-founder and board chair, Bettina Love, said during a webinar: \"I want us to be feared.\"\nAfter Fox News revealed the connection to the Abolitionist Teaching Network, a Department of Education spokesperson said \"\" to include the link.\nBut at least two top department officials have links to Love, Fox News .\nThe department’s second-in-command, Cindy Marten, hosted Love for a training seminar while the deputy secretary headed the San Diego Unified School District. The school system paid Love $11,000 for the gig, records show.\nMarten wasn’t confirmed until after the handbook was published, though she was nominated months prior.\nAdditionally, the National Education Association hosted Love at a June 2020 event. At the time, acting Assistant Secretary Donna Harris-Aikens, who heads the office that published the Department of Education handbook, was a senior official with the teachers union.\nThe documents Vought requested Wednesday could show deeper ties between the Abolitionist Teaching Network and the Biden administration. The former Trump official asked for any Department of Education records involving the network’s materials.\nVought also requested communications between the department and the Abolitionist Teaching Network as well as communications with other executive branch components, including the White House, involving the radical group.\nVought took an aggressive stance toward critical race theory while serving in the Trump administration. The Center for Renewing America has likewise been at the forefront over such battles.\nWhile serving as OMB director, Vought  federal agencies from spending any funding on training regarding critical race theory or White privilege.\nMeanwhile, the Center for Renewing America recently created a  to help people prevent critical race theory from being included in school curricula.  ","author":" \n        By\n        Ethan Barton   | Fox News"}
{"_id":{"$oid":"6101799ed799b45506911d86"},"imageUrl":"0aebf208-a6dc-4e20-981b-86ce6d0058dc","title":"Young bull moose in Colorado parking garage is tranquilized, removed: photos","description":"The Lionshead Village business center in Vail, Colorado, removed an unwelcome visitor Tuesday morning: a young bull moose that wandered into the parking garage of the complex.","url":"/us/bull-moose-colorado-parking-garage-tranquilized-removed-photos","publicationDate":"2021-07-28T07:05:45-04:00","lastPublishedDate":"2021-07-28T07:05:45-04:00","category":{"name":"Colorado","url":"/category/us/us-regions/west/colorado"},"isBreaking":false,"isLive":false,"duration":"","contents":"The Lionshead Village business center in Vail, , removed an unwelcome visitor Tuesday morning: a young  that wandered into the parking garage of the complex.\nThe moose was estimated to be between 2 and 3 years old, and about 750 pounds, according to Colorado Parks and Wildlife officers.\nThe animal had been seen in the area for about the past 10 days, and was possibly attracted by de-icing products that had been used inside the garage, the wildlife department said in a statement.\n\nWildlife staff increasingly became concerned that harm could come to the moose or to people or property in the area, the department said.\nOn Tuesday, officials decided to tranquilize the moose and transport it to a more  outside Craig, Colorado, the department said.\n\n\"Everything went smoothly this morning. No issues,\" wildlife officer Devin Duval said about the operation, which happened around 8:25 a.m. \"We were definitely within that human-health-and-safety realm where there could potentially be an injury a human or the animal. That is the reason we decided to move it.\"\nThe parking lot is used primarily for people connected to Lionshead Village or to the Vail Health hospital, the department said.\n","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"610179a0d799b45506911d87"},"imageUrl":"eacd503f-91a0-4936-8cc2-c456e97ec52d","title":"Off-duty FDNY firefighter beaten in park; 2 teen suspects charged with gang assault","description":"Two teen suspects were arrested Tuesday over their alleged role in the brutal beatdown of a 44-year-old off-duty FDNY firefighter in a Queens park.","url":"/us/teen-charged-assault-beatdown-fdny-firefighter","publicationDate":"2021-07-28T06:40:51-04:00","lastPublishedDate":"2021-07-28T06:40:51-04:00","category":{"name":"New York City","url":"/category/us/new-york-city"},"isBreaking":false,"isLive":false,"duration":"","contents":"Two teen suspects were arrested Tuesday over their alleged role in the brutal beatdown of a 44-year-old off-duty FDNY firefighter in a  park, police said.\nThe boys, ages 14 and 15, were turned over by their parents to police and subsequently charged with gang assault in the caught-on-video attack in Juniper Valley Park last Friday night, cops said.\nA third suspect remains on the loose.\nThe unidentified juveniles are accused of ganging up on the victim, who was walking his dog, after he confronted a large unruly crowd of teens setting off fireworks and creating a ruckus in the park, according to the \nThe man was eventually able to escape the mayhem and suffered some cuts and bruises, but refused medical attention.\nHis pooch, who was scooped up by a good Samaritan, was not hurt.\n\nIn the video footage, the mob can be seen closing in on their victim, who puts up his hands as his Labradoodle barks in protest.\n\"Give him a shot! Give him a shot! Give him a shot!\" one teen repeatedly implores, the video shows.\n\"Yo, what the f–k!\" shouts a stunned onlooker as the unidentified victim is pummeled on the pavement.\n","author":" \n        By\n        Kenneth Garger   | New York Post"}
{"_id":{"$oid":"610179a4d799b45506911d88"},"imageUrl":"21960fcd-18e7-4b49-a542-63845004f764","title":"Tampa police spent money on booze, lap dances during undercover probe, review board says","description":"Tampa police officers working undercover allegedly treated themselves to lap dances – plus drinks for themselves and dancers – during an undercover operation last year at a strip club in the city, an internal investigation found, according to a report on Tuesday. ","url":"/us/tampa-police-booze-lap-dances-undercover-probe-review-board","publicationDate":"2021-07-28T06:11:48-04:00","lastPublishedDate":"2021-07-28T06:11:48-04:00","category":{"name":"Florida","url":"/category/us/us-regions/southeast/florida"},"isBreaking":false,"isLive":false,"duration":"","contents":" police officers working undercover allegedly treated themselves to lap dances – plus drinks for themselves and dancers – during an undercover operation last year at a strip club in the city, an internal investigation found, according to a report on Tuesday. \nDetails of the undercover operation at the Gold Club in Tampa were discussed during a Citizens Review Board hearing Tuesday. The panel was tasked with taking a second look at the department's internal affairs investigation into the incident. \nSgt. Daniel Rhodes, supervisor of the operation, – which cost the department’s investigatory fund $421 –  said the goal was to locate drug suspects and gather intelligence on a shooting suspect who had ties to one of the dancers, according to FOX 13 of Tampa. \n\nBut over the course of three hours, an unspecified number of officers spent the money on cover charges, along with drinks for themselves, dancers, and the dancers’ friends. Each officer also bought a own lap dance, according to the station.  \nThe internal affairs report stated that officers who went to the strip club got to know the dancers but failed to generate any new leads. No arrests were made and officers gave conflicting reports as to why they were at the club conducting the undercover operation, according to internal investigators.\nThe Tampa Police Department  saying that \"discovering misconduct of any of our officers is always disheartening and unacceptable and the department will not tolerate this behavior.\" \n\"There is a check and balance. The accountability was there and that was one of the things the community asked for, was accountability,\" added board member Carolyn Collins.\nThe official plan of the operation was to investigate prostitution and drug complaints, according to the station. \nThe internal affairs report said Rhodes allowed officers to write operational plans without proper oversight, leading to a misunderstanding of the objective. \n\nRhodes was found to have violated his supervisory responsibilities, FOX 13 reported. He was suspended for one day, and removed from the Tampa Police Street Anti-Crime Squad\nThe internal review findings were signed off at the board hearing Tuesday, but Collins questioned why Rhodes – who remains with the force as a sergeant – wasn't given a harsher punishment. \n\n\"The penalty, or the violation of a one-day suspension and moving him around does not look like it is enough for what he did,\" Collins said.","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"610179a6d799b45506911d89"},"imageUrl":"e6826676-ab1e-4a57-b880-93938908cd2e","title":"Capitol riot hearing kicks off with cops blaming Trump, GOP for Jan. 6 unrest","description":"","url":"/us/capitol-riot-cops-trump-gop-jan-6-unrest","publicationDate":"2021-07-28T04:59:17-04:00","lastPublishedDate":"2021-07-28T04:59:17-04:00","category":{"name":"Fox News First","url":"/category/columns/fox-news-first"},"isBreaking":false,"isLive":false,"duration":"","contents":"Four police officers who defended  from a mob that invaded it Jan. 6 criticized former President Trump – and Republicans who are loyal to him – for allegedly inspiring and then downplaying the attack.\nThey asked members of the House select committee investigating the events of that day to get to the bottom of Trump and the GOP's culpability.\n\"You guys are the only ones we've got to deal with crimes that occur above us,\" Metropolitan Police Department (MPD) Officer Daniel Hodges said. \"I need you guys to address if anyone in power had a role in this. If anyone in power coordinated, or aided abetted or tried to downplay, tried to prevent the investigation of this terrorist attack.\"\nThe officers made the comments before a panel with no hostile questioners. Republicans pulled all of their appointees to the committee after House Speaker Nancy Pelosi, D-Calif., blocked two of them for being too closely aligned with Trump.\nThe fact that the only Republicans on the committee – Reps. Adam Kinzinger, R-Ill., and Liz Cheney, R-Wyo. – were selected by Pelosi made for a hearing with little dissent or fireworks. But with graphic body camera video and emotional testimony, the hearing was still gripping and at times jarring television. .- NYT reporter  tweets urging Trump supporters to be called 'enemies of the state' amid backlash- Rep. Jordan  Pelosi of kicking him off Jan. 6 Capitol commission for raising 'fundamental' questions- GOP Rep. Jim Banks: Dem-led Jan. 6 committee's Capitol Hill hearing  ‘performance art’- Hannity: Jan. 6 commission's only goal  to 'smear Donald Trump and the GOP on national television'- Sen. Kennedy: If partisanship  an Olympic sport, Pelosi would take home the gold- CNN's John Avlon  Cheney, Kinzinger for 'stepping up' on Jan. 6 committee: 'This is about patriotism'\nThe mayor of Seattle is calling on the city to rebuild its depleted police force after six separate shootings rocked Washington state's largest metro area over the weekend. \n\"As a city, we cannot continue on this current trajectory of losing police officers,\" Seattle Mayor Jenny Durkan said during a Monday news conference. \"Over the past 17 months, the Seattle Police Department has lost 250 police officers, which is the equivalent of over 300,000 service hours. We’re on path to losing 300 police officers.\"\nDurkan added the weekend violence was a \"reminder\" that there are certain emergency situations that require sworn police officers.\n\"It is a false choice between community-led solutions and police officers,\" Durkan said. \"We need both.\" .- Activists  police don't prevent crime like saying 'there's no proof water is wet': Kira Davis- Colorado police officer  after allegedly pistol-whipping, choking man during arrest- Alabama police officer fatally  in ambush outside home during lunch break- Soros  $1 million to group attempting to defund police as violent crime skyrockets nationwide\nSimone Biles, the superstar gymnast from the U.S., will not participate in the individual all-around competition at the Tokyo Games and will instead focus on her mental well-being, USA Gymnastics said in a statement early Wednesday. \nThe decision comes a day after she pulled out of the team all-around competition.\nJade Carey, who finished ninth in qualifying, will take Biles’ place in the individual all-around competition.\n\"After further medical evaluation, Simone Biles has withdrawn from the final individual all-around competition at the Tokyo Olympic Games,\" USA Gymnastics said in a statement posted on Twitter on Wednesday night. \"We wholeheartedly support Simone's decision and applaud her bravery in prioritizing her well-being. Her courage shows, yet again, why she is a role model for so many.\"\nThe statement said Biles will be evaluated daily to see if she can \"participate in next week’s individual event finals.\" .\n- Simone Biles  support from Athleta: 'We are inspired'- Column: For Biles, it finally all  too much- Ledecky  gold at Tokyo Games in women's 1,500-meter freestyle- Iranian defector  anti-Semitism by dedicating Olympic medal to Israel, thanks country in Hebrew\n- Ellzey  US House seat in Texas in closely watched race- New Jersey town  case against ‘F--- Biden’ sign lady after ACLU intervenes: report- California movie theater  during 'Forever Purge' leaves 1 dead, 1 wounded, police say- Abbott s Texas National Guard to assist with arrests at US-Mexico border- Swalwell affair with Chinese spy  US intel: Breitbart editor- Starbucks  fall on reduced China outlook- IBM: Cost of data  hit 17-year high- Google revenue  as online advertising market thrives- Activision Blizzard CEO  letter to employees, admits ‘tone deaf’ response to lawsuit- Wyoming town  Bill Gates’ TerraPower nuclear plant will help replace 200-plus coal-related jobs \n\n\n\n\n","author":" \n        By\n        Jack Durschlag   | Fox News"}
{"_id":{"$oid":"610179a8d799b45506911d8a"},"imageUrl":"87879a2f-bd96-4fdf-8c56-e7a2b35feb33","title":"Wisconsin defendant gets 205 years in slayings of 5 relatives: ‘Just had blood on my mind’","description":"A 44-year-old Wisconsin man was sentenced Tuesday to more than 200 years in prison, plus another 105 years of extended supervision, after pleading guilty in June to fatally shooting five members of his family, according to a report.","url":"/us/wisconsin-defendant-gets-205-years-in-slayings-of-5-relatives-just-had-blood-on-my-mind","publicationDate":"2021-07-28T04:56:22-04:00","lastPublishedDate":"2021-07-28T04:56:22-04:00","category":{"name":"Wisconsin","url":"/category/us/us-regions/midwest/wisconsin"},"isBreaking":false,"isLive":false,"duration":"","contents":"A 44-year-old  man was sentenced Tuesday to more than 200 years in prison, plus another 105 years of extended supervision, after pleading guilty in June to  five members of his family, according to a report.\nChristopher Stokes of Milwaukee reportedly called 911 himself after the  on April 27, 2020, FOX 6 of Milwaukee reported.\n\"Um, I just massacred my whole family,\" Stokes reportedly told a 911 dispatcher. \"The gun is still upstairs with the bodies. … I just killed my whole family with my Mossberg.\"\nStokes made two calls after 10:30 a.m. that morning and was seated on the steps outside the house when authorities arrived, according to FOX 6. He quickly told them what he had done, the report said.\n\nAuthorities searched the home and found a 12-gauge Mossberg shotgun in one of the bedroom and also found a box of 25 shells that had 12 unused shells remaining, the report said.\nIn June, Stokes pleaded guilty to five counts of first-degree reckless homicide and one count of possession of a firearm by a felon in connection with the case.\n\"Don’t know what in the world came over me,\" Stokes said at his sentencing hearing, according to FOX 6. \"Woke up and just had blood on my mind.\"\n\nThe defendant expressed remorse, saying \"I deserve to be locked up,\" .\nKilled in the rampage were Teresa Thomas, 41; Marcus Stokes, 19; Lakeitha Stokes, 17; Tera Agee, 16; and Demetrious Thomas, 14.\nStokes’ attorney had asked for a sentence of 35 years, according to the report.","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"610179aad799b45506911d8b"},"imageUrl":"389bcee5-8720-4cde-9163-aea91c9aca62","title":"Nevada brings back mask mandate in high-transmission areas, echoing CDC guidance","description":"Nevada is reinstating a coronavirus mask mandate requiring people in high-transmission areas to wear masks in public indoor spaces – regardless of vaccination status.","url":"/us/nevada-brings-mask-mandate-high-transmission-areas-echoing-cdc-guidance","publicationDate":"2021-07-28T04:44:56-04:00","lastPublishedDate":"2021-07-28T04:44:56-04:00","category":{"name":"Nevada","url":"/category/us/us-regions/west/nevada"},"isBreaking":false,"isLive":false,"duration":"","contents":"is reinstating a mask mandate requiring people in high-transmission areas to wear masks in public indoor spaces – regardless of status.\nThe mandate becomes effective at 12:01 a.m. Friday in 12 of 17 counties in Nevada, according to state health officials on Tuesday. \n\"Businesses and residents in counties with substantial or high transmission are strongly urged to adopt the changes as soon as possible,\" officials said in a .\n\nThe mandate follows guidance from the Centers for Disease Control and Prevention (CDC), which earlier in the day urged fully vaccinated Americans to wear masks indoors in areas with high transmission. In May, Gov. Steve Sisolak signed an emergency directive  on mask-wearing, FOX 5 Vegas reported.\nLas Vegas, Carson City, and Reno are among the cities the indoor mask requirement applies to. The Nevada Gaming Control Board noted the mandate would also apply to casinos in counties with high transmission rates.\nIn Nevada, and throughout the U.S., the highly contagious Delta variant continues to fuel a recent spike in cases. As of Tuesday, at least 1,143 people in the state were , according to state data. \n\n\"This update comes as the Delta variant now accounts for the majority of new cases,\" the statement added. \"The Delta variant has shown to be much more contagious and spreads more than twice as easily from one person to another, compared with earlier strains.\"\nMost new infections continue to be among unvaccinated people. Breakthrough cases have occurred, but they generally cause milder illness.\n\nSisolak’s directive instructs officials to adopt new CDC mask guidelines for students and teachers, though officials said Tuesday that they intend to have \"continued conversations\" with school officials about recommendations and implementation.\nReno officials added that they plan on requiring masks at their facilities – including city hall and indoor pools – starting Wednesday.\n","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"610179add799b45506911d8c"},"imageUrl":"8d64d0de-56bc-4069-bdf3-58e04dbf150e","title":"Minnesota police officer’s shooting death on Indian reservation prompts FBI probe: report","description":"A police officer was fatally shot in the line of duty on an Indian reservation in Minnesota on Tuesday morning – prompting an FBI investigation, according to a report.","url":"/us/minnesota-police-officer-shooting-death-red-lake-indian-reservation-fbi","publicationDate":"2021-07-28T03:23:36-04:00","lastPublishedDate":"2021-07-28T03:25:30-04:00","category":{"name":"Minnesota","url":"/category/us/us-regions/midwest/minnesota"},"isBreaking":false,"isLive":false,"duration":"","contents":"A tribal  was  in the line of duty on an Indian reservation in  on Tuesday morning – prompting an FBI investigation, according to a report.\nThe victim was identified as Officer Ryan Bialke, 37, of the Red Lake Police Department, FOX 9 of Minneapolis reported.\nAccording to the station, Red Lake police had responded to the Red Lake Indian Reservation on a report of a potentially suicidal male at a residence. \nWhen officers arrived, a suspect fired at them, striking Bialke, the report said. The officer later died at a hospital, the Bemidji Pioneer newspaper reported.\nThe suspect, who was not immediately identified, was ultimately taken into custody, according to FOX 9.\n\nHe had fled into a wooded area after shooting the officer, .\nFurther details about the suspect’s alleged actions or possible motivation were not immediately available.\nThe suspect is expected to face federal charges in the coming days in connection with the officer’s death, .\nBialke was a six-year veteran of the department and leaves behind a wife and four children, the newspaper reported.\nAll non-essential tribal activity at the reservation was halted Tuesday in response to the officer’s death, the station reported, and tribal offices and businesses were directed to lower flags to half-staff.\n\n\"It is with heavy hearts to announce that the Red Lake Nation lost a police officer this morning,\" the Red Lake Tribal Council wrote in a statement, .\nThe Red Lake reservation is located in northern Minnesota, about 275 miles north of the Twin Cities area.\n","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"610179b0d799b45506911d8d"},"imageUrl":"40133115-2f5b-40b9-bcf4-a7aacbe1955c","title":"Texas chemical leak kills 2, injures 6; described as 'mass casualty' incident","description":"At least two people are dead and six others are injured after a chemical leak at a Texas facility on Tuesday, officials said.","url":"/us/chemical-leak-texas-facility-leaves-least-2-dead-injured","publicationDate":"2021-07-28T02:26:08-04:00","lastPublishedDate":"2021-07-28T02:26:08-04:00","category":{"name":"Texas","url":"/category/us/us-regions/southwest/texas"},"isBreaking":false,"isLive":false,"duration":"","contents":"At least two people are dead and six others are injured after a chemical leak at a facility on Tuesday, officials said. \nEmergency officials responded to a \"mass casualty\" incident at the LyondellBasell complex in La Porte, just after 7:30 p.m., according to the Harris County Fire Marshal. \nLyondellBasell said in a statement that its complex experienced an acetic acid leak, which occurred within its acetyls unit area that had been shut down earlier in the day for planned maintenance.\n\n\"The leak is stopped and clean-up is in progress,\" LyondellBasell . \"Air monitoring continues to demonstrate no levels of concern for the community. All appropriate regulatory agencies have been notified.\"\nLyondellBasell said two contractors were killed. Among the injured were five contractors and a LyondellBasell employee, who were transported to local hospitals for treatment, the chemical industry company said. \n\nOfficials told that the chemicals involved in the incident were methyl iodide, hydrogen iodide, and methyl acetate. They could potentially cause severe burns and are toxic if inhaled, according to the station. \nHarris County Fire Marshal Laurie Christensen told the  that a decontamination process was currently underway for workers.\nChristensen also stated that a \"chemical type explosion release\" occurred that was very small and contained within the plant. Video taken by Houston's KTRK-TV appeared to show first responders spraying water onto plant equipment. \nFOX 4 reported that officials later stated there was no explosion or fire.\nLee Woodward, City Secretary and Public Information Officer for the City of La Porte added there is no active shelter-in-place order for the local community. \n\nAn investigation is underway into the cause of this incident, the company stated. ","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"610179b3d799b45506911d8e"},"imageUrl":"45c5184f-86eb-4bd5-822d-f8f00f2aa0eb","title":"Abbott orders Texas National Guard to assist with arrests at US-Mexico border","description":"Gov. Greg Abbott on Tuesday ordered Texas National Guard members to assist the Department of Public Safety (DPS) in arresting illegal immigrants at the border who break state laws.","url":"/us/abbott-texas-national-guard-migrant-arrests-us-mexico-border","publicationDate":"2021-07-28T00:57:21-04:00","lastPublishedDate":"2021-07-28T00:57:21-04:00","category":{"name":"Greg Abbott","url":"/category/person/greg-abbott"},"isBreaking":false,"isLive":false,"duration":"","contents":"Texas Gov. on Tuesday ordered the state's  members to assist the Department of Public Safety (DPS) in arresting  at the US.-Mexico border who break  laws.\nAbbott's order was included in a letter sent to Major Gen. Tracy R. Norris of the Texas Military Department. \nThe order expands on Abbott's June disaster declaration, which  the DPS to enforce all federal and state criminal laws, including those on criminal trespassing, smuggling, and human trafficking. That declaration had allowed the use of all available state resources to assist state and local law enforcement in from \"criminal activity and property damage.\" \n\n\"To respond to this disaster and secure the rule of law at our Southern border, more manpower is needed,\" Abbott . \"DPS needs help in arresting those who are violating state law. … I hereby order that the Texas National Guard assist DPS in enforcing Texas law by arresting lawbreakers at the border.\"\nThe order comes as the tackles a surge in migration and illegal contraband at the border.  the surge on a rollback of Trump-era border policies and enforcement, while the Biden administration has blamed the Trump administration and \"root causes\" in Central America.\n\"President Biden's open-border policies have paved the way for dangerous gangs and cartels, human traffickers, and deadly drugs like fentanyl to pour into our communities,\" Abbott said in a statement last month. \n\nIn June, border authorities stopped crossings, which was the highest this year, according to the Texas Tribune. The previous high of 180,641 was set in May.\nAbbott, a Republican, held a security briefing at the Texas Statehouse in Austin this month, where sheriffs from local communities expressed their need for more manpower, more jail space, and more judges, FOX 7 of Austin . \n\n\"People think that this is a border-related issue and it is, but this is also an issue that affects counties across the entire state of Texas,\" said Abbott.","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"610179b6d799b45506911d8f"},"imageUrl":"5384b8f9-74be-4507-bc5e-0d3631f478b4","title":"California movie theater shooting during 'Forever Purge' leaves 1 dead, 1 wounded, police say","description":"Gunfire erupted inside a movie theater in Corona, California, on Monday night, killing a woman, 18, and leaving a man fighting for his life.","url":"/us/california-movie-theater-shooting-forever-purge-corona-1-dead-1-wounded","publicationDate":"2021-07-27T23:41:35-04:00","lastPublishedDate":"2021-07-27T23:41:35-04:00","category":{"name":"California","url":"/category/us/us-regions/west/california"},"isBreaking":false,"isLive":false,"duration":"","contents":"Gunfire erupted inside a movie theater in Corona, , on Monday night, killing a woman, 18, and leaving a man fighting for his life.\nAuthorities responded to Regal Edwards Corona Crossings around 11:45 p.m. and found the two victims suffering from gunshot wounds, the Corona Police Department said. \nThe woman, who died at the scene, was identified as Rylee Goodrich. The other victim, Anthony Barajas, 19, was transported to a hospital and was on life support, police said. Authorities had yet to announce any arrests, FOX 11 of Los Angeles . \n\n the victims, both from Corona, were inside the theater watching the 9:35 p.m. showing of \",\" which they attended together. Six tickets were sold for that showing, police added. \nGloria Jennifer Castro said she was watching a movie with her family in another part of the theater when the film stopped abruptly. \n\"They told us to leave. There was an emergency, just leave fast,\" Castro said, according to . \"It's pretty scary, the fact we didn't know nothing was going on. Just scary.\"\n\nDuring the investigation and sweep of the theater Tuesday, police said detectives recovered items of \"evidentiary value,\" but did not locate a firearm inside. \nThey added there was no evidence from witnesses or surveillance footage that someone shot the victims and fled the scene, The Press-Enterprise . \nDetectives are following up on leads to identify \"the person(s) responsible for this heinous crime,\" police said. \n\nAnyone with information on the shooting is asked to call the Corona Police Department at 951-817-5839.\nCorona is about 50 miles southeast of Los Angeles. ","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"610179bad799b45506911d90"},"imageUrl":"f1b7ede0-6dbf-4216-8f48-3433ba7031b7","title":"California movie theater shooting during 'Forever Purge' leaves 1 dead, 1 wounded, police say","description":"Gunfire erupted inside a movie theater in Corona, California, on Monday night, killing a woman, 18, and leaving a man fighting for his life.","url":"/us/california-movie-theater-shooting-forever-purge-corona-1-dead-1-wounded","publicationDate":"2021-07-27T23:41:35-04:00","lastPublishedDate":"2021-07-27T23:41:35-04:00","category":{"name":"California","url":"/category/us/us-regions/west/california"},"isBreaking":false,"isLive":false,"duration":"","contents":"Gunfire erupted inside a movie theater in Corona, , on Monday night, killing a woman, 18, and leaving a man fighting for his life.\nAuthorities responded to Regal Edwards Corona Crossings around 11:45 p.m. and found the two victims suffering from gunshot wounds, the Corona Police Department said. \nThe woman, who died at the scene, was identified as Rylee Goodrich. The other victim, Anthony Barajas, 19, was transported to a hospital and was on life support, police said. Authorities had yet to announce any arrests, FOX 11 of Los Angeles . \n\n the victims, both from Corona, were inside the theater watching the 9:35 p.m. showing of \",\" which they attended together. Six tickets were sold for that showing, police added. \nGloria Jennifer Castro said she was watching a movie with her family in another part of the theater when the film stopped abruptly. \n\"They told us to leave. There was an emergency, just leave fast,\" Castro said, according to . \"It's pretty scary, the fact we didn't know nothing was going on. Just scary.\"\n\nDuring the investigation and sweep of the theater Tuesday, police said detectives recovered items of \"evidentiary value,\" but did not locate a firearm inside. \nThey added there was no evidence from witnesses or surveillance footage that someone shot the victims and fled the scene, The Press-Enterprise . \nDetectives are following up on leads to identify \"the person(s) responsible for this heinous crime,\" police said. \n\nAnyone with information on the shooting is asked to call the Corona Police Department at 951-817-5839.\nCorona is about 50 miles southeast of Los Angeles. ","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"610179bdd799b45506911d91"},"imageUrl":"1295a880-77a4-43c5-93ad-1e5fd16300fa","title":"Ninth Circuit limits feds' confiscation of cellphones, laptops at points of entry: report","description":"Border agents operating at some U.S. ports of entry, airports and shipping ports are facing new limits regarding their ability to confiscate travelersâ€™ personal electronic devices, according to a report.","url":"/us/ninth-circuit-confiscate-cellphones-laptops-points-of-entry","publicationDate":"2021-07-27T23:25:37-04:00","lastPublishedDate":"2021-07-27T23:25:37-04:00","category":{"name":"Border security","url":"/category/us/immigration/border-security"},"isBreaking":false,"isLive":false,"duration":"","contents":" operating at some U.S. ports of entry,  and shipping ports are facing new limits regarding their ability to confiscate travelers’ personal , according to a report.\nIn a decision reached in June, the San Francisco-based  for the Ninth Circuit all but eliminated agents’ ability to access people’s cellphones and laptops without a warrant, according to Border Report.\nThe decision – which applies only to the western U.S. states that lie within the Ninth Circuit’s jurisdiction -- effectively places limits on law enforcement in those areas to seek evidence of crime, the report said.\n\nThe ruling limits agents of U.S. Customs and Border Protection (CBP) to searching only for digital contraband, such as child pornography, the report said.\nEv Meade of the Trans-Border Institute at the University of San Diego, said the ruling appeared to be intended to rein in agents’ apparent overstepping of their authority regarding the confiscation of devices.\n\"Under the previous administration, officers kept a blacklist under homeland security and they blacklisted reporters, humanitarian workers and lawyers, and they seized their phones and laptops,\" Meade told the outlet. \"It’s very reasonable to question the scope of these searches and to say you’re doing it under the pretexts of homeland security. The court clearly said no.\n\"And have they actually shown it serves some compelling public purpose to have violated these people’s privacy?\" she continued. \"No, the government has not met the burden that there was some compelling public interest in violating people’s privacy.\"\n\nThe case stems from a 2018 incident in which CBP personnel ordered a man to unlock and hand over his cellphone at the port of entry in San Ysidro, California, the report said. The traveler was a U.S. citizen and border agents had downloaded all his data, photos and contact information, according to the report.\nCourt filings said the man was among about 41,000 travelers to have their phones and/or laptops searched by agents between October 2018 and October 2019, .\nThe Ninth Circuit covers the following states: Alaska, Arizona, California, Hawaii, Idaho, Montana, Nevada, Oregon and Washington, plus territories Guam and the Northern Mariana Islands.","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"610179c0d799b45506911d92"},"imageUrl":"22c15314-c5a7-485c-a831-55a08a60c606","title":"Texas police learn COVID-positive illegal immigrants sent to local hotels, after Whataburger encounter","description":"Authorities in South Texas said they learned that undocumented immigrants who have testes positive for COVID-19 are being released from federal custody to a Catholic charity, which booked hotel rooms for them without notifying local officials.","url":"/us/texas-police-covid-illegal-immigrants-whataburger","publicationDate":"2021-07-27T21:48:55-04:00","lastPublishedDate":"2021-07-27T21:48:55-04:00","category":{"name":"Illegal Immigrants","url":"/category/us/immigration/illegal-immigrants"},"isBreaking":false,"isLive":false,"duration":"","contents":" in South  said Tuesday they've learned that  who have possibly tested positive for COVID-19 were being released from federal custody to a Catholic charity, which booked hotel rooms for them without notifying local officials. \nThe La Joya Police Department said a patrol officer was waved down Monday by someone concerned about a group that appeared to be sick at a  fast food restaurant. The officer found a family inside who were coughing and sneezing and not adhering to health guidelines, including the wearing of masks, authorities said during a news conference.\nA manager told the officer they wanted the people to leave the establishment because they were making everyone inside \"uneasy.\" When the officer approached the migrants, they said they had tested positive for the coronavirus and had been apprehended by Border Patrol agents several days prior before being released. \nThey didn't have documentation to prove they were COVID-positive, La Joya police Sgt. Manuel Casas said.\n\n\"We did not know this,\" he said. \"No one told the city of La Joya. No one told the police department that these people were here and no one told us that these people were possibly ill.\"\nThe migrants told the officer they were staying at the nearby Texas Inn \u0026 Suites. The hotel manager told authorities that the Catholic Charities of The Rio Grande Valley had booked rooms in the hotel to house undocumented immigrants detained by Border Patrol. \n\"We have an understanding based on what was told to us that the hotel in totality has already been rented out,\" Casas said. \"The information we have is that everyone that is staying in that hotel is COVID-19 positive because it's being rented out for them.\"\nAt the hotel, officers observed 20 to 30 people outside not wearing masks, the police department said in a social media post. The wearing of masks is not mandated but those exhibiting COVID-19 symptoms should wear one, Casas said. \nHe said the department cannot stop any of the migrants from leaving the hotel and moving on to another destination in the United States. \nPolice later learned that those detained by Border Patrol showing symptoms or who became infected with COVID-19 were being quarantined and then later handed over to the charity group to be placed in hotels in the McAllen area, as well as La Joya, police said. \nIn a statement to Fox News, a U.S. Customs and Border Protection spokesperson said the Rio Grande Valley sector has encountered \"significant numbers of undocumented migrants crossing the border.\"\n\"During these challenging times, our federal, state, and local partnerships are indispensable as we work to secure our borders and to quickly move individuals out of USBP custody and through the appropriate immigration pathway,\" the spokesperson said. \nOfficials contacted the Hidalgo County Department of Health and Human Services, which said it will look into the matter. \nFox News has reached out to the Catholic charity group. Casas acknowledged the charity was trying to help the migrants and may have been overwhelmed when they booked the hotel rooms. \nAn employee at the hotel declined to give his name but told Fox News there were undocumented migrants at the hotel but he wasn't sure how many. \n\"There are so many people trying to help,\" he said. \"We don't have any problems here (with COVID-19).\"\n\nIn response to the news, city officials are asking the public to adhere to social distancing measures and wear masks. \nIllegal border crossings have surged under the  administration. U.S. Customs and Border Protection recently announced there were nearly 190,000 migrant encounters at the southern border in June. The total number of encounters for the fiscal year topped 1 million, according to the figures. \nOn Tuesday, Texas Gov. , a Republican, ordered the Texas  to assist the state Department of Public Safety in making arrests related to the border.","author":" \n        By\n        Louis Casiano   | Fox News"}
{"_id":{"$oid":"61017c5134347e15d5f62649"},"imageUrl":"14818510-a6eb-461b-8062-fcbb4e85f51e","title":"Maryland man threatened Fauci, vowed to ‘set on fire’ he and his family, Justice Department says","description":"A Maryland man is now facing federal charges after allegedly sending threatening emails to Dr. Anthony Fauci, including one vowing that he and his family would be “dragged into the street, beaten to death, and set on fire,” the Justice Department says.","url":"/us/maryland-man-charged-threatening-anthony-fauci","publicationDate":"2021-07-28T11:37:21-04:00","lastPublishedDate":"2021-07-28T11:37:21-04:00","category":{"name":"Anthony Fauci","url":"/category/person/anthony-fauci"},"isBreaking":false,"isLive":false,"duration":"","contents":"A Maryland man is now facing federal charges after allegedly sending threatening emails to , including one vowing that he and his family would be \"dragged into the street, beaten to death, and set on fire,\" the Justice Department says. \nThomas Connally, 56, of Greenbelt, risks being  if convicted on charges of threats against a federal official and interstate communication containing a threat to harm. \n\"We will never tolerate violent threats against public officials,\" Acting U.S. Attorney Jonathan Lenzner . \"Our public health officials deserve our thanks and appreciation for their tireless work, and we will not hesitate to bring charges against those individuals who seek to use fear to silence these public servants.\" \n\nThe Justice Department, citing an affidavit and criminal complaint, alleges that \"from December 28, 2020 to July 21, 2021, Connally used an email account from a provider of secure, encrypted email services based in Switzerland, to send a series of emails to Dr. Anthony Fauci, the current Director of the National Institute of Allergy and Infectious Diseases (\"NIAID\") and the Chief Medical Advisor to President of the United States, threatening to harm and/or kill him and members of his family.\" \nIn the , prosecutors say one of Connally’s emails to Fauci contained the line \"I hope you have every bone in your skull broken with crowbars and sledgehammers.\" \n\"You and your entire family will be dragged into the street, beaten to death, and set on fire,\" read another one of the messages, according to the affidavit. \n\n\"As detailed in the affidavit, also on April 24, 2021, just 30 minutes before the seven emails were sent to Dr. Fauci, Dr. Francis Collins, the Director of the NIH, received a total of four threatening emails from the same encrypted email address associated with Connally,\" the Justice Department added in their statement. \nConnally is set to make his first court appearance Wednesday. ","author":" \n        By\n        Greg Norman   | Fox News"}
{"_id":{"$oid":"61017c5434347e15d5f6264a"},"imageUrl":"74151450-4c6f-4f57-8601-252dfa857de2","title":"New York shark sightings, potential attack forces officials to monitor beaches","description":"Shark sightings and a potential attack have forced beachgoers in New York out of the water this week.","url":"/us/new-york-beach-shark-sighting-potential-attack","publicationDate":"2021-07-28T11:08:17-04:00","lastPublishedDate":"2021-07-28T11:08:17-04:00","category":{"name":"US","url":"/category/us"},"isBreaking":false,"isLive":false,"duration":"","contents":"Shark sightings and a potential  have forced  in  out of the water this week. \n said Tuesday that they would use drones and helicopters to surveil Long Island beaches for the creatures after a lifeguard said he was bitten by something near Central Mall on Monday morning. \n\n, the Office of Parks, Recreation and Historic Preservation said that it would work together with New York State , increasing staffing and deploying patrol and surfboats to monitor the area. \n\"Long Island beaches are a crucial resource for New Yorkers in summer, and we must make sure people feel safe when visiting,\" . \"With assistance from New York State Police, we are expanding our measures to patrol for sharks and other potentially dangerous . I encourage all New Yorkers to familiarize themselves with the steps they can take to stay safe while enjoying a day at the beach.\"\nThe department noted that additional sightings had been reported at Jones Beach in the past week, including one on Tuesday, and that the investigation into Monday's incident was ongoing. \nA photo from  shows an injury on the lifeguard's left calf and George Gorman Jr., the regional director for the state park system, said the lifeguard \"felt a tug and then he saw a fin\" at around 11 a.m. ET that day. \nThe station reported that the lifeguard was treated at the scene before moving to a nearby  for \"further examination.\"\nBoth WNBC and  that the second sighting happened on Tuesday morning just after 11 a.m. ET, prompting an order for swimmers to get out of the water. \n\nAccording to PIX11, there were 20 confirmed shark sightings at Long Island beaches in the summer of 2020.\nIn June,  nicknamed \"Freya\" was seen off the coast of Long Island and the  shoreline.\n, the recovery of shark prey species is leading to an increase in shark bites around the world, rising from 157 incidents between 1970 and 1979 to almost 800 between 2010 and 2019.\nIn 2020, the U.S. experienced , the most in the world.\nThe state parks department assured that it will continue to follow shark alert protocols including suspending swimming while shores are inspected by drones.\n\"Swimming is only allowed to resume at least an hour after the last sighting. All sightings, including today's incident, are referred to the Long Island Coastal Awareness Group, which consists of 160 municipalities, agencies and private beach operators stretching from Queens through Long Island,\" the department wrote. \"State Parks created this alert system in 2018 after shark interactions off Fire Island. State Park lifeguards are continuously scanning and patrolling the waters and are on the lookout for any dangerous marine life, such as sharks.\"\n\nTo minimize the risk of shark interactions, the New York Department of Environmental Conservation advises that residents avoid areas with seals, schools of bait fish, areas with people fishing, murky water and isolation. \nAdditionally, the department recommends swimmers avoid swimming in the ocean at dusk, dawn or at night, swim close to shore in shallow water, follow the instructions of lifeguards and staff and adhere to all important signage. \n","author":" \n        By\n        Julia Musto   | Fox News"}
{"_id":{"$oid":"61017c5834347e15d5f6264b"},"imageUrl":"bba642b0-9e09-4b6d-976b-87c261f4bb00","title":"Pennsylvania officer faces child luring charge after being busted by ‘concerned citizens'","description":"A Pennsylvania police officer was busted in an underage sex sting conducted by a group of “concerned citizens” posing as children, police said.","url":"/us/pennsylvania-officer-child-luring-charge-busted-by-concerned-citizens","publicationDate":"2021-07-28T10:51:02-04:00","lastPublishedDate":"2021-07-28T10:51:02-04:00","category":{"name":"Police and Law Enforcement","url":"/category/us/crime/police-and-law-enforcement"},"isBreaking":false,"isLive":false,"duration":"","contents":"A  police officer was busted in an underage sex sting conducted by a group of \"concerned citizens\" posing as children, police said. \nClifford Horn, a 54-year-old corporal for the Central Bucks Regional , had little to say when approached in Atlantic City, New Jersey, Sunday by a man who runs Colorado Ped Patrol — a group that attempts to nab child predators, video shows. \n\"We’re just having a conversation with a gentleman trying to meet with a child,\" Thomas Fellows of the vigilante group tells Horn as the officer was allegedly caught in the act. \n\n\"Your zipper’s down, by the way,\" Fellows continues. \"You’re standing in front of the running car. We got your text messages. Listen, man, you want to talk and tell us why you’re here?\" \n\"I’m not trying to meet with a child,\" replies Horn, who apparently said his name was Matt in the purported texts. \nThe officer then starts to walk away as Fellows urges him to \"take accountability\" for his actions. \nHe was later arrested by waiting cops, video shows. \nAtlantic City police confirmed Horn’s arrest Sunday, saying in a statement he was among four men charged with luring/enticing a child by various means following \"assistance\" from the public. \n\"The concerned citizens were engaged in posing as underage children on various social media sites,\" police said. \"They would confront the individual and notify law enforcement.\" \n\nResponding cops were provided screenshots of conversations between the suspects and the citizen group prior to their arrests, police said. \nHorn, of Chalfont, allegedly went onto Grindr to set up a sex act with someone he thought was a 14-year-old boy, sending a photo of himself in his underwear, WPVI reported. \nFellows told the Philadelphia Inquirer he confronted Horn at a location that had been arranged online hours earlier. He said he was unaware that the man was a police officer, but suspected he was an attorney. \n\"He was just too good,\" Fellows told the newspaper. \"He wouldn’t talk.\" \nFellows, who started his group in April after one of his sons was sexually assaulted, said he creates dating app profiles posing as young teen girls or boys and waits for people to respond. Meetings then usually occur within hours, Fellows said. \n\"They reach out to us,\" he said. \"We never reach out to them.\" \n\nHorn and the three other men who were arrested since Thursday on the same charge were released on a summons, Atlantic City police said. \nThe other suspects were identified as Jose Machuca, 51, of Hyattsville, Maryland; Sambatrimiaina Raminoson, 26, of Atlantic City; and Eugene Pulley, 49, of Philadelphia. \nHorn was suspended late Monday without pay effective immediately, CBS Philadelphia reported. \nBucks County District Attorney Matt Weintraub said Monday his office will start evaluating all criminal cases in which Horn was involved. \n\n\"Our office has assigned personnel to assist New Jersey authorities in any capacity, and to investigate and prosecute any criminal activity that may have occurred in Bucks County,\" Weintraub said in a statement. \n\"This office protects all victims, regardless of whether the accused perpetrator is an officer of the law or not. No one is above the law.\" \n","author":"  New York Post"}
{"_id":{"$oid":"61017c5b34347e15d5f6264c"},"imageUrl":"38e80803-14ae-414f-8f5e-070b61ee5baf","title":"Illinois authorities hunt suspect who escaped prison transport van on way to jail","description":"Illinois authorities are searching for a suspect who escaped from custody by hopping out of a transport van on its way to jail","url":"/us/illinois-manhunt-suspect-escape-transport-van","publicationDate":"2021-07-28T10:32:25-04:00","lastPublishedDate":"2021-07-28T10:32:25-04:00","category":{"name":"Illinois","url":"/category/us/us-regions/midwest/illinois"},"isBreaking":false,"isLive":false,"duration":"","contents":" authorities are searching for a  who escaped from custody by hopping out of a transport van on its way to jail. \nHugo R. Avila, 21, was in custody of the Elgin Police Department in relation to felony traffic related offenses, and was being transported to the Kane County Sheriff’s Department when he escaped around 1:05 p.m. Tuesday from a transport vehicle in the area of Randall Road and Route 64 in St. Charles, Illinois, according to a .\nKane County Sheriff Ron Hain said Avila managed to slip out of his handcuffs and got out of the vehicle while the officer behind the wheel was stopped in traffic. Authorities checked several businesses along the the corridor between Route 64 and Dean Street, Hain added.\n\nElgin officers who responded to the scene were unsuccessful in locating Avila, who was last seen wearing a white T-shirt and blue jeans while fleeing from the area in a northeast direction. St. Charles Police Department and the Kane County Sheriff's Department are aiding in continuing search efforts.\nAvila is described as 5-foot-8, weighing about 125 pounds and having black hair and brown eyes. Police ask anyone who spots him to dial 911 and to avoid making contact.\n\nAccording to Kane County court records, Avila was charged on Monday with aggravated fleeing and eluding a police officer, speeding 21 mph over the speed limit, not having a valid driver's license and possessing drug paraphernalia, the Chicago Tribune reported.","author":" \n        By\n        Danielle Wallace   | Fox News"}
{"_id":{"$oid":"61017c5e34347e15d5f6264d"},"imageUrl":"635b2dad-ef70-49d4-98be-d57c0a7642ce","title":"Minnesota sets new state records for murders, assaults on police officers in 2020","description":"Minnesota saw the highest number of murders on record in 2020, as well the most assaults against police officers in the line of duty ever recorded within a one-year period, according to the annual uniform crime report released by the Bureau of Criminal Apprehension on Tuesday.","url":"/us/minnesota-murder-record-2020-assaults-police-officers","publicationDate":"2021-07-28T10:14:29-04:00","lastPublishedDate":"2021-07-28T10:14:29-04:00","category":{"name":"Minnesota","url":"/category/us/us-regions/midwest/minnesota"},"isBreaking":false,"isLive":false,"duration":"","contents":" saw the highest number of  on record in 2020, as well the most assaults against  in the line of duty ever recorded within a one-year period, according to the annual  released by the Bureau of Criminal Apprehension on Tuesday. \nJust a few months into last year, the onset of the coronavirus pandemic in the U.S. brought economic uncertainty, which further escalated as Minneapolis became the tipping point for sometimes violent demonstrations calling to \"defund the police\" in reaction to viral bystander video showing former Officer Derek Chauvin pressing his knee to the back of ’s neck until the Black man died. \nReeling from the aftermath, Minnesota recorded a 16.6% increase in violent crimes in 2020. There were 185 murders in 2020 in Minnesota compared to 117 in 2019, an increase of 58.1%, the report says. The 2020 number also tops by two the 183 total from 1995, which previously had been the highest total. Also, 75% of the murders in 2020 were committed with a firearm, up from 69% in 2019.\nThere were 667 incidents last year involving an officer or officers assaulted in the line of duty. That represents a 62% increase over 2019, and more than any other year on record, the report says. \n\nBias crimes spiked the highest in 15 years, rising sharply in 2020 with 223 incidents reported. According to the bureau, 41% of the 2020 incidents were motivated by anti-Black or African American bias.\nRev. Jerry McAfee, a civil rights activist who organized community patrols in north Minneapolis in response to a series of shootings that left at least two children dead this year, said the numbers of assaults, rapes and other violent crime counted by the bureau may be underreported. \n\"When you have a police force operating 200 under, the distrust some of the people have with the police department, some good, some bad, and the overall level of trauma that exists within our community, it's rough out here,\" McAfee told the . \nAfter his 6-year-old granddaughter was killed by stray bullets earlier this year, local peace activist K.G. Wilson, who’s worked for decades helping to keep children out of gangs and guns off the streets, said he’s choosing to leave Minneapolis amid the record-breaking crime surge.  \n\"I’m just done in Minneapolis. I don’t want to work here. I don’t want to be here,\" Wilson told  in an on-camera interview Tuesday. Despite his efforts, Wilson said, \"All I feel like I got in return is a murdered 6-year-old granddaughter and no arrests, and it’s been two months later.\" \nThe bureau report says there were 31 officer-involved shooting incidents recorded in 2020, an increase of six over 2019, and almost evenly split between the Twin Cities metro and Greater Minnesota.\nOut of the 45 use-of-force incidents reported by Minnesota agencies last year, 21 involved individuals who were White, 14 were Black, three were Asian, three were American Indian and five were unknown.\nAfter a significant downward trend over the past several years, arson rose 53.7% over 2019. There were 710 arsons reported in 2020 and 462 in 2019. Motor vehicle theft rose 19.7% in 2020 with 13,662 vehicles stolen as compared to 11,410 in 2019. The 2020 total is the highest since 2005.\nThe value of property stolen in 2020 topped $216 million, a 54.5% increase over 2019. Some of the biggest increases were in the value of stolen food and grooming products, money and vehicles.\nMinnesota Republicans argued that the report released Tuesday shows Democrats have been taking too lenient of an approach to crime and the data further supports the need for more law enforcement. \nBut Minneapolis officials have been supporting a measure that would allow voters in November to decide whether to \"replace\" the police department and are, meanwhile, fighting a judge’s ruling siding with northern Minneapolis residents wanting more cops hired to abide by the city charter. \n\nState Sen. Warren Limmer, chair of the Public Safety and Judiciary Committee and a Republican, said Tuesday’s report \"confirms what we've been talking about for several years at the Senate: Violent criminals are finding more victims and lenient accountability measures in the judicial system are not keeping people safe.\"  \nState Rep. Brian Johnson, another Republican, also released a statement highlighting GOP proposals in the House that would involve sending Minnesota State Patrol into high-risk areas of Minneapolis, expanding the police force and promoting the use of ShotSpotter technology, the Tribune reported. ","author":" \n        By\n        Danielle Wallace   | Fox News"}
{"_id":{"$oid":"61017c6034347e15d5f6264e"},"imageUrl":"eb7ed471-98ab-4aa8-9bff-9c8cd995066c","title":"San Francisco shoplifting: Women caught on video allegedly bolting from CVS with bags full of stolen goods","description":"A witness captured a group of women running out of a San Francisco CVS Pharmacy with bags allegedly stuffed full of stolen items as a spree of retail thefts continue to plague the city.","url":"/us/san-francisco-shoplifting-retail-cvs-pharmacy-video","publicationDate":"2021-07-28T10:14:08-04:00","lastPublishedDate":"2021-07-28T10:14:08-04:00","category":{"name":"San Francisco","url":"/category/us/san-francisco"},"isBreaking":false,"isLive":false,"duration":"","contents":"A witness captured a group of women running out of a  CVS Pharmacy with bags allegedly stuffed full of  items as a spree of retail thefts continue to plague the city.\nThe incident, first reported by , happened around 5 p.m. Monday at the drugstore located at Van Ness Avenue and Jackson Street.\n\nWitness Steve Adams told Lee that the four women were \"picking the place dry\" and that when he asked store employees if they were going to call police, \"they just shrugged.\"\n\"This sort of thing is becoming so normal,\" the witness told Lee.\nRetail thefts have been troubling major cities in recent months, forcing some stores .\nMultiple incidents in California have been captured on video, including  that shows a group of shoplifters dashing out of a Neiman Marcus department store in San Francisco and jumping into idling getaway cars.\nMeanwhile in Los Angeles, another  last week appears to show two men in the suburb of Granda Hills casually leaving a TJ Maxx store with their arms full of items.\nAuthorities and retail officials in San Francisco have said that packs of shoplifters have regularly made off with merchandise to be resold.\nShoplifters aren't stealing \"one or two items that someone might need to get by,\" San Francisco Police Department spokesman Robert Rueca . \"Our investigations have shown that there are organized fences where people are selling these products that they steal.\"\nMillions of dollars’ worth of merchandise has been stolen from retailers in San Francisco, California Retail Association President Rachel Michelin told Fox News, adding that the funds from stolen items are ultimately used by crime syndicates.\n\nState officials have begun making efforts to crack down on a surge of retail thefts and other crimes following the recent surge of incidents involving shoplifters. \nCalifornia Gov. Gavin Newsom, who is facing a recall vote,  around the California Highway Patrol and local agencies to address organized theft rings. \n","author":" \n        By\n        Stephen Sorace   | Fox News"}
{"_id":{"$oid":"61017c6334347e15d5f6264f"},"imageUrl":"615a4195-efc1-487d-92dc-1d44c975bfcb","title":"Expert slams NYC's data on sending social workers to 911 calls, suffers from selection bias","description":"The New York City Mayor’s Office of Community Mental Health has released the results of the first month of a new program designed to send social workers and other unarmed first responders to answer certain 911 calls.","url":"/us/new-york-city-social-workers-911","publicationDate":"2021-07-28T10:10:18-04:00","lastPublishedDate":"2021-07-28T10:10:18-04:00","category":{"name":"New York City","url":"/category/us/new-york-city"},"isBreaking":false,"isLive":false,"duration":"","contents":"The  Mayor’s Office of Community Mental Health has released the results of the first month of a new program designed to send social workers and other unarmed first responders to answer certain 911 calls instead of .\nThey show the Behavioral Health Emergency Assistance Response Division (B-HEARD) pilot program saw a positive outlook after its trial run in parts of Harlem last month – but critics note that the program had its choice of calls to respond to and selected easy ones, making the rosy outlook an obvious conclusion.\nAnd while the program may have freed up officers from having to respond to about 20% of specialized mental health 911 calls, experts don’t foresee the replacement or abolition of police.\n\n\"What you do when you disarm cops or when you send unarmed civilians in to do cop’s job is to expose civil employees to substantial risk, and then say you don't get the tools of the trade that are requisite to minimizing that risk,\" Charles F. Lehman, of the conservative Manhattan Institute think tank, told Fox News Tuesday. \"It's like denying a firefighter or mine worker or electrical worker his safety equipment.\"\nLehman outlined his conclusions in a column for the institute’s public policy magazine, the , also published Tuesday: Because social workers were not sent to high-risk calls, the data suffered from a selection bias and an \"apples-to-apples comparison\" is impossible.\nDispatchers sent about 25% of mental health calls to B-HEARD in its first month, according to the  and that is expected to rise to 50% in the future.\nBut those call exclude incidents involving suspected violence, imminent harm or a subject who requires hospitalization.\n\nOf the 138 calls 911 dispatchers sent to B-HEARD, the pilot program responded to only 107 of them.\n\"The remaining calls received the traditional response by NYPD and EMS, typically because the B-HEARD teams were busy responding to another call,\" the city said in a statement.\nOr because it was deemed too difficult or risky for an unarmed response, Lehman said, adding that the issue was not necessarily with how the city presented its data as much as with how the mainstream media touted the results.\nIn seven of those calls, B-HEARD responders called in NYPD backup. Comparatively, the NYPD requested assistance from B-HEARD on 14 occasions. The city report did not go into further detail but said \"inter-agency coordination is working well.\"\nThe B-HEARD data amounts to an experiment set up without a controlled variable, Lehman said, meaning what the city reported isn’t fair to use in a direct comparison to data on regular police responses.\n ran an article Friday with the headline, \"Mental Health Response Teams Yield Better Outcomes Than Police In NYC, Data Shows.\"\nIt highlighted the city’s finding that just half of B-HEARD mental health calls required a patient’s hospitalization compared to 82% of mental health 911 calls that saw a traditional response.\n\"A New York City pilot program that dispatches mental health specialists and paramedics instead of police for certain nonviolent emergency calls has resulted in more people accepting assistance and fewer people sent to the hospital, early data shows,\" the article reads.\nAnd New York City’s NBC affiliate  a \"New York City pilot program to respond to 911 calls for mental health crises with social workers instead of cops appears to be reducing unnecessary hospitalizations.\"\nBut of course, fewer people were sent to the hospital when calls that dispatchers knew would require hospitalization were not routed to B-HEARD from the start, Lehman noted.\n\"If you wanted to assess the relative success of B-HEARD versus traditional portion mechanism, what you would want to do is randomly assign mental health-related 911 calls to either B-HEARD or to the traditional sending in the NYPD officer,\" he said. \"They didn't do that.\"\nInstead, they responded to \"easier\" calls with less likelihood of violence, where subjects were not expected to require hospitalization, he added.\n\"It was set up such that B-HEARD was necessarily going to have a higher hit rate than the traditional NYPD officers because the NYPD officers were dealing with cases that B-HEARD was considered incompetent to handle,\" Lehman said. \"So if B-HEARD had been exposed to the same set of cases the NYPD was…one cannot rule out the possibility that they would have had essentially the same success rate as the NYPD police officers, just about 82% compliance.\"\n\nOn the bright side, however, Lehman said the program does show that sending EMTs, paramedics and social workers to certain low-risk calls can free up police officers to do more police work.\n\"If you want to have unarmed guys that go check on the guy who's talking to himself, that's fine,\" he said. \"But you're still going to need a guy who's prepared for when that situation turns violent.\"","author":" \n        By\n        Michael Ruiz   | Fox News"}
{"_id":{"$oid":"61017c6434347e15d5f62650"},"imageUrl":"ba3e9209-dfc7-4fb6-97f9-39012a8841ec","title":"Judge allows vaccinations in place of service hours for people on probation","description":"A judge in Baton Rouge, Louisiana, has offered some people on probation the option of getting the coronavirus vaccine instead of serving out court-mandated service hours.","url":"/us/judge-vaccines-baton-rouge-service-hours-probation","publicationDate":"2021-07-28T09:51:58-04:00","lastPublishedDate":"2021-07-28T09:51:58-04:00","category":{"name":"Louisiana","url":"/category/us/us-regions/southeast/louisiana"},"isBreaking":false,"isLive":false,"duration":"","contents":"A judge in Baton Rouge, , has offered some people on probation the option of getting the coronavirus  instead of serving out court-mandated service hours.\n\"Judges do innovative things like this all the time. For example, you have probably seen or heard in the past the judge would allow your donation of blood instead of community service work or instead of payment of the fine,\" . \"If a judge is going to make this offer, I think it's a reasonable one.\"\n\nJudge Fred T. Crifasi allowed at least two people the option to get the vaccine instead of finishing out their community service hours, according to court document reviewed by news outlet WBRZ. One of the offenders owed 33 hours of community service, according to the court records. \nThe district attorney added that anyone who is uncomfortable with the option can opt out. \n\"These judges in these circumstances are being totally reasonable, but I do understand that someone may think that way. And if that's the case, don't get vaccinated,\" Moore said.\nDefense Attorney Jarrett Ambeau, however, noted this might not be an appropriate offer, but added that Judge Crifasi is \"incredibly fair.\"\n\n\"I don't think the government is necessarily the right entity to be involved in me injecting something into my body,\" Ambeau said. \"Judge Crifasi himself, individually, is incredibly fair. The point is when a government actor steps in to ask you to do something like, 'will I suffer for not doing it?' And that is the question.\"\nThe incentive to get the vaccine has also spread to prisons in Louisiana, with the Department of Corrections saying inmates at state prisons are offered a $5 \"canteen credit\" for getting the shot, WBRZ reported. \n\nThe incentives come as the Biden administration continues encouraging Americans to get the vaccine, and says pushback against disinformation concerning the  is \nThe Centers for Disease Control and Prevention had said in May that fully vaccinated people were not required to wear masks indoors, but updated its mask guidance Tuesday for vaccinated people over the threat of the delta variant of the virus. It now urges people in some areas of the country with \"high\" or \"substantial\" COVID-19 transmission to mask up indoors. \nWhite House press secretary Jen Psaki noted Tuesday that vaccines \"work,\" adding masks are an \"extra step\" to protect against the virus.","author":" \n        By\n        Emma Colton   | Fox News"}
{"_id":{"$oid":"61017c6634347e15d5f62651"},"imageUrl":"ac683f4b-05d4-4f30-8d3b-bbc99e3d4631","title":"NYC's Washington Square Park, once a hot spot in affluent neighborhood, succumbs to urban decay","description":"The latest available crime data from the NYPD's 6th Precinct, which includes Washington Square Park, shows rapes, robberies and felony assaults are up 100%, 42.4% and 10% year-to-date, respectively. Shooting incidents are up 200% year-to-date.","url":"/us/new-yorks-once-beautiful-washington-square-park-succumbs-to-urban-decay","publicationDate":"2021-07-26T08:02:51-04:00","lastPublishedDate":"2021-07-28T09:30:28-04:00","category":{"name":"New York City","url":"/category/us/new-york-city"},"isBreaking":false,"isLive":false,"duration":"","contents":"It was the backdrop for the popular TV show  the affluent neighborhood of , where real-life celebs have splurged on multimillion-dollar homes around Washington Square Park. But a lot has changed since then. The iconic urban oasis in Manhattan is succumbing to urban decay.\nAccording to the available  from the  6th Precinct as of July 28, 2021, which includes Washington Square Park, rapes, robberies and felony assaults are up 100%, 42.4% and 10% year-to-date, respectively. Shooting incidents are up 200% year-to-date. \n\nIn 2020, there were 95,593  of one of the seven major felony offenses, with Precinct 6 accounting for 1,427 of those . In Washington Square Park alone, there were four felony assault complaints and three grand larceny  between Jan. 1 and March 31, 2021. \nData obtained by  reveals local residents in Washington Square Park used New York's 311 service to file more than 190 requests between April 1 and June 15, with complaints ranging from drug use and homelessness to the park's cleanliness.\n\nFollowing an  with hundreds of concerned residents in attendance, the 6th Precinct stepped up its police presence and initiated a 10 p.m. curfew in June as part of an effort to reduce crime in the area. \nHowever, during a meeting last week, some residents criticized the police's effort as \"racist.\"\n\"This is all about affluent, White residents thinking that the park is their backyard and siccing the cops on Black and Brown, poor artists,\" one speaker named Ash said, according to .\nCritics of the move have pushed back against the effort with protests, resulting in  between park-goers and the NYPD. \n\nBut despite those critics of the 6th Precinct, others argue the city still isn't doing enough, including Andrew Giuliani, the son of former New York City Mayor Rudy Giuliani who has launched a bid for governor.\nAndrew Giuliani shared a video Sunday morning of a littered Washington Square Park after chaos over the weekend.\n\"It's a disaster, like a bomb went off in here,\" he said. \"It's crazy and chaos, that's all it is…it's time for a change.\"\nRepresentatives for the NYPD and Department of Homeless Services did not immediately return Fox News' requests for comment. \n","author":" \n        By\n        Lucas Manfredi   | Fox News"}
{"_id":{"$oid":"61017c6834347e15d5f62652"},"imageUrl":"9aa80d5d-d7ad-4112-8e0f-55ed9c938cb4","title":"Gunman opens fire in broad daylight in New York City, forcing woman pushing baby stroller to flee","description":"A gunman in Brooklyn was seen on surveillance video opening fire in broad daylight, forcing a woman pushing a baby stroller to flee the area.","url":"/us/brooklyn-gunman-nypd-broad-daylight","publicationDate":"2021-07-28T08:59:39-04:00","lastPublishedDate":"2021-07-28T08:59:39-04:00","category":{"name":"Crime","url":"/category/entertainment/genres/crime"},"isBreaking":false,"isLive":false,"duration":"","contents":"A gunman in  was seen on surveillance video opening fire in broad daylight, forcing passersby to flee the area, including a woman pushing a baby stroller. \n a black head covering and all black clothing opening  on another man near the corner of Wyckoff and Hoyt streets around 9 a.m. Monday morning. \n\nA woman pushing a baby stroller is seen leaving the scene as bullets fly, and another man is also seen running from the area. \n said a 53-year-old victim was shot in the foot and is being treated at a local hospital for his injuries. \nThe NYPD is asking the public for help identifying the suspect in the case. \n\nThe incident comes after New York City saw an especially bloody summer last year with 205 shooting incidents in June alone when protests and riots spread across the country in response to the death of George Floyd. Shootings dipped down this June, with police recording 165 shooting incidents.","author":" \n        By\n        Emma Colton   | Fox News"}
{"_id":{"$oid":"61017c6d34347e15d5f62653"},"imageUrl":"b9dffbe0-fed8-4954-86d8-a681c4978c88","title":"Heat warnings, advisories blanket most of central US","description":"Excessive Heat Warnings and Heat Advisories are widespread from the Northern Rockies to the Plains and Southeast as hot and humid conditions build with high temperatures climbing into the 90s and 100s.","url":"/us/heat-warnings-advisories-national-weather-forecast","publicationDate":"2021-07-28T08:03:36-04:00","lastPublishedDate":"2021-07-28T08:03:36-04:00","category":{"name":"Weather","url":"/category/weather"},"isBreaking":false,"isLive":false,"duration":"","contents":"Excessive Heat Warnings and Heat Advisories are widespread from the Northern Rockies to the Plains and Southeast as hot and humid conditions build with  climbing into the 90s and 100s.  \n will develop from the upper Midwest to the western Great Lakes.  \n\nLarge hail, damaging winds, and a few tornadoes are possible.  \nWith more than 80 large wildfires burning in the West and western Canada, upper-level winds will continue spreading smoke from the Northern Rockies to the Northeast, causing hazy skies and poor air quality.","author":" \n        By\n        Greg Norman   | Fox News"}
{"_id":{"$oid":"61017c7034347e15d5f62654"},"imageUrl":"35891362-a2f8-4557-9150-19738f0319eb","title":"Austin police shortage at 'crisis' level, 911 callers forced to wait","description":"With fewer officers on the streets and no major recruitment plans in the works, law enforcement experts say it’s having a major ripple effect through one of the fastest-growing U.S. cities.","url":"/us/austin-police-department-down-150-cops-violent-crime-rate-soars","publicationDate":"2021-07-28T07:49:44-04:00","lastPublishedDate":"2021-07-28T07:49:44-04:00","category":{"name":"Austin","url":"/category/us/austin"},"isBreaking":false,"isLive":false,"duration":"","contents":"What would you do if somebody broke into your home? How would you handle seeing a  in progress? What if a loved one was in immediate danger? The majority of Americans would pick up the phone and dial 911 to request help from their . But what happens when there aren’t enough public servants to answer everybody’s plea?\nIn ’ capital city of  – home to a  and a spot that attracts millions of tourists annually – the man currently at the helm of the city’s police department is worried. He says his hands are effectively tied after the city council voted last August to .\n\"I call it a crisis because it is a crisis,\" interim Austin Police Chief Joseph Chacon said.\n\nChacon was referring to unprecedented staffing shortages inside his agency, including top administration leaders, as a result of the partial defunding. Chacon himself is currently vying with six other candidates in the ongoing national search for the department’s top spot, which is to be filled in August.\n\"About 150 positions are vacant right now,\" Chacon said. \"That’s not good for our overall crime rate in Austin.\"\nWith fewer officers on the streets and no major recruitment plans in the works, law enforcement experts say it’s having a major ripple effect through .\n\"Murders are up 96% compared to this time last year,\" Cary Roberts of the Greater Austin Crime Commission said.\nWhile Roberts stressed that Austin crime was going up even before the police department’s budget was cut, now the situation is even dicier. \n\"These are categories that concern the community so we need to do everything we can to address these problems, and to do it quickly,\" he said.\nTo make matters worse, now just getting officers to the scene of an emergency is proving to be a challenge. Current data shows the average police response time to a Priority 1 call (the most serious) is around nine minutes.\n\n\"When they get there, they then likely have to wait for back-up,\" said Kevin Lawrence, who serves as executive director of the Texas Municipal Police Association.\n\"They don’t have the resources they need to actually address whatever the situation is,\" he said.\nLawrence and others said the situation has  in the last year, after the Austin City Council cut $21.5 million from the police budget and diverted another $128 million away, injecting it into other city departments. That reduction accounted for a third of its total police budget. Austin was one of at least 20 major U.S. cities to trim police funding in the wake of 2020’s protests against police brutality.\nSupporters of the defund the police movement lauded the Austin City Council’s decision. Kathy Mitchell, with a group called \"Just Liberty,\" said it was much needed.\n\"We don’t want to have an overfunded Austin Police Department,\" she said.\nJoao Paolo, a member of the Austin Justice Coalition, agreed with that sentiment but expressed fears that change could soon be on the way. This week, the city council is expected to review and approve next year’s police budget. Paolo is afraid the members will cave to political pressure.\n\"Everything that we won last year is now at stake,\" he said.\n\nMembers of the law enforcement community don’t see it that way. They fear if the same amount of money is withheld again, the situation could easily go from bad to worse. \n\"We have to make evidence-based public policy decisions that keep the community safe \u0026 not be reactionary and reckless,\" said Cary Roberts of the Greater Austin Crime Commission.\nIn an effort to keep other Texas cities from following in Austin’s footsteps, Texas Republican  has since signed multiple pieces of legislation that would penalize communities for taking funds away from police budgets.\nIf a municipality larger than 225,000 residents takes away funding from law enforcement, the state would ban the city from increasing property taxes and sales tax revenues would be withheld. Larger metro areas (with more than 1 million residents) must now hold local elections before any reductions or allocations can be made with police department budgets.\n\"We have seen the consequences of  in communities across the country,\" said Abbott. \"This puts residents in danger and invites crime into communities and we can't allow this in Texas.\"","author":" \n        By\n        Casey Stegall   | Fox News"}
{"_id":{"$oid":"61017c7234347e15d5f62655"},"imageUrl":"deaddd95-4a2f-4cfc-a024-d46cc723ff15","title":"Trump OMB chief Russ Vought investigating Biden admin ties to CRT group","description":"Russ Vought, a former top Trump administration official, on Wednesday demanded the Department of Education hand over documents that could show who was involved in promoting a radical critical race theory group in official government guidance.","url":"/us/critical-race-theory-biden-administration-russ-vought-investigation","publicationDate":"2021-07-28T07:37:02-04:00","lastPublishedDate":"2021-07-28T07:37:02-04:00","category":{"name":"EDUCATION","url":"/category/us/education"},"isBreaking":false,"isLive":false,"duration":"","contents":"Russ Vought, a former top  administration official, on Wednesday demanded the  hand over documents that could show who was involved in promoting a radical critical race theory group in official government guidance.\nVought, who is the president of the Center for Renewing America (the advocacy arm of his conservative think tank) and the former chief of the Office of Management and Budget, filed a Freedom of Information Act request for a number of communications regarding the Abolitionist Teaching Network. The Department of Education included a link to a guide the radical group developed in a handbook intended to help public schools reopen and spend American Rescue Plan funding.\n\"The American people deserve to know who at the highest levels in the  pushed this radical, racist group into reopening guidelines for our schools,\" Vought told Fox News in a statement.\n\"It's extremely troubling that  Department of Education promotes a group that accuses children of 'spirit murdering' other children based on their skin color,\" Vought continued. \"This Administration has made an Olympic sport out of State Sanctioned Racism and it's about time the curtain gets pulled back.\"\n\nThe Abolitionist Teaching Network's materials, including the guide the Department of Education linked to, incorporates language associated with critical race theory, Fox News .\n\"Abolitionist Teachers\" should \"[b]uild a school culture that engages in healing and advocacy. This requires a commitment to learning from students, families, and educators who disrupt Whiteness and other forms of oppression,\" the guide states, for example. It also discusses the \"spirit murder\" of people of color.\nThe group’s co-founder and board chair, Bettina Love, said during a webinar: \"I want us to be feared.\"\nAfter Fox News revealed the connection to the Abolitionist Teaching Network, a Department of Education spokesperson said \"\" to include the link.\nBut at least two top department officials have links to Love, Fox News .\nThe department’s second-in-command, Cindy Marten, hosted Love for a training seminar while the deputy secretary headed the San Diego Unified School District. The school system paid Love $11,000 for the gig, records show.\nMarten wasn’t confirmed until after the handbook was published, though she was nominated months prior.\nAdditionally, the National Education Association hosted Love at a June 2020 event. At the time, acting Assistant Secretary Donna Harris-Aikens, who heads the office that published the Department of Education handbook, was a senior official with the teachers union.\nThe documents Vought requested Wednesday could show deeper ties between the Abolitionist Teaching Network and the Biden administration. The former Trump official asked for any Department of Education records involving the network’s materials.\nVought also requested communications between the department and the Abolitionist Teaching Network as well as communications with other executive branch components, including the White House, involving the radical group.\nVought took an aggressive stance toward critical race theory while serving in the Trump administration. The Center for Renewing America has likewise been at the forefront over such battles.\nWhile serving as OMB director, Vought  federal agencies from spending any funding on training regarding critical race theory or White privilege.\nMeanwhile, the Center for Renewing America recently created a  to help people prevent critical race theory from being included in school curricula.  ","author":" \n        By\n        Ethan Barton   | Fox News"}
{"_id":{"$oid":"61017c7534347e15d5f62656"},"imageUrl":"b38d7749-ac0a-4565-9c0e-06587b01876d","title":"Young bull moose in Colorado parking garage is tranquilized, removed: photos","description":"The Lionshead Village business center in Vail, Colorado, removed an unwelcome visitor Tuesday morning: a young bull moose that wandered into the parking garage of the complex.","url":"/us/bull-moose-colorado-parking-garage-tranquilized-removed-photos","publicationDate":"2021-07-28T07:05:45-04:00","lastPublishedDate":"2021-07-28T07:05:45-04:00","category":{"name":"Colorado","url":"/category/us/us-regions/west/colorado"},"isBreaking":false,"isLive":false,"duration":"","contents":"The Lionshead Village business center in Vail, , removed an unwelcome visitor Tuesday morning: a young  that wandered into the parking garage of the complex.\nThe moose was estimated to be between 2 and 3 years old, and about 750 pounds, according to Colorado Parks and Wildlife officers.\nThe animal had been seen in the area for about the past 10 days, and was possibly attracted by de-icing products that had been used inside the garage, the wildlife department said in a statement.\n\nWildlife staff increasingly became concerned that harm could come to the moose or to people or property in the area, the department said.\nOn Tuesday, officials decided to tranquilize the moose and transport it to a more  outside Craig, Colorado, the department said.\n\n\"Everything went smoothly this morning. No issues,\" wildlife officer Devin Duval said about the operation, which happened around 8:25 a.m. \"We were definitely within that human-health-and-safety realm where there could potentially be an injury a human or the animal. That is the reason we decided to move it.\"\nThe parking lot is used primarily for people connected to Lionshead Village or to the Vail Health hospital, the department said.\n","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"61017c7734347e15d5f62657"},"imageUrl":"2d0f5cf2-ba7f-4aab-98b1-210470320ae3","title":"Off-duty FDNY firefighter beaten in park; 2 teen suspects charged with gang assault","description":"Two teen suspects were arrested Tuesday over their alleged role in the brutal beatdown of a 44-year-old off-duty FDNY firefighter in a Queens park.","url":"/us/teen-charged-assault-beatdown-fdny-firefighter","publicationDate":"2021-07-28T06:40:51-04:00","lastPublishedDate":"2021-07-28T06:40:51-04:00","category":{"name":"New York City","url":"/category/us/new-york-city"},"isBreaking":false,"isLive":false,"duration":"","contents":"Two teen suspects were arrested Tuesday over their alleged role in the brutal beatdown of a 44-year-old off-duty FDNY firefighter in a  park, police said.\nThe boys, ages 14 and 15, were turned over by their parents to police and subsequently charged with gang assault in the caught-on-video attack in Juniper Valley Park last Friday night, cops said.\nA third suspect remains on the loose.\nThe unidentified juveniles are accused of ganging up on the victim, who was walking his dog, after he confronted a large unruly crowd of teens setting off fireworks and creating a ruckus in the park, according to the \nThe man was eventually able to escape the mayhem and suffered some cuts and bruises, but refused medical attention.\nHis pooch, who was scooped up by a good Samaritan, was not hurt.\n\nIn the video footage, the mob can be seen closing in on their victim, who puts up his hands as his Labradoodle barks in protest.\n\"Give him a shot! Give him a shot! Give him a shot!\" one teen repeatedly implores, the video shows.\n\"Yo, what the f–k!\" shouts a stunned onlooker as the unidentified victim is pummeled on the pavement.\n","author":" \n        By\n        Kenneth Garger   | New York Post"}
{"_id":{"$oid":"61017c7a34347e15d5f62658"},"imageUrl":"a217fd0e-0c5a-41c3-98f0-88ee56b7bfc7","title":"Tampa police spent money on booze, lap dances during undercover probe, review board says","description":"Tampa police officers working undercover allegedly treated themselves to lap dances – plus drinks for themselves and dancers – during an undercover operation last year at a strip club in the city, an internal investigation found, according to a report on Tuesday. ","url":"/us/tampa-police-booze-lap-dances-undercover-probe-review-board","publicationDate":"2021-07-28T06:11:48-04:00","lastPublishedDate":"2021-07-28T06:11:48-04:00","category":{"name":"Florida","url":"/category/us/us-regions/southeast/florida"},"isBreaking":false,"isLive":false,"duration":"","contents":" police officers working undercover allegedly treated themselves to lap dances – plus drinks for themselves and dancers – during an undercover operation last year at a strip club in the city, an internal investigation found, according to a report on Tuesday. \nDetails of the undercover operation at the Gold Club in Tampa were discussed during a Citizens Review Board hearing Tuesday. The panel was tasked with taking a second look at the department's internal affairs investigation into the incident. \nSgt. Daniel Rhodes, supervisor of the operation, – which cost the department’s investigatory fund $421 –  said the goal was to locate drug suspects and gather intelligence on a shooting suspect who had ties to one of the dancers, according to FOX 13 of Tampa. \n\nBut over the course of three hours, an unspecified number of officers spent the money on cover charges, along with drinks for themselves, dancers, and the dancers’ friends. Each officer also bought a own lap dance, according to the station.  \nThe internal affairs report stated that officers who went to the strip club got to know the dancers but failed to generate any new leads. No arrests were made and officers gave conflicting reports as to why they were at the club conducting the undercover operation, according to internal investigators.\nThe Tampa Police Department  saying that \"discovering misconduct of any of our officers is always disheartening and unacceptable and the department will not tolerate this behavior.\" \n\"There is a check and balance. The accountability was there and that was one of the things the community asked for, was accountability,\" added board member Carolyn Collins.\nThe official plan of the operation was to investigate prostitution and drug complaints, according to the station. \nThe internal affairs report said Rhodes allowed officers to write operational plans without proper oversight, leading to a misunderstanding of the objective. \n\nRhodes was found to have violated his supervisory responsibilities, FOX 13 reported. He was suspended for one day, and removed from the Tampa Police Street Anti-Crime Squad\nThe internal review findings were signed off at the board hearing Tuesday, but Collins questioned why Rhodes – who remains with the force as a sergeant – wasn't given a harsher punishment. \n\n\"The penalty, or the violation of a one-day suspension and moving him around does not look like it is enough for what he did,\" Collins said.","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"61017c7c34347e15d5f62659"},"imageUrl":"550a2de8-e73d-4d9f-8cf7-4f300f0e762d","title":"Capitol riot hearing kicks off with cops blaming Trump, GOP for Jan. 6 unrest","description":"","url":"/us/capitol-riot-cops-trump-gop-jan-6-unrest","publicationDate":"2021-07-28T04:59:17-04:00","lastPublishedDate":"2021-07-28T04:59:17-04:00","category":{"name":"Fox News First","url":"/category/columns/fox-news-first"},"isBreaking":false,"isLive":false,"duration":"","contents":"Four police officers who defended  from a mob that invaded it Jan. 6 criticized former President Trump – and Republicans who are loyal to him – for allegedly inspiring and then downplaying the attack.\nThey asked members of the House select committee investigating the events of that day to get to the bottom of Trump and the GOP's culpability.\n\"You guys are the only ones we've got to deal with crimes that occur above us,\" Metropolitan Police Department (MPD) Officer Daniel Hodges said. \"I need you guys to address if anyone in power had a role in this. If anyone in power coordinated, or aided abetted or tried to downplay, tried to prevent the investigation of this terrorist attack.\"\nThe officers made the comments before a panel with no hostile questioners. Republicans pulled all of their appointees to the committee after House Speaker Nancy Pelosi, D-Calif., blocked two of them for being too closely aligned with Trump.\nThe fact that the only Republicans on the committee – Reps. Adam Kinzinger, R-Ill., and Liz Cheney, R-Wyo. – were selected by Pelosi made for a hearing with little dissent or fireworks. But with graphic body camera video and emotional testimony, the hearing was still gripping and at times jarring television. .- NYT reporter  tweets urging Trump supporters to be called 'enemies of the state' amid backlash- Rep. Jordan  Pelosi of kicking him off Jan. 6 Capitol commission for raising 'fundamental' questions- GOP Rep. Jim Banks: Dem-led Jan. 6 committee's Capitol Hill hearing  ‘performance art’- Hannity: Jan. 6 commission's only goal  to 'smear Donald Trump and the GOP on national television'- Sen. Kennedy: If partisanship  an Olympic sport, Pelosi would take home the gold- CNN's John Avlon  Cheney, Kinzinger for 'stepping up' on Jan. 6 committee: 'This is about patriotism'\nThe mayor of Seattle is calling on the city to rebuild its depleted police force after six separate shootings rocked Washington state's largest metro area over the weekend. \n\"As a city, we cannot continue on this current trajectory of losing police officers,\" Seattle Mayor Jenny Durkan said during a Monday news conference. \"Over the past 17 months, the Seattle Police Department has lost 250 police officers, which is the equivalent of over 300,000 service hours. We’re on path to losing 300 police officers.\"\nDurkan added the weekend violence was a \"reminder\" that there are certain emergency situations that require sworn police officers.\n\"It is a false choice between community-led solutions and police officers,\" Durkan said. \"We need both.\" .- Activists  police don't prevent crime like saying 'there's no proof water is wet': Kira Davis- Colorado police officer  after allegedly pistol-whipping, choking man during arrest- Alabama police officer fatally  in ambush outside home during lunch break- Soros  $1 million to group attempting to defund police as violent crime skyrockets nationwide\nSimone Biles, the superstar gymnast from the U.S., will not participate in the individual all-around competition at the Tokyo Games and will instead focus on her mental well-being, USA Gymnastics said in a statement early Wednesday. \nThe decision comes a day after she pulled out of the team all-around competition.\nJade Carey, who finished ninth in qualifying, will take Biles’ place in the individual all-around competition.\n\"After further medical evaluation, Simone Biles has withdrawn from the final individual all-around competition at the Tokyo Olympic Games,\" USA Gymnastics said in a statement posted on Twitter on Wednesday night. \"We wholeheartedly support Simone's decision and applaud her bravery in prioritizing her well-being. Her courage shows, yet again, why she is a role model for so many.\"\nThe statement said Biles will be evaluated daily to see if she can \"participate in next week’s individual event finals.\" .\n- Simone Biles  support from Athleta: 'We are inspired'- Column: For Biles, it finally all  too much- Ledecky  gold at Tokyo Games in women's 1,500-meter freestyle- Iranian defector  anti-Semitism by dedicating Olympic medal to Israel, thanks country in Hebrew\n- Ellzey  US House seat in Texas in closely watched race- New Jersey town  case against ‘F--- Biden’ sign lady after ACLU intervenes: report- California movie theater  during 'Forever Purge' leaves 1 dead, 1 wounded, police say- Abbott s Texas National Guard to assist with arrests at US-Mexico border- Swalwell affair with Chinese spy  US intel: Breitbart editor- Starbucks  fall on reduced China outlook- IBM: Cost of data  hit 17-year high- Google revenue  as online advertising market thrives- Activision Blizzard CEO  letter to employees, admits ‘tone deaf’ response to lawsuit- Wyoming town  Bill Gates’ TerraPower nuclear plant will help replace 200-plus coal-related jobs \n\n\n\n\n","author":" \n        By\n        Jack Durschlag   | Fox News"}
{"_id":{"$oid":"61017c7e34347e15d5f6265a"},"imageUrl":"0d61f9ea-864b-41b3-8b27-0d2789e8e89c","title":"Wisconsin defendant gets 205 years in slayings of 5 relatives: ‘Just had blood on my mind’","description":"A 44-year-old Wisconsin man was sentenced Tuesday to more than 200 years in prison, plus another 105 years of extended supervision, after pleading guilty in June to fatally shooting five members of his family, according to a report.","url":"/us/wisconsin-defendant-gets-205-years-in-slayings-of-5-relatives-just-had-blood-on-my-mind","publicationDate":"2021-07-28T04:56:22-04:00","lastPublishedDate":"2021-07-28T04:56:22-04:00","category":{"name":"Wisconsin","url":"/category/us/us-regions/midwest/wisconsin"},"isBreaking":false,"isLive":false,"duration":"","contents":"A 44-year-old  man was sentenced Tuesday to more than 200 years in prison, plus another 105 years of extended supervision, after pleading guilty in June to  five members of his family, according to a report.\nChristopher Stokes of Milwaukee reportedly called 911 himself after the  on April 27, 2020, FOX 6 of Milwaukee reported.\n\"Um, I just massacred my whole family,\" Stokes reportedly told a 911 dispatcher. \"The gun is still upstairs with the bodies. … I just killed my whole family with my Mossberg.\"\nStokes made two calls after 10:30 a.m. that morning and was seated on the steps outside the house when authorities arrived, according to FOX 6. He quickly told them what he had done, the report said.\n\nAuthorities searched the home and found a 12-gauge Mossberg shotgun in one of the bedroom and also found a box of 25 shells that had 12 unused shells remaining, the report said.\nIn June, Stokes pleaded guilty to five counts of first-degree reckless homicide and one count of possession of a firearm by a felon in connection with the case.\n\"Don’t know what in the world came over me,\" Stokes said at his sentencing hearing, according to FOX 6. \"Woke up and just had blood on my mind.\"\n\nThe defendant expressed remorse, saying \"I deserve to be locked up,\" .\nKilled in the rampage were Teresa Thomas, 41; Marcus Stokes, 19; Lakeitha Stokes, 17; Tera Agee, 16; and Demetrious Thomas, 14.\nStokes’ attorney had asked for a sentence of 35 years, according to the report.","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"61017c8034347e15d5f6265b"},"imageUrl":"006518fa-23d2-4b34-a46f-a8f53c886e8e","title":"Nevada brings back mask mandate in high-transmission areas, echoing CDC guidance","description":"Nevada is reinstating a coronavirus mask mandate requiring people in high-transmission areas to wear masks in public indoor spaces – regardless of vaccination status.","url":"/us/nevada-brings-mask-mandate-high-transmission-areas-echoing-cdc-guidance","publicationDate":"2021-07-28T04:44:56-04:00","lastPublishedDate":"2021-07-28T04:44:56-04:00","category":{"name":"Nevada","url":"/category/us/us-regions/west/nevada"},"isBreaking":false,"isLive":false,"duration":"","contents":"is reinstating a mask mandate requiring people in high-transmission areas to wear masks in public indoor spaces – regardless of status.\nThe mandate becomes effective at 12:01 a.m. Friday in 12 of 17 counties in Nevada, according to state health officials on Tuesday. \n\"Businesses and residents in counties with substantial or high transmission are strongly urged to adopt the changes as soon as possible,\" officials said in a .\n\nThe mandate follows guidance from the Centers for Disease Control and Prevention (CDC), which earlier in the day urged fully vaccinated Americans to wear masks indoors in areas with high transmission. In May, Gov. Steve Sisolak signed an emergency directive  on mask-wearing, FOX 5 Vegas reported.\nLas Vegas, Carson City, and Reno are among the cities the indoor mask requirement applies to. The Nevada Gaming Control Board noted the mandate would also apply to casinos in counties with high transmission rates.\nIn Nevada, and throughout the U.S., the highly contagious Delta variant continues to fuel a recent spike in cases. As of Tuesday, at least 1,143 people in the state were , according to state data. \n\n\"This update comes as the Delta variant now accounts for the majority of new cases,\" the statement added. \"The Delta variant has shown to be much more contagious and spreads more than twice as easily from one person to another, compared with earlier strains.\"\nMost new infections continue to be among unvaccinated people. Breakthrough cases have occurred, but they generally cause milder illness.\n\nSisolak’s directive instructs officials to adopt new CDC mask guidelines for students and teachers, though officials said Tuesday that they intend to have \"continued conversations\" with school officials about recommendations and implementation.\nReno officials added that they plan on requiring masks at their facilities – including city hall and indoor pools – starting Wednesday.\n","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"61017c8434347e15d5f6265c"},"imageUrl":"a4047b81-54f2-4b79-80f1-380895f9654e","title":"Minnesota police officer’s shooting death on Indian reservation prompts FBI probe: report","description":"A police officer was fatally shot in the line of duty on an Indian reservation in Minnesota on Tuesday morning – prompting an FBI investigation, according to a report.","url":"/us/minnesota-police-officer-shooting-death-red-lake-indian-reservation-fbi","publicationDate":"2021-07-28T03:23:36-04:00","lastPublishedDate":"2021-07-28T03:25:30-04:00","category":{"name":"Minnesota","url":"/category/us/us-regions/midwest/minnesota"},"isBreaking":false,"isLive":false,"duration":"","contents":"A tribal  was  in the line of duty on an Indian reservation in  on Tuesday morning – prompting an FBI investigation, according to a report.\nThe victim was identified as Officer Ryan Bialke, 37, of the Red Lake Police Department, FOX 9 of Minneapolis reported.\nAccording to the station, Red Lake police had responded to the Red Lake Indian Reservation on a report of a potentially suicidal male at a residence. \nWhen officers arrived, a suspect fired at them, striking Bialke, the report said. The officer later died at a hospital, the Bemidji Pioneer newspaper reported.\nThe suspect, who was not immediately identified, was ultimately taken into custody, according to FOX 9.\n\nHe had fled into a wooded area after shooting the officer, .\nFurther details about the suspect’s alleged actions or possible motivation were not immediately available.\nThe suspect is expected to face federal charges in the coming days in connection with the officer’s death, .\nBialke was a six-year veteran of the department and leaves behind a wife and four children, the newspaper reported.\nAll non-essential tribal activity at the reservation was halted Tuesday in response to the officer’s death, the station reported, and tribal offices and businesses were directed to lower flags to half-staff.\n\n\"It is with heavy hearts to announce that the Red Lake Nation lost a police officer this morning,\" the Red Lake Tribal Council wrote in a statement, .\nThe Red Lake reservation is located in northern Minnesota, about 275 miles north of the Twin Cities area.\n","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"61017c8734347e15d5f6265d"},"imageUrl":"ce9d82b2-b4f1-4e36-8edf-038e56d116e9","title":"Texas chemical leak kills 2, injures 6; described as 'mass casualty' incident","description":"At least two people are dead and six others are injured after a chemical leak at a Texas facility on Tuesday, officials said.","url":"/us/chemical-leak-texas-facility-leaves-least-2-dead-injured","publicationDate":"2021-07-28T02:26:08-04:00","lastPublishedDate":"2021-07-28T02:26:08-04:00","category":{"name":"Texas","url":"/category/us/us-regions/southwest/texas"},"isBreaking":false,"isLive":false,"duration":"","contents":"At least two people are dead and six others are injured after a chemical leak at a facility on Tuesday, officials said. \nEmergency officials responded to a \"mass casualty\" incident at the LyondellBasell complex in La Porte, just after 7:30 p.m., according to the Harris County Fire Marshal. \nLyondellBasell said in a statement that its complex experienced an acetic acid leak, which occurred within its acetyls unit area that had been shut down earlier in the day for planned maintenance.\n\n\"The leak is stopped and clean-up is in progress,\" LyondellBasell . \"Air monitoring continues to demonstrate no levels of concern for the community. All appropriate regulatory agencies have been notified.\"\nLyondellBasell said two contractors were killed. Among the injured were five contractors and a LyondellBasell employee, who were transported to local hospitals for treatment, the chemical industry company said. \n\nOfficials told that the chemicals involved in the incident were methyl iodide, hydrogen iodide, and methyl acetate. They could potentially cause severe burns and are toxic if inhaled, according to the station. \nHarris County Fire Marshal Laurie Christensen told the  that a decontamination process was currently underway for workers.\nChristensen also stated that a \"chemical type explosion release\" occurred that was very small and contained within the plant. Video taken by Houston's KTRK-TV appeared to show first responders spraying water onto plant equipment. \nFOX 4 reported that officials later stated there was no explosion or fire.\nLee Woodward, City Secretary and Public Information Officer for the City of La Porte added there is no active shelter-in-place order for the local community. \n\nAn investigation is underway into the cause of this incident, the company stated. ","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"61017c8b34347e15d5f6265e"},"imageUrl":"b09b1fe1-9eb1-44ea-8320-da83f24a12af","title":"Abbott orders Texas National Guard to assist with arrests at US-Mexico border","description":"Gov. Greg Abbott on Tuesday ordered Texas National Guard members to assist the Department of Public Safety (DPS) in arresting illegal immigrants at the border who break state laws.","url":"/us/abbott-texas-national-guard-migrant-arrests-us-mexico-border","publicationDate":"2021-07-28T00:57:21-04:00","lastPublishedDate":"2021-07-28T00:57:21-04:00","category":{"name":"Greg Abbott","url":"/category/person/greg-abbott"},"isBreaking":false,"isLive":false,"duration":"","contents":"Texas Gov. on Tuesday ordered the state's  members to assist the Department of Public Safety (DPS) in arresting  at the US.-Mexico border who break  laws.\nAbbott's order was included in a letter sent to Major Gen. Tracy R. Norris of the Texas Military Department. \nThe order expands on Abbott's June disaster declaration, which  the DPS to enforce all federal and state criminal laws, including those on criminal trespassing, smuggling, and human trafficking. That declaration had allowed the use of all available state resources to assist state and local law enforcement in from \"criminal activity and property damage.\" \n\n\"To respond to this disaster and secure the rule of law at our Southern border, more manpower is needed,\" Abbott . \"DPS needs help in arresting those who are violating state law. … I hereby order that the Texas National Guard assist DPS in enforcing Texas law by arresting lawbreakers at the border.\"\nThe order comes as the tackles a surge in migration and illegal contraband at the border.  the surge on a rollback of Trump-era border policies and enforcement, while the Biden administration has blamed the Trump administration and \"root causes\" in Central America.\n\"President Biden's open-border policies have paved the way for dangerous gangs and cartels, human traffickers, and deadly drugs like fentanyl to pour into our communities,\" Abbott said in a statement last month. \n\nIn June, border authorities stopped crossings, which was the highest this year, according to the Texas Tribune. The previous high of 180,641 was set in May.\nAbbott, a Republican, held a security briefing at the Texas Statehouse in Austin this month, where sheriffs from local communities expressed their need for more manpower, more jail space, and more judges, FOX 7 of Austin . \n\n\"People think that this is a border-related issue and it is, but this is also an issue that affects counties across the entire state of Texas,\" said Abbott.","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"61017c8e34347e15d5f6265f"},"imageUrl":"b398c074-9c86-47d9-9401-831d6905fe35","title":"California movie theater shooting during 'Forever Purge' leaves 1 dead, 1 wounded, police say","description":"Gunfire erupted inside a movie theater in Corona, California, on Monday night, killing a woman, 18, and leaving a man fighting for his life.","url":"/us/california-movie-theater-shooting-forever-purge-corona-1-dead-1-wounded","publicationDate":"2021-07-27T23:41:35-04:00","lastPublishedDate":"2021-07-27T23:41:35-04:00","category":{"name":"California","url":"/category/us/us-regions/west/california"},"isBreaking":false,"isLive":false,"duration":"","contents":"Gunfire erupted inside a movie theater in Corona, , on Monday night, killing a woman, 18, and leaving a man fighting for his life.\nAuthorities responded to Regal Edwards Corona Crossings around 11:45 p.m. and found the two victims suffering from gunshot wounds, the Corona Police Department said. \nThe woman, who died at the scene, was identified as Rylee Goodrich. The other victim, Anthony Barajas, 19, was transported to a hospital and was on life support, police said. Authorities had yet to announce any arrests, FOX 11 of Los Angeles . \n\n the victims, both from Corona, were inside the theater watching the 9:35 p.m. showing of \",\" which they attended together. Six tickets were sold for that showing, police added. \nGloria Jennifer Castro said she was watching a movie with her family in another part of the theater when the film stopped abruptly. \n\"They told us to leave. There was an emergency, just leave fast,\" Castro said, according to . \"It's pretty scary, the fact we didn't know nothing was going on. Just scary.\"\n\nDuring the investigation and sweep of the theater Tuesday, police said detectives recovered items of \"evidentiary value,\" but did not locate a firearm inside. \nThey added there was no evidence from witnesses or surveillance footage that someone shot the victims and fled the scene, The Press-Enterprise . \nDetectives are following up on leads to identify \"the person(s) responsible for this heinous crime,\" police said. \n\nAnyone with information on the shooting is asked to call the Corona Police Department at 951-817-5839.\nCorona is about 50 miles southeast of Los Angeles. ","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"61017c9234347e15d5f62660"},"imageUrl":"ce7af381-805b-4d56-a534-f8fdceb997a2","title":"Ninth Circuit limits feds' confiscation of cellphones, laptops at points of entry: report","description":"Border agents operating at some U.S. ports of entry, airports and shipping ports are facing new limits regarding their ability to confiscate travelersâ€™ personal electronic devices, according to a report.","url":"/us/ninth-circuit-confiscate-cellphones-laptops-points-of-entry","publicationDate":"2021-07-27T23:25:37-04:00","lastPublishedDate":"2021-07-27T23:25:37-04:00","category":{"name":"Border security","url":"/category/us/immigration/border-security"},"isBreaking":false,"isLive":false,"duration":"","contents":" operating at some U.S. ports of entry,  and shipping ports are facing new limits regarding their ability to confiscate travelers’ personal , according to a report.\nIn a decision reached in June, the San Francisco-based  for the Ninth Circuit all but eliminated agents’ ability to access people’s cellphones and laptops without a warrant, according to Border Report.\nThe decision – which applies only to the western U.S. states that lie within the Ninth Circuit’s jurisdiction -- effectively places limits on law enforcement in those areas to seek evidence of crime, the report said.\n\nThe ruling limits agents of U.S. Customs and Border Protection (CBP) to searching only for digital contraband, such as child pornography, the report said.\nEv Meade of the Trans-Border Institute at the University of San Diego, said the ruling appeared to be intended to rein in agents’ apparent overstepping of their authority regarding the confiscation of devices.\n\"Under the previous administration, officers kept a blacklist under homeland security and they blacklisted reporters, humanitarian workers and lawyers, and they seized their phones and laptops,\" Meade told the outlet. \"It’s very reasonable to question the scope of these searches and to say you’re doing it under the pretexts of homeland security. The court clearly said no.\n\"And have they actually shown it serves some compelling public purpose to have violated these people’s privacy?\" she continued. \"No, the government has not met the burden that there was some compelling public interest in violating people’s privacy.\"\n\nThe case stems from a 2018 incident in which CBP personnel ordered a man to unlock and hand over his cellphone at the port of entry in San Ysidro, California, the report said. The traveler was a U.S. citizen and border agents had downloaded all his data, photos and contact information, according to the report.\nCourt filings said the man was among about 41,000 travelers to have their phones and/or laptops searched by agents between October 2018 and October 2019, .\nThe Ninth Circuit covers the following states: Alaska, Arizona, California, Hawaii, Idaho, Montana, Nevada, Oregon and Washington, plus territories Guam and the Northern Mariana Islands.","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"61017c9634347e15d5f62661"},"imageUrl":"d97ecb15-9bd8-40c6-855b-07bb57e58567","title":"Texas police learn COVID-positive illegal immigrants sent to local hotels, after Whataburger encounter","description":"Authorities in South Texas said they learned that undocumented immigrants who have testes positive for COVID-19 are being released from federal custody to a Catholic charity, which booked hotel rooms for them without notifying local officials.","url":"/us/texas-police-covid-illegal-immigrants-whataburger","publicationDate":"2021-07-27T21:48:55-04:00","lastPublishedDate":"2021-07-27T21:48:55-04:00","category":{"name":"Illegal Immigrants","url":"/category/us/immigration/illegal-immigrants"},"isBreaking":false,"isLive":false,"duration":"","contents":" in South  said Tuesday they've learned that  who have possibly tested positive for COVID-19 were being released from federal custody to a Catholic charity, which booked hotel rooms for them without notifying local officials. \nThe La Joya Police Department said a patrol officer was waved down Monday by someone concerned about a group that appeared to be sick at a  fast food restaurant. The officer found a family inside who were coughing and sneezing and not adhering to health guidelines, including the wearing of masks, authorities said during a news conference.\nA manager told the officer they wanted the people to leave the establishment because they were making everyone inside \"uneasy.\" When the officer approached the migrants, they said they had tested positive for the coronavirus and had been apprehended by Border Patrol agents several days prior before being released. \nThey didn't have documentation to prove they were COVID-positive, La Joya police Sgt. Manuel Casas said.\n\n\"We did not know this,\" he said. \"No one told the city of La Joya. No one told the police department that these people were here and no one told us that these people were possibly ill.\"\nThe migrants told the officer they were staying at the nearby Texas Inn \u0026 Suites. The hotel manager told authorities that the Catholic Charities of The Rio Grande Valley had booked rooms in the hotel to house undocumented immigrants detained by Border Patrol. \n\"We have an understanding based on what was told to us that the hotel in totality has already been rented out,\" Casas said. \"The information we have is that everyone that is staying in that hotel is COVID-19 positive because it's being rented out for them.\"\nAt the hotel, officers observed 20 to 30 people outside not wearing masks, the police department said in a social media post. The wearing of masks is not mandated but those exhibiting COVID-19 symptoms should wear one, Casas said. \nHe said the department cannot stop any of the migrants from leaving the hotel and moving on to another destination in the United States. \nPolice later learned that those detained by Border Patrol showing symptoms or who became infected with COVID-19 were being quarantined and then later handed over to the charity group to be placed in hotels in the McAllen area, as well as La Joya, police said. \nIn a statement to Fox News, a U.S. Customs and Border Protection spokesperson said the Rio Grande Valley sector has encountered \"significant numbers of undocumented migrants crossing the border.\"\n\"During these challenging times, our federal, state, and local partnerships are indispensable as we work to secure our borders and to quickly move individuals out of USBP custody and through the appropriate immigration pathway,\" the spokesperson said. \nOfficials contacted the Hidalgo County Department of Health and Human Services, which said it will look into the matter. \nFox News has reached out to the Catholic charity group. Casas acknowledged the charity was trying to help the migrants and may have been overwhelmed when they booked the hotel rooms. \nAn employee at the hotel declined to give his name but told Fox News there were undocumented migrants at the hotel but he wasn't sure how many. \n\"There are so many people trying to help,\" he said. \"We don't have any problems here (with COVID-19).\"\n\nIn response to the news, city officials are asking the public to adhere to social distancing measures and wear masks. \nIllegal border crossings have surged under the  administration. U.S. Customs and Border Protection recently announced there were nearly 190,000 migrant encounters at the southern border in June. The total number of encounters for the fiscal year topped 1 million, according to the figures. \nOn Tuesday, Texas Gov. , a Republican, ordered the Texas  to assist the state Department of Public Safety in making arrests related to the border.","author":" \n        By\n        Louis Casiano   | Fox News"}
{"_id":{"$oid":"61017ff6848380afbf63908c"},"imageUrl":"dbad9be8-99b6-4c55-8d1a-21fe16bb7b89","title":"Maryland police show bodycam video of deadly officer-involved shooting of Black man at McDonald’s drive-thru","description":"Maryland authorities played body camera video at a press conference Tuesday of the fatal officer-involved shooting of a Black man allegedly seen with a weapon in his vehicle at a McDonald’s drive-thru.","url":"/us/maryland-police-bodycam-mcdonalds-officer-shooting-black-man-drive-thru","publicationDate":"2021-07-28T12:03:11-04:00","lastPublishedDate":"2021-07-28T12:03:11-04:00","category":{"name":"Police and Law Enforcement","url":"/category/us/crime/police-and-law-enforcement"},"isBreaking":false,"isLive":false,"duration":"","contents":" authorities played body camera video at a press conference Tuesday of the fatal  shooting of a Black man allegedly seen with a weapon in his vehicle at a McDonald’s drive-thru. \nSpeaking while the video played on a projector screen, Montgomery County Police Chief Marcus Jones narrated a 28-minute-long compilation of body camera footage excerpts and a recorded phone call between police and the driver, 21-year-old Ryan LeRoux, before the July 16 shooting in Gaithersburg. Police responded to a call about a McDonald’s customer who refused to pay or remove his vehicle from the drive-thru. \nJones said officers who initially arrived at the scene saw a handgun in the front passenger seat and called for backup when LeRoux refused their commands to step out of the vehicle. A half-hour standoff ensued. \nOfficers taking cover behind a shield approached LeRoux’s SUV and placed \"stop sticks\" in front of the vehicle. Police also placed a body camera in the drive-thru window to get a better vantage point of the gun in his car, Jones said.\n\nVideo played Tuesday appeared to show LeRoux moving inside a parked car, apparently sitting up from a reclining position, moments before four officers opened fire on him. Jones said police recovered a loaded Glock 47 from LeRoux’s lap – though he did not disclose whether investigators believe LeRoux raised a weapon or posed a threat to police at any point leading up to the shooting.\nJones said there was no evidence that LeRoux fired at officers. A woman from the police department’s emergency command center had spoken to LeRoux via his cellphone. LeRoux said he saw the officers and complied with their commands to raise his hands.\n\"I can hear them just fine,\" he said.\n\"We’re just trying to help you here,\" she told LeRoux, asking him to extend his hands out a window.\nJones said the officers didn’t see LeRoux’s hands up or out the window.\nA police sergeant later called LeRoux.\n\"What’s going on, man?\" the sergeant asked. \"Hello? He just hung up on me.\"\nA crisis negotiator was en route to the scene but didn’t arrive before the shooting, Jones said. \nMontgomery County City Council used LeRoux’s death to emphasize the need \"for appropriate alternative responses to mental health crises,\" arguing \"policies and procedures are reviewed to provide our police officers with the tools they need to successfully deescalate these types of situations.\" \nLeRoux died at a hospital. Speaking to reporters later Tuesday, his mother, Rhonda LeRoux, said he was depressed, had lost his job and girlfriend, and was grieving the recent death of his grandmother. She said her son was living out of his car and had legally purchased a gun to protect himself.\n\nThe four officers involved were placed on administrative leave, a standard procedure after a shooting. \nAll four officers are White, and LeRoux was Black, police department spokeswoman Shiera Goff said. The Howard County State’s Attorney’s Office will review LeRoux’s shooting under an agreement with its counterpart in neighboring Montgomery County.\n","author":" \n        By\n        Danielle Wallace   | Fox News"}
{"_id":{"$oid":"61017ff7848380afbf63908d"},"imageUrl":"1ca78334-7101-4627-86e5-46eb818a0a3e","title":"Pennsylvania man confesses to 33-year-old cold case murder after DNA match, police say","description":"A Pennsylvania man has admitted to the 1987 cold case murder of an 85-year-old woman after DNA linked him to the gruesome crime, investigators said Tuesday.","url":"/us/pennsylvania-man-arrest-cold-case-murder-dna","publicationDate":"2021-07-28T11:50:52-04:00","lastPublishedDate":"2021-07-28T11:50:52-04:00","category":{"name":"Cold Case","url":"/category/us/crime/cold-case"},"isBreaking":false,"isLive":false,"duration":"","contents":"A  man has admitted to the 1987  murder of an 85-year-old woman after DNA linked him to the gruesome , investigators said Tuesday.\nChristopher Speelman, 58, was arrested in connection to the murder and rape of 85-year-old Edna Laughman, Pennsylvania State Police .\n\n\"This is an example that killers and rapists will never avoid capture,\" Adams County District Attorney Brian Sinnett said.\nNeighbors discovered Laughman beaten, suffocated and sexually assaulted at her home in Oxford Township on Aug. 13, 1987, investigators said. \nDuring the initial investigation, a family member had falsely confessed to her killing and spent 16 years in jail before his release and exoneration in 2004.\nThe case remained cold until 2018 when investigators sent the same DNA evidence that exonerated the family member to Parabon Nanolabs for genetic genealogy analysis.\nThe results identified common ancestors of the DNA, revealing two surnames of Laughman and Speelman, , citing court documents. Additional testing determined the DNA belonged to Christopher Speelman.\nDetectives interviewed Speelman, who denied knowing Laughman, and asked for his DNA. While Speelman consented to give his DNA, he became visibly shaken and told police that he was \"worked up,\" according to the documents.\n\nTest results found that the DNA sample Speelman provided matched the DNA sample found on the victim, police said.\nAfter Speelman was arrested, investigators said he admitted to breaking into Laughman’s home to commit robbery. Speelman told authorities that he attacked Laughman, suffocating and killing her, before raping her.\nSpeelman faces charges of robbery, rape, and homicide. He was being held without bail in the Adams County Prison.","author":" \n        By\n        Stephen Sorace   | Fox News"}
{"_id":{"$oid":"61017ffb848380afbf63908e"},"imageUrl":"2d13950a-c78f-4fde-9cf6-2f5ecbc81d44","title":"Maryland man threatened Fauci, vowed to ‘set on fire’ he and his family, Justice Department says","description":"A Maryland man is now facing federal charges after allegedly sending threatening emails to Dr. Anthony Fauci, including one vowing that he and his family would be “dragged into the street, beaten to death, and set on fire,” the Justice Department says.","url":"/us/maryland-man-charged-threatening-anthony-fauci","publicationDate":"2021-07-28T11:37:21-04:00","lastPublishedDate":"2021-07-28T11:37:21-04:00","category":{"name":"Anthony Fauci","url":"/category/person/anthony-fauci"},"isBreaking":false,"isLive":false,"duration":"","contents":"A Maryland man is now facing federal charges after allegedly sending threatening emails to , including one vowing that he and his family would be \"dragged into the street, beaten to death, and set on fire,\" the Justice Department says. \nThomas Connally, 56, of Greenbelt, risks being  if convicted on charges of threats against a federal official and interstate communication containing a threat to harm. \n\"We will never tolerate violent threats against public officials,\" Acting U.S. Attorney Jonathan Lenzner . \"Our public health officials deserve our thanks and appreciation for their tireless work, and we will not hesitate to bring charges against those individuals who seek to use fear to silence these public servants.\" \n\nThe Justice Department, citing an affidavit and criminal complaint, alleges that \"from December 28, 2020 to July 21, 2021, Connally used an email account from a provider of secure, encrypted email services based in Switzerland, to send a series of emails to Dr. Anthony Fauci, the current Director of the National Institute of Allergy and Infectious Diseases (\"NIAID\") and the Chief Medical Advisor to President of the United States, threatening to harm and/or kill him and members of his family.\" \nIn the , prosecutors say one of Connally’s emails to Fauci contained the line \"I hope you have every bone in your skull broken with crowbars and sledgehammers.\" \n\"You and your entire family will be dragged into the street, beaten to death, and set on fire,\" read another one of the messages, according to the affidavit. \n\n\"As detailed in the affidavit, also on April 24, 2021, just 30 minutes before the seven emails were sent to Dr. Fauci, Dr. Francis Collins, the Director of the NIH, received a total of four threatening emails from the same encrypted email address associated with Connally,\" the Justice Department added in their statement. \nConnally is set to make his first court appearance Wednesday. ","author":" \n        By\n        Greg Norman   | Fox News"}
{"_id":{"$oid":"61017ffd848380afbf63908f"},"imageUrl":"07913106-efb9-4953-b4c6-32f208db1cca","title":"New York shark sightings, potential attack forces officials to monitor beaches","description":"Shark sightings and a potential attack have forced beachgoers in New York out of the water this week.","url":"/us/new-york-beach-shark-sighting-potential-attack","publicationDate":"2021-07-28T11:08:17-04:00","lastPublishedDate":"2021-07-28T11:08:17-04:00","category":{"name":"US","url":"/category/us"},"isBreaking":false,"isLive":false,"duration":"","contents":"Shark sightings and a potential  have forced  in  out of the water this week. \n said Tuesday that they would use drones and helicopters to surveil Long Island beaches for the creatures after a lifeguard said he was bitten by something near Central Mall on Monday morning. \n\n, the Office of Parks, Recreation and Historic Preservation said that it would work together with New York State , increasing staffing and deploying patrol and surfboats to monitor the area. \n\"Long Island beaches are a crucial resource for New Yorkers in summer, and we must make sure people feel safe when visiting,\" . \"With assistance from New York State Police, we are expanding our measures to patrol for sharks and other potentially dangerous . I encourage all New Yorkers to familiarize themselves with the steps they can take to stay safe while enjoying a day at the beach.\"\nThe department noted that additional sightings had been reported at Jones Beach in the past week, including one on Tuesday, and that the investigation into Monday's incident was ongoing. \nA photo from  shows an injury on the lifeguard's left calf and George Gorman Jr., the regional director for the state park system, said the lifeguard \"felt a tug and then he saw a fin\" at around 11 a.m. ET that day. \nThe station reported that the lifeguard was treated at the scene before moving to a nearby  for \"further examination.\"\nBoth WNBC and  that the second sighting happened on Tuesday morning just after 11 a.m. ET, prompting an order for swimmers to get out of the water. \n\nAccording to PIX11, there were 20 confirmed shark sightings at Long Island beaches in the summer of 2020.\nIn June,  nicknamed \"Freya\" was seen off the coast of Long Island and the  shoreline.\n, the recovery of shark prey species is leading to an increase in shark bites around the world, rising from 157 incidents between 1970 and 1979 to almost 800 between 2010 and 2019.\nIn 2020, the U.S. experienced , the most in the world.\nThe state parks department assured that it will continue to follow shark alert protocols including suspending swimming while shores are inspected by drones.\n\"Swimming is only allowed to resume at least an hour after the last sighting. All sightings, including today's incident, are referred to the Long Island Coastal Awareness Group, which consists of 160 municipalities, agencies and private beach operators stretching from Queens through Long Island,\" the department wrote. \"State Parks created this alert system in 2018 after shark interactions off Fire Island. State Park lifeguards are continuously scanning and patrolling the waters and are on the lookout for any dangerous marine life, such as sharks.\"\n\nTo minimize the risk of shark interactions, the New York Department of Environmental Conservation advises that residents avoid areas with seals, schools of bait fish, areas with people fishing, murky water and isolation. \nAdditionally, the department recommends swimmers avoid swimming in the ocean at dusk, dawn or at night, swim close to shore in shallow water, follow the instructions of lifeguards and staff and adhere to all important signage. \n","author":" \n        By\n        Julia Musto   | Fox News"}
{"_id":{"$oid":"610180414a0d38160528a2e9"},"imageUrl":"d981f426-3d13-4cf0-b50c-cea79149f4b1","title":"Maryland police show bodycam video of deadly officer-involved shooting of Black man at McDonald’s drive-thru","description":"Maryland authorities played body camera video at a press conference Tuesday of the fatal officer-involved shooting of a Black man allegedly seen with a weapon in his vehicle at a McDonald’s drive-thru.","url":"/us/maryland-police-bodycam-mcdonalds-officer-shooting-black-man-drive-thru","publicationDate":"2021-07-28T12:03:11-04:00","lastPublishedDate":"2021-07-28T12:03:11-04:00","category":{"name":"Police and Law Enforcement","url":"/category/us/crime/police-and-law-enforcement"},"isBreaking":false,"isLive":false,"duration":"","contents":" authorities played body camera video at a press conference Tuesday of the fatal  shooting of a Black man allegedly seen with a weapon in his vehicle at a McDonald’s drive-thru. \nSpeaking while the video played on a projector screen, Montgomery County Police Chief Marcus Jones narrated a 28-minute-long compilation of body camera footage excerpts and a recorded phone call between police and the driver, 21-year-old Ryan LeRoux, before the July 16 shooting in Gaithersburg. Police responded to a call about a McDonald’s customer who refused to pay or remove his vehicle from the drive-thru. \nJones said officers who initially arrived at the scene saw a handgun in the front passenger seat and called for backup when LeRoux refused their commands to step out of the vehicle. A half-hour standoff ensued. \nOfficers taking cover behind a shield approached LeRoux’s SUV and placed \"stop sticks\" in front of the vehicle. Police also placed a body camera in the drive-thru window to get a better vantage point of the gun in his car, Jones said.\n\nVideo played Tuesday appeared to show LeRoux moving inside a parked car, apparently sitting up from a reclining position, moments before four officers opened fire on him. Jones said police recovered a loaded Glock 47 from LeRoux’s lap – though he did not disclose whether investigators believe LeRoux raised a weapon or posed a threat to police at any point leading up to the shooting.\nJones said there was no evidence that LeRoux fired at officers. A woman from the police department’s emergency command center had spoken to LeRoux via his cellphone. LeRoux said he saw the officers and complied with their commands to raise his hands.\n\"I can hear them just fine,\" he said.\n\"We’re just trying to help you here,\" she told LeRoux, asking him to extend his hands out a window.\nJones said the officers didn’t see LeRoux’s hands up or out the window.\nA police sergeant later called LeRoux.\n\"What’s going on, man?\" the sergeant asked. \"Hello? He just hung up on me.\"\nA crisis negotiator was en route to the scene but didn’t arrive before the shooting, Jones said. \nMontgomery County City Council used LeRoux’s death to emphasize the need \"for appropriate alternative responses to mental health crises,\" arguing \"policies and procedures are reviewed to provide our police officers with the tools they need to successfully deescalate these types of situations.\" \nLeRoux died at a hospital. Speaking to reporters later Tuesday, his mother, Rhonda LeRoux, said he was depressed, had lost his job and girlfriend, and was grieving the recent death of his grandmother. She said her son was living out of his car and had legally purchased a gun to protect himself.\n\nThe four officers involved were placed on administrative leave, a standard procedure after a shooting. \nAll four officers are White, and LeRoux was Black, police department spokeswoman Shiera Goff said. The Howard County State’s Attorney’s Office will review LeRoux’s shooting under an agreement with its counterpart in neighboring Montgomery County.\n","author":" \n        By\n        Danielle Wallace   | Fox News"}
{"_id":{"$oid":"610180434a0d38160528a2ea"},"imageUrl":"7bb33a52-0617-4520-95bf-071a20be4cf4","title":"Pennsylvania man confesses to 33-year-old cold case murder after DNA match, police say","description":"A Pennsylvania man has admitted to the 1987 cold case murder of an 85-year-old woman after DNA linked him to the gruesome crime, investigators said Tuesday.","url":"/us/pennsylvania-man-arrest-cold-case-murder-dna","publicationDate":"2021-07-28T11:50:52-04:00","lastPublishedDate":"2021-07-28T11:50:52-04:00","category":{"name":"Cold Case","url":"/category/us/crime/cold-case"},"isBreaking":false,"isLive":false,"duration":"","contents":"A  man has admitted to the 1987  murder of an 85-year-old woman after DNA linked him to the gruesome , investigators said Tuesday.\nChristopher Speelman, 58, was arrested in connection to the murder and rape of 85-year-old Edna Laughman, Pennsylvania State Police .\n\n\"This is an example that killers and rapists will never avoid capture,\" Adams County District Attorney Brian Sinnett said.\nNeighbors discovered Laughman beaten, suffocated and sexually assaulted at her home in Oxford Township on Aug. 13, 1987, investigators said. \nDuring the initial investigation, a family member had falsely confessed to her killing and spent 16 years in jail before his release and exoneration in 2004.\nThe case remained cold until 2018 when investigators sent the same DNA evidence that exonerated the family member to Parabon Nanolabs for genetic genealogy analysis.\nThe results identified common ancestors of the DNA, revealing two surnames of Laughman and Speelman, , citing court documents. Additional testing determined the DNA belonged to Christopher Speelman.\nDetectives interviewed Speelman, who denied knowing Laughman, and asked for his DNA. While Speelman consented to give his DNA, he became visibly shaken and told police that he was \"worked up,\" according to the documents.\n\nTest results found that the DNA sample Speelman provided matched the DNA sample found on the victim, police said.\nAfter Speelman was arrested, investigators said he admitted to breaking into Laughman’s home to commit robbery. Speelman told authorities that he attacked Laughman, suffocating and killing her, before raping her.\nSpeelman faces charges of robbery, rape, and homicide. He was being held without bail in the Adams County Prison.","author":" \n        By\n        Stephen Sorace   | Fox News"}
{"_id":{"$oid":"610180464a0d38160528a2eb"},"imageUrl":"b8bc9f33-14c1-4edd-8f4a-e694a1c04dd8","title":"Maryland man threatened Fauci, vowed to ‘set on fire’ he and his family, Justice Department says","description":"A Maryland man is now facing federal charges after allegedly sending threatening emails to Dr. Anthony Fauci, including one vowing that he and his family would be “dragged into the street, beaten to death, and set on fire,” the Justice Department says.","url":"/us/maryland-man-charged-threatening-anthony-fauci","publicationDate":"2021-07-28T11:37:21-04:00","lastPublishedDate":"2021-07-28T11:37:21-04:00","category":{"name":"Anthony Fauci","url":"/category/person/anthony-fauci"},"isBreaking":false,"isLive":false,"duration":"","contents":"A Maryland man is now facing federal charges after allegedly sending threatening emails to , including one vowing that he and his family would be \"dragged into the street, beaten to death, and set on fire,\" the Justice Department says. \nThomas Connally, 56, of Greenbelt, risks being  if convicted on charges of threats against a federal official and interstate communication containing a threat to harm. \n\"We will never tolerate violent threats against public officials,\" Acting U.S. Attorney Jonathan Lenzner . \"Our public health officials deserve our thanks and appreciation for their tireless work, and we will not hesitate to bring charges against those individuals who seek to use fear to silence these public servants.\" \n\nThe Justice Department, citing an affidavit and criminal complaint, alleges that \"from December 28, 2020 to July 21, 2021, Connally used an email account from a provider of secure, encrypted email services based in Switzerland, to send a series of emails to Dr. Anthony Fauci, the current Director of the National Institute of Allergy and Infectious Diseases (\"NIAID\") and the Chief Medical Advisor to President of the United States, threatening to harm and/or kill him and members of his family.\" \nIn the , prosecutors say one of Connally’s emails to Fauci contained the line \"I hope you have every bone in your skull broken with crowbars and sledgehammers.\" \n\"You and your entire family will be dragged into the street, beaten to death, and set on fire,\" read another one of the messages, according to the affidavit. \n\n\"As detailed in the affidavit, also on April 24, 2021, just 30 minutes before the seven emails were sent to Dr. Fauci, Dr. Francis Collins, the Director of the NIH, received a total of four threatening emails from the same encrypted email address associated with Connally,\" the Justice Department added in their statement. \nConnally is set to make his first court appearance Wednesday. ","author":" \n        By\n        Greg Norman   | Fox News"}
{"_id":{"$oid":"610180484a0d38160528a2ec"},"imageUrl":"c1273b0d-a5f0-498e-adec-cd019ec39004","title":"New York shark sightings, potential attack forces officials to monitor beaches","description":"Shark sightings and a potential attack have forced beachgoers in New York out of the water this week.","url":"/us/new-york-beach-shark-sighting-potential-attack","publicationDate":"2021-07-28T11:08:17-04:00","lastPublishedDate":"2021-07-28T11:08:17-04:00","category":{"name":"US","url":"/category/us"},"isBreaking":false,"isLive":false,"duration":"","contents":"Shark sightings and a potential  have forced  in  out of the water this week. \n said Tuesday that they would use drones and helicopters to surveil Long Island beaches for the creatures after a lifeguard said he was bitten by something near Central Mall on Monday morning. \n\n, the Office of Parks, Recreation and Historic Preservation said that it would work together with New York State , increasing staffing and deploying patrol and surfboats to monitor the area. \n\"Long Island beaches are a crucial resource for New Yorkers in summer, and we must make sure people feel safe when visiting,\" . \"With assistance from New York State Police, we are expanding our measures to patrol for sharks and other potentially dangerous . I encourage all New Yorkers to familiarize themselves with the steps they can take to stay safe while enjoying a day at the beach.\"\nThe department noted that additional sightings had been reported at Jones Beach in the past week, including one on Tuesday, and that the investigation into Monday's incident was ongoing. \nA photo from  shows an injury on the lifeguard's left calf and George Gorman Jr., the regional director for the state park system, said the lifeguard \"felt a tug and then he saw a fin\" at around 11 a.m. ET that day. \nThe station reported that the lifeguard was treated at the scene before moving to a nearby  for \"further examination.\"\nBoth WNBC and  that the second sighting happened on Tuesday morning just after 11 a.m. ET, prompting an order for swimmers to get out of the water. \n\nAccording to PIX11, there were 20 confirmed shark sightings at Long Island beaches in the summer of 2020.\nIn June,  nicknamed \"Freya\" was seen off the coast of Long Island and the  shoreline.\n, the recovery of shark prey species is leading to an increase in shark bites around the world, rising from 157 incidents between 1970 and 1979 to almost 800 between 2010 and 2019.\nIn 2020, the U.S. experienced , the most in the world.\nThe state parks department assured that it will continue to follow shark alert protocols including suspending swimming while shores are inspected by drones.\n\"Swimming is only allowed to resume at least an hour after the last sighting. All sightings, including today's incident, are referred to the Long Island Coastal Awareness Group, which consists of 160 municipalities, agencies and private beach operators stretching from Queens through Long Island,\" the department wrote. \"State Parks created this alert system in 2018 after shark interactions off Fire Island. State Park lifeguards are continuously scanning and patrolling the waters and are on the lookout for any dangerous marine life, such as sharks.\"\n\nTo minimize the risk of shark interactions, the New York Department of Environmental Conservation advises that residents avoid areas with seals, schools of bait fish, areas with people fishing, murky water and isolation. \nAdditionally, the department recommends swimmers avoid swimming in the ocean at dusk, dawn or at night, swim close to shore in shallow water, follow the instructions of lifeguards and staff and adhere to all important signage. \n","author":" \n        By\n        Julia Musto   | Fox News"}
{"_id":{"$oid":"6101804c4a0d38160528a2ed"},"imageUrl":"ca2a943c-2e2c-4324-9b62-c19418d43ff1","title":"Pennsylvania officer faces child luring charge after being busted by ‘concerned citizens'","description":"A Pennsylvania police officer was busted in an underage sex sting conducted by a group of “concerned citizens” posing as children, police said.","url":"/us/pennsylvania-officer-child-luring-charge-busted-by-concerned-citizens","publicationDate":"2021-07-28T10:51:02-04:00","lastPublishedDate":"2021-07-28T10:51:02-04:00","category":{"name":"Police and Law Enforcement","url":"/category/us/crime/police-and-law-enforcement"},"isBreaking":false,"isLive":false,"duration":"","contents":"A  police officer was busted in an underage sex sting conducted by a group of \"concerned citizens\" posing as children, police said. \nClifford Horn, a 54-year-old corporal for the Central Bucks Regional , had little to say when approached in Atlantic City, New Jersey, Sunday by a man who runs Colorado Ped Patrol — a group that attempts to nab child predators, video shows. \n\"We’re just having a conversation with a gentleman trying to meet with a child,\" Thomas Fellows of the vigilante group tells Horn as the officer was allegedly caught in the act. \n\n\"Your zipper’s down, by the way,\" Fellows continues. \"You’re standing in front of the running car. We got your text messages. Listen, man, you want to talk and tell us why you’re here?\" \n\"I’m not trying to meet with a child,\" replies Horn, who apparently said his name was Matt in the purported texts. \nThe officer then starts to walk away as Fellows urges him to \"take accountability\" for his actions. \nHe was later arrested by waiting cops, video shows. \nAtlantic City police confirmed Horn’s arrest Sunday, saying in a statement he was among four men charged with luring/enticing a child by various means following \"assistance\" from the public. \n\"The concerned citizens were engaged in posing as underage children on various social media sites,\" police said. \"They would confront the individual and notify law enforcement.\" \n\nResponding cops were provided screenshots of conversations between the suspects and the citizen group prior to their arrests, police said. \nHorn, of Chalfont, allegedly went onto Grindr to set up a sex act with someone he thought was a 14-year-old boy, sending a photo of himself in his underwear, WPVI reported. \nFellows told the Philadelphia Inquirer he confronted Horn at a location that had been arranged online hours earlier. He said he was unaware that the man was a police officer, but suspected he was an attorney. \n\"He was just too good,\" Fellows told the newspaper. \"He wouldn’t talk.\" \nFellows, who started his group in April after one of his sons was sexually assaulted, said he creates dating app profiles posing as young teen girls or boys and waits for people to respond. Meetings then usually occur within hours, Fellows said. \n\"They reach out to us,\" he said. \"We never reach out to them.\" \n\nHorn and the three other men who were arrested since Thursday on the same charge were released on a summons, Atlantic City police said. \nThe other suspects were identified as Jose Machuca, 51, of Hyattsville, Maryland; Sambatrimiaina Raminoson, 26, of Atlantic City; and Eugene Pulley, 49, of Philadelphia. \nHorn was suspended late Monday without pay effective immediately, CBS Philadelphia reported. \nBucks County District Attorney Matt Weintraub said Monday his office will start evaluating all criminal cases in which Horn was involved. \n\n\"Our office has assigned personnel to assist New Jersey authorities in any capacity, and to investigate and prosecute any criminal activity that may have occurred in Bucks County,\" Weintraub said in a statement. \n\"This office protects all victims, regardless of whether the accused perpetrator is an officer of the law or not. No one is above the law.\" \n","author":"  New York Post"}
{"_id":{"$oid":"6101804e4a0d38160528a2ee"},"imageUrl":"1ee82fbf-242e-4fbc-81ca-2f69efa159dd","title":"Illinois authorities hunt suspect who escaped prison transport van on way to jail","description":"Illinois authorities are searching for a suspect who escaped from custody by hopping out of a transport van on its way to jail","url":"/us/illinois-manhunt-suspect-escape-transport-van","publicationDate":"2021-07-28T10:32:25-04:00","lastPublishedDate":"2021-07-28T10:32:25-04:00","category":{"name":"Illinois","url":"/category/us/us-regions/midwest/illinois"},"isBreaking":false,"isLive":false,"duration":"","contents":" authorities are searching for a  who escaped from custody by hopping out of a transport van on its way to jail. \nHugo R. Avila, 21, was in custody of the Elgin Police Department in relation to felony traffic related offenses, and was being transported to the Kane County Sheriff’s Department when he escaped around 1:05 p.m. Tuesday from a transport vehicle in the area of Randall Road and Route 64 in St. Charles, Illinois, according to a .\nKane County Sheriff Ron Hain said Avila managed to slip out of his handcuffs and got out of the vehicle while the officer behind the wheel was stopped in traffic. Authorities checked several businesses along the the corridor between Route 64 and Dean Street, Hain added.\n\nElgin officers who responded to the scene were unsuccessful in locating Avila, who was last seen wearing a white T-shirt and blue jeans while fleeing from the area in a northeast direction. St. Charles Police Department and the Kane County Sheriff's Department are aiding in continuing search efforts.\nAvila is described as 5-foot-8, weighing about 125 pounds and having black hair and brown eyes. Police ask anyone who spots him to dial 911 and to avoid making contact.\n\nAccording to Kane County court records, Avila was charged on Monday with aggravated fleeing and eluding a police officer, speeding 21 mph over the speed limit, not having a valid driver's license and possessing drug paraphernalia, the Chicago Tribune reported.","author":" \n        By\n        Danielle Wallace   | Fox News"}
{"_id":{"$oid":"610180504a0d38160528a2ef"},"imageUrl":"50f38917-4b92-4c5f-96d2-df163a54ebb4","title":"Minnesota sets new state records for murders, assaults on police officers in 2020","description":"Minnesota saw the highest number of murders on record in 2020, as well the most assaults against police officers in the line of duty ever recorded within a one-year period, according to the annual uniform crime report released by the Bureau of Criminal Apprehension on Tuesday.","url":"/us/minnesota-murder-record-2020-assaults-police-officers","publicationDate":"2021-07-28T10:14:29-04:00","lastPublishedDate":"2021-07-28T10:14:29-04:00","category":{"name":"Minnesota","url":"/category/us/us-regions/midwest/minnesota"},"isBreaking":false,"isLive":false,"duration":"","contents":" saw the highest number of  on record in 2020, as well the most assaults against  in the line of duty ever recorded within a one-year period, according to the annual  released by the Bureau of Criminal Apprehension on Tuesday. \nJust a few months into last year, the onset of the coronavirus pandemic in the U.S. brought economic uncertainty, which further escalated as Minneapolis became the tipping point for sometimes violent demonstrations calling to \"defund the police\" in reaction to viral bystander video showing former Officer Derek Chauvin pressing his knee to the back of ’s neck until the Black man died. \nReeling from the aftermath, Minnesota recorded a 16.6% increase in violent crimes in 2020. There were 185 murders in 2020 in Minnesota compared to 117 in 2019, an increase of 58.1%, the report says. The 2020 number also tops by two the 183 total from 1995, which previously had been the highest total. Also, 75% of the murders in 2020 were committed with a firearm, up from 69% in 2019.\nThere were 667 incidents last year involving an officer or officers assaulted in the line of duty. That represents a 62% increase over 2019, and more than any other year on record, the report says. \n\nBias crimes spiked the highest in 15 years, rising sharply in 2020 with 223 incidents reported. According to the bureau, 41% of the 2020 incidents were motivated by anti-Black or African American bias.\nRev. Jerry McAfee, a civil rights activist who organized community patrols in north Minneapolis in response to a series of shootings that left at least two children dead this year, said the numbers of assaults, rapes and other violent crime counted by the bureau may be underreported. \n\"When you have a police force operating 200 under, the distrust some of the people have with the police department, some good, some bad, and the overall level of trauma that exists within our community, it's rough out here,\" McAfee told the . \nAfter his 6-year-old granddaughter was killed by stray bullets earlier this year, local peace activist K.G. Wilson, who’s worked for decades helping to keep children out of gangs and guns off the streets, said he’s choosing to leave Minneapolis amid the record-breaking crime surge.  \n\"I’m just done in Minneapolis. I don’t want to work here. I don’t want to be here,\" Wilson told  in an on-camera interview Tuesday. Despite his efforts, Wilson said, \"All I feel like I got in return is a murdered 6-year-old granddaughter and no arrests, and it’s been two months later.\" \nThe bureau report says there were 31 officer-involved shooting incidents recorded in 2020, an increase of six over 2019, and almost evenly split between the Twin Cities metro and Greater Minnesota.\nOut of the 45 use-of-force incidents reported by Minnesota agencies last year, 21 involved individuals who were White, 14 were Black, three were Asian, three were American Indian and five were unknown.\nAfter a significant downward trend over the past several years, arson rose 53.7% over 2019. There were 710 arsons reported in 2020 and 462 in 2019. Motor vehicle theft rose 19.7% in 2020 with 13,662 vehicles stolen as compared to 11,410 in 2019. The 2020 total is the highest since 2005.\nThe value of property stolen in 2020 topped $216 million, a 54.5% increase over 2019. Some of the biggest increases were in the value of stolen food and grooming products, money and vehicles.\nMinnesota Republicans argued that the report released Tuesday shows Democrats have been taking too lenient of an approach to crime and the data further supports the need for more law enforcement. \nBut Minneapolis officials have been supporting a measure that would allow voters in November to decide whether to \"replace\" the police department and are, meanwhile, fighting a judge’s ruling siding with northern Minneapolis residents wanting more cops hired to abide by the city charter. \n\nState Sen. Warren Limmer, chair of the Public Safety and Judiciary Committee and a Republican, said Tuesday’s report \"confirms what we've been talking about for several years at the Senate: Violent criminals are finding more victims and lenient accountability measures in the judicial system are not keeping people safe.\"  \nState Rep. Brian Johnson, another Republican, also released a statement highlighting GOP proposals in the House that would involve sending Minnesota State Patrol into high-risk areas of Minneapolis, expanding the police force and promoting the use of ShotSpotter technology, the Tribune reported. ","author":" \n        By\n        Danielle Wallace   | Fox News"}
{"_id":{"$oid":"610180524a0d38160528a2f0"},"imageUrl":"8669fc81-ffb1-4a3e-b20c-b52ec8a891ea","title":"San Francisco shoplifting: Women caught on video allegedly bolting from CVS with bags full of stolen goods","description":"A witness captured a group of women running out of a San Francisco CVS Pharmacy with bags allegedly stuffed full of stolen items as a spree of retail thefts continue to plague the city.","url":"/us/san-francisco-shoplifting-retail-cvs-pharmacy-video","publicationDate":"2021-07-28T10:14:08-04:00","lastPublishedDate":"2021-07-28T10:14:08-04:00","category":{"name":"San Francisco","url":"/category/us/san-francisco"},"isBreaking":false,"isLive":false,"duration":"","contents":"A witness captured a group of women running out of a  CVS Pharmacy with bags allegedly stuffed full of  items as a spree of retail thefts continue to plague the city.\nThe incident, first reported by , happened around 5 p.m. Monday at the drugstore located at Van Ness Avenue and Jackson Street.\n\nWitness Steve Adams told Lee that the four women were \"picking the place dry\" and that when he asked store employees if they were going to call police, \"they just shrugged.\"\n\"This sort of thing is becoming so normal,\" the witness told Lee.\nRetail thefts have been troubling major cities in recent months, forcing some stores .\nMultiple incidents in California have been captured on camera, including  that shows a group of shoplifters dashing out of a Neiman Marcus department store in San Francisco and jumping into idling getaway cars.\nMeanwhile in Los Angeles, another  last week appears to show two men in the suburb of Granda Hills casually leaving a TJ Maxx store with their arms full of items.\nAuthorities and retail officials in San Francisco have said that packs of shoplifters have regularly made off with merchandise to be resold.\nShoplifters aren't stealing \"one or two items that someone might need to get by,\" San Francisco Police Department spokesman Robert Rueca . \"Our investigations have shown that there are organized fences where people are selling these products that they steal.\"\nMillions of dollars’ worth of merchandise has been stolen from retailers in San Francisco, California Retail Association President Rachel Michelin told Fox News, adding that the funds from stolen items are ultimately used by crime syndicates.\n\nState officials have begun making efforts to crack down on retail thefts and other crimes following the recent surge of incidents involving shoplifters. \nCalifornia Gov. Gavin Newsom, who is facing a recall vote,  around the California Highway Patrol and local agencies to address organized theft rings. \n","author":" \n        By\n        Stephen Sorace   | Fox News"}
{"_id":{"$oid":"610180554a0d38160528a2f1"},"imageUrl":"090f7381-8599-4cad-830c-f4877f5d78a3","title":"Expert slams NYC's data on sending social workers to 911 calls, suffers from selection bias","description":"The New York City Mayor’s Office of Community Mental Health has released the results of the first month of a new program designed to send social workers and other unarmed first responders to answer certain 911 calls.","url":"/us/new-york-city-social-workers-911","publicationDate":"2021-07-28T10:10:18-04:00","lastPublishedDate":"2021-07-28T10:10:18-04:00","category":{"name":"New York City","url":"/category/us/new-york-city"},"isBreaking":false,"isLive":false,"duration":"","contents":"The  Mayor’s Office of Community Mental Health has released the results of the first month of a new program designed to send social workers and other unarmed first responders to answer certain 911 calls instead of .\nThey show the Behavioral Health Emergency Assistance Response Division (B-HEARD) pilot program saw a positive outlook after its trial run in parts of Harlem last month – but critics note that the program had its choice of calls to respond to and selected easy ones, making the rosy outlook an obvious conclusion.\nAnd while the program may have freed up officers from having to respond to about 20% of specialized mental health 911 calls, experts don’t foresee the replacement or abolition of police.\n\n\"What you do when you disarm cops or when you send unarmed civilians in to do cop’s job is to expose civil employees to substantial risk, and then say you don't get the tools of the trade that are requisite to minimizing that risk,\" Charles F. Lehman, of the conservative Manhattan Institute think tank, told Fox News Tuesday. \"It's like denying a firefighter or mine worker or electrical worker his safety equipment.\"\nLehman outlined his conclusions in a column for the institute’s public policy magazine, the , also published Tuesday: Because social workers were not sent to high-risk calls, the data suffered from a selection bias and an \"apples-to-apples comparison\" is impossible.\nDispatchers sent about 25% of mental health calls to B-HEARD in its first month, according to the  and that is expected to rise to 50% in the future.\nBut those call exclude incidents involving suspected violence, imminent harm or a subject who requires hospitalization.\n\nOf the 138 calls 911 dispatchers sent to B-HEARD, the pilot program responded to only 107 of them.\n\"The remaining calls received the traditional response by NYPD and EMS, typically because the B-HEARD teams were busy responding to another call,\" the city said in a statement.\nOr because it was deemed too difficult or risky for an unarmed response, Lehman said, adding that the issue was not necessarily with how the city presented its data as much as with how the mainstream media touted the results.\nIn seven of those calls, B-HEARD responders called in NYPD backup. Comparatively, the NYPD requested assistance from B-HEARD on 14 occasions. The city report did not go into further detail but said \"inter-agency coordination is working well.\"\nThe B-HEARD data amounts to an experiment set up without a controlled variable, Lehman said, meaning what the city reported isn’t fair to use in a direct comparison to data on regular police responses.\n ran an article Friday with the headline, \"Mental Health Response Teams Yield Better Outcomes Than Police In NYC, Data Shows.\"\nIt highlighted the city’s finding that just half of B-HEARD mental health calls required a patient’s hospitalization compared to 82% of mental health 911 calls that saw a traditional response.\n\"A New York City pilot program that dispatches mental health specialists and paramedics instead of police for certain nonviolent emergency calls has resulted in more people accepting assistance and fewer people sent to the hospital, early data shows,\" the article reads.\nAnd New York City’s NBC affiliate  a \"New York City pilot program to respond to 911 calls for mental health crises with social workers instead of cops appears to be reducing unnecessary hospitalizations.\"\nBut of course, fewer people were sent to the hospital when calls that dispatchers knew would require hospitalization were not routed to B-HEARD from the start, Lehman noted.\n\"If you wanted to assess the relative success of B-HEARD versus traditional portion mechanism, what you would want to do is randomly assign mental health-related 911 calls to either B-HEARD or to the traditional sending in the NYPD officer,\" he said. \"They didn't do that.\"\nInstead, they responded to \"easier\" calls with less likelihood of violence, where subjects were not expected to require hospitalization, he added.\n\"It was set up such that B-HEARD was necessarily going to have a higher hit rate than the traditional NYPD officers because the NYPD officers were dealing with cases that B-HEARD was considered incompetent to handle,\" Lehman said. \"So if B-HEARD had been exposed to the same set of cases the NYPD was…one cannot rule out the possibility that they would have had essentially the same success rate as the NYPD police officers, just about 82% compliance.\"\n\nOn the bright side, however, Lehman said the program does show that sending EMTs, paramedics and social workers to certain low-risk calls can free up police officers to do more police work.\n\"If you want to have unarmed guys that go check on the guy who's talking to himself, that's fine,\" he said. \"But you're still going to need a guy who's prepared for when that situation turns violent.\"","author":" \n        By\n        Michael Ruiz   | Fox News"}
{"_id":{"$oid":"610180574a0d38160528a2f2"},"imageUrl":"63f9e5f6-9633-401a-b1c0-212ddd2d9ee7","title":"Judge allows vaccinations in place of service hours for people on probation","description":"A judge in Baton Rouge, Louisiana, has offered some people on probation the option of getting the coronavirus vaccine instead of serving out court-mandated service hours.","url":"/us/judge-vaccines-baton-rouge-service-hours-probation","publicationDate":"2021-07-28T09:51:58-04:00","lastPublishedDate":"2021-07-28T09:51:58-04:00","category":{"name":"Louisiana","url":"/category/us/us-regions/southeast/louisiana"},"isBreaking":false,"isLive":false,"duration":"","contents":"A judge in Baton Rouge, , has offered some people on probation the option of getting the coronavirus  instead of serving out court-mandated service hours.\n\"Judges do innovative things like this all the time. For example, you have probably seen or heard in the past the judge would allow your donation of blood instead of community service work or instead of payment of the fine,\" . \"If a judge is going to make this offer, I think it's a reasonable one.\"\n\nJudge Fred T. Crifasi allowed at least two people the option to get the vaccine instead of finishing out their community service hours, according to court document reviewed by news outlet WBRZ. One of the offenders owed 33 hours of community service, according to the court records. \nThe district attorney added that anyone who is uncomfortable with the option can opt out. \n\"These judges in these circumstances are being totally reasonable, but I do understand that someone may think that way. And if that's the case, don't get vaccinated,\" Moore said.\nDefense Attorney Jarrett Ambeau, however, noted this might not be an appropriate offer, but added that Judge Crifasi is \"incredibly fair.\"\n\n\"I don't think the government is necessarily the right entity to be involved in me injecting something into my body,\" Ambeau said. \"Judge Crifasi himself, individually, is incredibly fair. The point is when a government actor steps in to ask you to do something like, 'will I suffer for not doing it?' And that is the question.\"\nThe incentive to get the vaccine has also spread to prisons in Louisiana, with the Department of Corrections saying inmates at state prisons are offered a $5 \"canteen credit\" for getting the shot, WBRZ reported. \n\nThe incentives come as the Biden administration continues encouraging Americans to get the vaccine, and says pushback against disinformation concerning the  is \nThe Centers for Disease Control and Prevention had said in May that fully vaccinated people were not required to wear masks indoors, but updated its mask guidance Tuesday for vaccinated people over the threat of the delta variant of the virus. It now urges people in some areas of the country with \"high\" or \"substantial\" COVID-19 transmission to mask up indoors. \nWhite House press secretary Jen Psaki noted Tuesday that vaccines \"work,\" adding masks are an \"extra step\" to protect against the virus.","author":" \n        By\n        Emma Colton   | Fox News"}
{"_id":{"$oid":"6101805d4a0d38160528a2f3"},"imageUrl":"605db210-9c01-4c38-b36a-04260f660243","title":"NYC's Washington Square Park, once a hot spot in affluent neighborhood, succumbs to urban decay","description":"The latest available crime data from the NYPD's 6th Precinct, which includes Washington Square Park, shows rapes, robberies and felony assaults are up 100%, 42.4% and 10% year-to-date, respectively. Shooting incidents are up 200% year-to-date.","url":"/us/new-yorks-once-beautiful-washington-square-park-succumbs-to-urban-decay","publicationDate":"2021-07-26T08:02:51-04:00","lastPublishedDate":"2021-07-28T09:30:28-04:00","category":{"name":"New York City","url":"/category/us/new-york-city"},"isBreaking":false,"isLive":false,"duration":"","contents":"It was the backdrop for the popular TV show  the affluent neighborhood of , where real-life celebs have splurged on multimillion-dollar homes around Washington Square Park. But a lot has changed since then. The iconic urban oasis in Manhattan is succumbing to urban decay.\nAccording to the available  from the  6th Precinct as of July 28, 2021, which includes Washington Square Park, rapes, robberies and felony assaults are up 100%, 42.4% and 10% year-to-date, respectively. Shooting incidents are up 200% year-to-date. \n\nIn 2020, there were 95,593  of one of the seven major felony offenses, with Precinct 6 accounting for 1,427 of those . In Washington Square Park alone, there were four felony assault complaints and three grand larceny  between Jan. 1 and March 31, 2021. \nData obtained by  reveals local residents in Washington Square Park used New York's 311 service to file more than 190 requests between April 1 and June 15, with complaints ranging from drug use and homelessness to the park's cleanliness.\n\nFollowing an  with hundreds of concerned residents in attendance, the 6th Precinct stepped up its police presence and initiated a 10 p.m. curfew in June as part of an effort to reduce crime in the area. \nHowever, during a meeting last week, some residents criticized the police's effort as \"racist.\"\n\"This is all about affluent, White residents thinking that the park is their backyard and siccing the cops on Black and Brown, poor artists,\" one speaker named Ash said, according to .\nCritics of the move have pushed back against the effort with protests, resulting in  between park-goers and the NYPD. \n\nBut despite those critics of the 6th Precinct, others argue the city still isn't doing enough, including Andrew Giuliani, the son of former New York City Mayor Rudy Giuliani who has launched a bid for governor.\nAndrew Giuliani shared a video Sunday morning of a littered Washington Square Park after chaos over the weekend.\n\"It's a disaster, like a bomb went off in here,\" he said. \"It's crazy and chaos, that's all it is…it's time for a change.\"\nRepresentatives for the NYPD and Department of Homeless Services did not immediately return Fox News' requests for comment. \n","author":" \n        By\n        Lucas Manfredi   | Fox News"}
{"_id":{"$oid":"610180604a0d38160528a2f4"},"imageUrl":"7e2cfa4c-2f90-4b87-a6ff-95c9fda1a5fd","title":"Gunman opens fire in broad daylight in New York City, forcing woman pushing baby stroller to flee","description":"A gunman in Brooklyn was seen on surveillance video opening fire in broad daylight, forcing a woman pushing a baby stroller to flee the area.","url":"/us/brooklyn-gunman-nypd-broad-daylight","publicationDate":"2021-07-28T08:59:39-04:00","lastPublishedDate":"2021-07-28T08:59:39-04:00","category":{"name":"Crime","url":"/category/entertainment/genres/crime"},"isBreaking":false,"isLive":false,"duration":"","contents":"A gunman in  was seen on surveillance video opening fire in broad daylight, forcing passersby to flee the area, including a woman pushing a baby stroller. \n a black head covering and all black clothing opening  on another man near the corner of Wyckoff and Hoyt streets around 9 a.m. Monday morning. \n\nA woman pushing a baby stroller is seen leaving the scene as bullets fly, and another man is also seen running from the area. \n said a 53-year-old victim was shot in the foot and is being treated at a local hospital for his injuries. \nThe NYPD is asking the public for help identifying the suspect in the case. \n\nThe incident comes after New York City saw an especially bloody summer last year with 205 shooting incidents in June alone when protests and riots spread across the country in response to the death of George Floyd. Shootings dipped down this June, with police recording 165 shooting incidents.","author":" \n        By\n        Emma Colton   | Fox News"}
{"_id":{"$oid":"610180634a0d38160528a2f5"},"imageUrl":"53d5725a-9cee-4203-877f-a69b3b9fc4f9","title":"Heat warnings, advisories blanket most of central US","description":"Excessive Heat Warnings and Heat Advisories are widespread from the Northern Rockies to the Plains and Southeast as hot and humid conditions build with high temperatures climbing into the 90s and 100s.","url":"/us/heat-warnings-advisories-national-weather-forecast","publicationDate":"2021-07-28T08:03:36-04:00","lastPublishedDate":"2021-07-28T08:03:36-04:00","category":{"name":"Weather","url":"/category/weather"},"isBreaking":false,"isLive":false,"duration":"","contents":"Excessive Heat Warnings and Heat Advisories are widespread from the Northern Rockies to the Plains and Southeast as hot and humid conditions build with  climbing into the 90s and 100s.  \n will develop from the upper Midwest to the western Great Lakes.  \n\nLarge hail, damaging winds, and a few tornadoes are possible.  \nWith more than 80 large wildfires burning in the West and western Canada, upper-level winds will continue spreading smoke from the Northern Rockies to the Northeast, causing hazy skies and poor air quality.","author":" \n        By\n        Greg Norman   | Fox News"}
{"_id":{"$oid":"610180654a0d38160528a2f6"},"imageUrl":"c0f6ecd9-58b4-4cbc-a3cd-80ff36eab4cd","title":"Austin police shortage at 'crisis' level, 911 callers forced to wait","description":"With fewer officers on the streets and no major recruitment plans in the works, law enforcement experts say it’s having a major ripple effect through one of the fastest-growing U.S. cities.","url":"/us/austin-police-department-down-150-cops-violent-crime-rate-soars","publicationDate":"2021-07-28T07:49:44-04:00","lastPublishedDate":"2021-07-28T07:49:44-04:00","category":{"name":"Austin","url":"/category/us/austin"},"isBreaking":false,"isLive":false,"duration":"","contents":"What would you do if somebody broke into your home? How would you handle seeing a  in progress? What if a loved one was in immediate danger? The majority of Americans would pick up the phone and dial 911 to request help from their . But what happens when there aren’t enough public servants to answer everybody’s plea?\nIn ’ capital city of  – home to a  and a spot that attracts millions of tourists annually – the man currently at the helm of the city’s police department is worried. He says his hands are effectively tied after the city council voted last August to .\n\"I call it a crisis because it is a crisis,\" interim Austin Police Chief Joseph Chacon said.\n\nChacon was referring to unprecedented staffing shortages inside his agency, including top administration leaders, as a result of the partial defunding. Chacon himself is currently vying with six other candidates in the ongoing national search for the department’s top spot, which is to be filled in August.\n\"About 150 positions are vacant right now,\" Chacon said. \"That’s not good for our overall crime rate in Austin.\"\nWith fewer officers on the streets and no major recruitment plans in the works, law enforcement experts say it’s having a major ripple effect through .\n\"Murders are up 96% compared to this time last year,\" Cary Roberts of the Greater Austin Crime Commission said.\nWhile Roberts stressed that Austin crime was going up even before the police department’s budget was cut, now the situation is even dicier. \n\"These are categories that concern the community so we need to do everything we can to address these problems, and to do it quickly,\" he said.\nTo make matters worse, now just getting officers to the scene of an emergency is proving to be a challenge. Current data shows the average police response time to a Priority 1 call (the most serious) is around nine minutes.\n\n\"When they get there, they then likely have to wait for back-up,\" said Kevin Lawrence, who serves as executive director of the Texas Municipal Police Association.\n\"They don’t have the resources they need to actually address whatever the situation is,\" he said.\nLawrence and others said the situation has  in the last year, after the Austin City Council cut $21.5 million from the police budget and diverted another $128 million away, injecting it into other city departments. That reduction accounted for a third of its total police budget. Austin was one of at least 20 major U.S. cities to trim police funding in the wake of 2020’s protests against police brutality.\nSupporters of the defund the police movement lauded the Austin City Council’s decision. Kathy Mitchell, with a group called \"Just Liberty,\" said it was much needed.\n\"We don’t want to have an overfunded Austin Police Department,\" she said.\nJoao Paolo, a member of the Austin Justice Coalition, agreed with that sentiment but expressed fears that change could soon be on the way. This week, the city council is expected to review and approve next year’s police budget. Paolo is afraid the members will cave to political pressure.\n\"Everything that we won last year is now at stake,\" he said.\n\nMembers of the law enforcement community don’t see it that way. They fear if the same amount of money is withheld again, the situation could easily go from bad to worse. \n\"We have to make evidence-based public policy decisions that keep the community safe \u0026 not be reactionary and reckless,\" said Cary Roberts of the Greater Austin Crime Commission.\nIn an effort to keep other Texas cities from following in Austin’s footsteps, Texas Republican  has since signed multiple pieces of legislation that would penalize communities for taking funds away from police budgets.\nIf a municipality larger than 225,000 residents takes away funding from law enforcement, the state would ban the city from increasing property taxes and sales tax revenues would be withheld. Larger metro areas (with more than 1 million residents) must now hold local elections before any reductions or allocations can be made with police department budgets.\n\"We have seen the consequences of  in communities across the country,\" said Abbott. \"This puts residents in danger and invites crime into communities and we can't allow this in Texas.\"","author":" \n        By\n        Casey Stegall   | Fox News"}
{"_id":{"$oid":"610180694a0d38160528a2f7"},"imageUrl":"02251394-4df8-4053-815c-57e4cdf4a04b","title":"Trump OMB chief Russ Vought investigating Biden admin ties to CRT group","description":"Russ Vought, a former top Trump administration official, on Wednesday demanded the Department of Education hand over documents that could show who was involved in promoting a radical critical race theory group in official government guidance.","url":"/us/critical-race-theory-biden-administration-russ-vought-investigation","publicationDate":"2021-07-28T07:37:02-04:00","lastPublishedDate":"2021-07-28T07:37:02-04:00","category":{"name":"EDUCATION","url":"/category/us/education"},"isBreaking":false,"isLive":false,"duration":"","contents":"Russ Vought, a former top  administration official, on Wednesday demanded the  hand over documents that could show who was involved in promoting a radical critical race theory group in official government guidance.\nVought, who is the president of the Center for Renewing America (the advocacy arm of his conservative think tank) and the former chief of the Office of Management and Budget, filed a Freedom of Information Act request for a number of communications regarding the Abolitionist Teaching Network. The Department of Education included a link to a guide the radical group developed in a handbook intended to help public schools reopen and spend American Rescue Plan funding.\n\"The American people deserve to know who at the highest levels in the  pushed this radical, racist group into reopening guidelines for our schools,\" Vought told Fox News in a statement.\n\"It's extremely troubling that  Department of Education promotes a group that accuses children of 'spirit murdering' other children based on their skin color,\" Vought continued. \"This Administration has made an Olympic sport out of State Sanctioned Racism and it's about time the curtain gets pulled back.\"\n\nThe Abolitionist Teaching Network's materials, including the guide the Department of Education linked to, incorporates language associated with critical race theory, Fox News .\n\"Abolitionist Teachers\" should \"[b]uild a school culture that engages in healing and advocacy. This requires a commitment to learning from students, families, and educators who disrupt Whiteness and other forms of oppression,\" the guide states, for example. It also discusses the \"spirit murder\" of people of color.\nThe group’s co-founder and board chair, Bettina Love, said during a webinar: \"I want us to be feared.\"\nAfter Fox News revealed the connection to the Abolitionist Teaching Network, a Department of Education spokesperson said \"\" to include the link.\nBut at least two top department officials have links to Love, Fox News .\nThe department’s second-in-command, Cindy Marten, hosted Love for a training seminar while the deputy secretary headed the San Diego Unified School District. The school system paid Love $11,000 for the gig, records show.\nMarten wasn’t confirmed until after the handbook was published, though she was nominated months prior.\nAdditionally, the National Education Association hosted Love at a June 2020 event. At the time, acting Assistant Secretary Donna Harris-Aikens, who heads the office that published the Department of Education handbook, was a senior official with the teachers union.\nThe documents Vought requested Wednesday could show deeper ties between the Abolitionist Teaching Network and the Biden administration. The former Trump official asked for any Department of Education records involving the network’s materials.\nVought also requested communications between the department and the Abolitionist Teaching Network as well as communications with other executive branch components, including the White House, involving the radical group.\nVought took an aggressive stance toward critical race theory while serving in the Trump administration. The Center for Renewing America has likewise been at the forefront over such battles.\nWhile serving as OMB director, Vought  federal agencies from spending any funding on training regarding critical race theory or White privilege.\nMeanwhile, the Center for Renewing America recently created a  to help people prevent critical race theory from being included in school curricula.  ","author":" \n        By\n        Ethan Barton   | Fox News"}
{"_id":{"$oid":"6101806c4a0d38160528a2f8"},"imageUrl":"5e4d0ad7-82ab-486e-b9de-ad7a3f74ee26","title":"Young bull moose in Colorado parking garage is tranquilized, removed: photos","description":"The Lionshead Village business center in Vail, Colorado, removed an unwelcome visitor Tuesday morning: a young bull moose that wandered into the parking garage of the complex.","url":"/us/bull-moose-colorado-parking-garage-tranquilized-removed-photos","publicationDate":"2021-07-28T07:05:45-04:00","lastPublishedDate":"2021-07-28T07:05:45-04:00","category":{"name":"Colorado","url":"/category/us/us-regions/west/colorado"},"isBreaking":false,"isLive":false,"duration":"","contents":"The Lionshead Village business center in Vail, , removed an unwelcome visitor Tuesday morning: a young  that wandered into the parking garage of the complex.\nThe moose was estimated to be between 2 and 3 years old, and about 750 pounds, according to Colorado Parks and Wildlife officers.\nThe animal had been seen in the area for about the past 10 days, and was possibly attracted by de-icing products that had been used inside the garage, the wildlife department said in a statement.\n\nWildlife staff increasingly became concerned that harm could come to the moose or to people or property in the area, the department said.\nOn Tuesday, officials decided to tranquilize the moose and transport it to a more  outside Craig, Colorado, the department said.\n\n\"Everything went smoothly this morning. No issues,\" wildlife officer Devin Duval said about the operation, which happened around 8:25 a.m. \"We were definitely within that human-health-and-safety realm where there could potentially be an injury a human or the animal. That is the reason we decided to move it.\"\nThe parking lot is used primarily for people connected to Lionshead Village or to the Vail Health hospital, the department said.\n","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"6101806e4a0d38160528a2f9"},"imageUrl":"4e578a3b-841b-40a7-9db8-4f6edc6aa370","title":"Off-duty FDNY firefighter beaten in park; 2 teen suspects charged with gang assault","description":"Two teen suspects were arrested Tuesday over their alleged role in the brutal beatdown of a 44-year-old off-duty FDNY firefighter in a Queens park.","url":"/us/teen-charged-assault-beatdown-fdny-firefighter","publicationDate":"2021-07-28T06:40:51-04:00","lastPublishedDate":"2021-07-28T06:40:51-04:00","category":{"name":"New York City","url":"/category/us/new-york-city"},"isBreaking":false,"isLive":false,"duration":"","contents":"Two teen suspects were arrested Tuesday over their alleged role in the brutal beatdown of a 44-year-old off-duty FDNY firefighter in a  park, police said.\nThe boys, ages 14 and 15, were turned over by their parents to police and subsequently charged with gang assault in the caught-on-video attack in Juniper Valley Park last Friday night, cops said.\nA third suspect remains on the loose.\nThe unidentified juveniles are accused of ganging up on the victim, who was walking his dog, after he confronted a large unruly crowd of teens setting off fireworks and creating a ruckus in the park, according to the \nThe man was eventually able to escape the mayhem and suffered some cuts and bruises, but refused medical attention.\nHis pooch, who was scooped up by a good Samaritan, was not hurt.\n\nIn the video footage, the mob can be seen closing in on their victim, who puts up his hands as his Labradoodle barks in protest.\n\"Give him a shot! Give him a shot! Give him a shot!\" one teen repeatedly implores, the video shows.\n\"Yo, what the f–k!\" shouts a stunned onlooker as the unidentified victim is pummeled on the pavement.\n","author":" \n        By\n        Kenneth Garger   | New York Post"}
{"_id":{"$oid":"610180704a0d38160528a2fa"},"imageUrl":"fdcb5baa-f52d-4938-afbe-292181057272","title":"Tampa police spent money on booze, lap dances during undercover probe, review board says","description":"Tampa police officers working undercover allegedly treated themselves to lap dances – plus drinks for themselves and dancers – during an undercover operation last year at a strip club in the city, an internal investigation found, according to a report on Tuesday. ","url":"/us/tampa-police-booze-lap-dances-undercover-probe-review-board","publicationDate":"2021-07-28T06:11:48-04:00","lastPublishedDate":"2021-07-28T06:11:48-04:00","category":{"name":"Florida","url":"/category/us/us-regions/southeast/florida"},"isBreaking":false,"isLive":false,"duration":"","contents":" police officers working undercover allegedly treated themselves to lap dances – plus drinks for themselves and dancers – during an undercover operation last year at a strip club in the city, an internal investigation found, according to a report on Tuesday. \nDetails of the undercover operation at the Gold Club in Tampa were discussed during a Citizens Review Board hearing Tuesday. The panel was tasked with taking a second look at the department's internal affairs investigation into the incident. \nSgt. Daniel Rhodes, supervisor of the operation, – which cost the department’s investigatory fund $421 –  said the goal was to locate drug suspects and gather intelligence on a shooting suspect who had ties to one of the dancers, according to FOX 13 of Tampa. \n\nBut over the course of three hours, an unspecified number of officers spent the money on cover charges, along with drinks for themselves, dancers, and the dancers’ friends. Each officer also bought a own lap dance, according to the station.  \nThe internal affairs report stated that officers who went to the strip club got to know the dancers but failed to generate any new leads. No arrests were made and officers gave conflicting reports as to why they were at the club conducting the undercover operation, according to internal investigators.\nThe Tampa Police Department  saying that \"discovering misconduct of any of our officers is always disheartening and unacceptable and the department will not tolerate this behavior.\" \n\"There is a check and balance. The accountability was there and that was one of the things the community asked for, was accountability,\" added board member Carolyn Collins.\nThe official plan of the operation was to investigate prostitution and drug complaints, according to the station. \nThe internal affairs report said Rhodes allowed officers to write operational plans without proper oversight, leading to a misunderstanding of the objective. \n\nRhodes was found to have violated his supervisory responsibilities, FOX 13 reported. He was suspended for one day, and removed from the Tampa Police Street Anti-Crime Squad\nThe internal review findings were signed off at the board hearing Tuesday, but Collins questioned why Rhodes – who remains with the force as a sergeant – wasn't given a harsher punishment. \n\n\"The penalty, or the violation of a one-day suspension and moving him around does not look like it is enough for what he did,\" Collins said.","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"610180744a0d38160528a2fb"},"imageUrl":"da0df682-9c41-4abf-a598-be66e8b1c8b2","title":"Capitol riot hearing kicks off with cops blaming Trump, GOP for Jan. 6 unrest","description":"","url":"/us/capitol-riot-cops-trump-gop-jan-6-unrest","publicationDate":"2021-07-28T04:59:17-04:00","lastPublishedDate":"2021-07-28T04:59:17-04:00","category":{"name":"Fox News First","url":"/category/columns/fox-news-first"},"isBreaking":false,"isLive":false,"duration":"","contents":"Four police officers who defended  from a mob that invaded it Jan. 6 criticized former President Trump – and Republicans who are loyal to him – for allegedly inspiring and then downplaying the attack.\nThey asked members of the House select committee investigating the events of that day to get to the bottom of Trump and the GOP's culpability.\n\"You guys are the only ones we've got to deal with crimes that occur above us,\" Metropolitan Police Department (MPD) Officer Daniel Hodges said. \"I need you guys to address if anyone in power had a role in this. If anyone in power coordinated, or aided abetted or tried to downplay, tried to prevent the investigation of this terrorist attack.\"\nThe officers made the comments before a panel with no hostile questioners. Republicans pulled all of their appointees to the committee after House Speaker Nancy Pelosi, D-Calif., blocked two of them for being too closely aligned with Trump.\nThe fact that the only Republicans on the committee – Reps. Adam Kinzinger, R-Ill., and Liz Cheney, R-Wyo. – were selected by Pelosi made for a hearing with little dissent or fireworks. But with graphic body camera video and emotional testimony, the hearing was still gripping and at times jarring television. .- NYT reporter  tweets urging Trump supporters to be called 'enemies of the state' amid backlash- Rep. Jordan  Pelosi of kicking him off Jan. 6 Capitol commission for raising 'fundamental' questions- GOP Rep. Jim Banks: Dem-led Jan. 6 committee's Capitol Hill hearing  ‘performance art’- Hannity: Jan. 6 commission's only goal  to 'smear Donald Trump and the GOP on national television'- Sen. Kennedy: If partisanship  an Olympic sport, Pelosi would take home the gold- CNN's John Avlon  Cheney, Kinzinger for 'stepping up' on Jan. 6 committee: 'This is about patriotism'\nThe mayor of Seattle is calling on the city to rebuild its depleted police force after six separate shootings rocked Washington state's largest metro area over the weekend. \n\"As a city, we cannot continue on this current trajectory of losing police officers,\" Seattle Mayor Jenny Durkan said during a Monday news conference. \"Over the past 17 months, the Seattle Police Department has lost 250 police officers, which is the equivalent of over 300,000 service hours. We’re on path to losing 300 police officers.\"\nDurkan added the weekend violence was a \"reminder\" that there are certain emergency situations that require sworn police officers.\n\"It is a false choice between community-led solutions and police officers,\" Durkan said. \"We need both.\" .- Activists  police don't prevent crime like saying 'there's no proof water is wet': Kira Davis- Colorado police officer  after allegedly pistol-whipping, choking man during arrest- Alabama police officer fatally  in ambush outside home during lunch break- Soros  $1 million to group attempting to defund police as violent crime skyrockets nationwide\nSimone Biles, the superstar gymnast from the U.S., will not participate in the individual all-around competition at the Tokyo Games and will instead focus on her mental well-being, USA Gymnastics said in a statement early Wednesday. \nThe decision comes a day after she pulled out of the team all-around competition.\nJade Carey, who finished ninth in qualifying, will take Biles’ place in the individual all-around competition.\n\"After further medical evaluation, Simone Biles has withdrawn from the final individual all-around competition at the Tokyo Olympic Games,\" USA Gymnastics said in a statement posted on Twitter on Wednesday night. \"We wholeheartedly support Simone's decision and applaud her bravery in prioritizing her well-being. Her courage shows, yet again, why she is a role model for so many.\"\nThe statement said Biles will be evaluated daily to see if she can \"participate in next week’s individual event finals.\" .\n- Simone Biles  support from Athleta: 'We are inspired'- Column: For Biles, it finally all  too much- Ledecky  gold at Tokyo Games in women's 1,500-meter freestyle- Iranian defector  anti-Semitism by dedicating Olympic medal to Israel, thanks country in Hebrew\n- Ellzey  US House seat in Texas in closely watched race- New Jersey town  case against ‘F--- Biden’ sign lady after ACLU intervenes: report- California movie theater  during 'Forever Purge' leaves 1 dead, 1 wounded, police say- Abbott s Texas National Guard to assist with arrests at US-Mexico border- Swalwell affair with Chinese spy  US intel: Breitbart editor- Starbucks  fall on reduced China outlook- IBM: Cost of data  hit 17-year high- Google revenue  as online advertising market thrives- Activision Blizzard CEO  letter to employees, admits ‘tone deaf’ response to lawsuit- Wyoming town  Bill Gates’ TerraPower nuclear plant will help replace 200-plus coal-related jobs \n\n\n\n\n","author":" \n        By\n        Jack Durschlag   | Fox News"}
{"_id":{"$oid":"610180794a0d38160528a2fc"},"imageUrl":"5b7d2760-d97e-4dcb-a863-f0e9240d7c39","title":"Wisconsin defendant gets 205 years in slayings of 5 relatives: ‘Just had blood on my mind’","description":"A 44-year-old Wisconsin man was sentenced Tuesday to more than 200 years in prison, plus another 105 years of extended supervision, after pleading guilty in June to fatally shooting five members of his family, according to a report.","url":"/us/wisconsin-defendant-gets-205-years-in-slayings-of-5-relatives-just-had-blood-on-my-mind","publicationDate":"2021-07-28T04:56:22-04:00","lastPublishedDate":"2021-07-28T04:56:22-04:00","category":{"name":"Wisconsin","url":"/category/us/us-regions/midwest/wisconsin"},"isBreaking":false,"isLive":false,"duration":"","contents":"A 44-year-old  man was sentenced Tuesday to more than 200 years in prison, plus another 105 years of extended supervision, after pleading guilty in June to  five members of his family, according to a report.\nChristopher Stokes of Milwaukee reportedly called 911 himself after the  on April 27, 2020, FOX 6 of Milwaukee reported.\n\"Um, I just massacred my whole family,\" Stokes reportedly told a 911 dispatcher. \"The gun is still upstairs with the bodies. … I just killed my whole family with my Mossberg.\"\nStokes made two calls after 10:30 a.m. that morning and was seated on the steps outside the house when authorities arrived, according to FOX 6. He quickly told them what he had done, the report said.\n\nAuthorities searched the home and found a 12-gauge Mossberg shotgun in one of the bedroom and also found a box of 25 shells that had 12 unused shells remaining, the report said.\nIn June, Stokes pleaded guilty to five counts of first-degree reckless homicide and one count of possession of a firearm by a felon in connection with the case.\n\"Don’t know what in the world came over me,\" Stokes said at his sentencing hearing, according to FOX 6. \"Woke up and just had blood on my mind.\"\n\nThe defendant expressed remorse, saying \"I deserve to be locked up,\" .\nKilled in the rampage were Teresa Thomas, 41; Marcus Stokes, 19; Lakeitha Stokes, 17; Tera Agee, 16; and Demetrious Thomas, 14.\nStokes’ attorney had asked for a sentence of 35 years, according to the report.","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"6101807d4a0d38160528a2fd"},"imageUrl":"b0e6edfe-70d2-4faf-839f-457b4b2bbb3a","title":"Nevada brings back mask mandate in high-transmission areas, echoing CDC guidance","description":"Nevada is reinstating a coronavirus mask mandate requiring people in high-transmission areas to wear masks in public indoor spaces â€“ regardless of vaccination status.","url":"/us/nevada-brings-mask-mandate-high-transmission-areas-echoing-cdc-guidance","publicationDate":"2021-07-28T04:44:56-04:00","lastPublishedDate":"2021-07-28T04:44:56-04:00","category":{"name":"Nevada","url":"/category/us/us-regions/west/nevada"},"isBreaking":false,"isLive":false,"duration":"","contents":"is reinstating a mask mandate requiring people in high-transmission areas to wear masks in public indoor spaces – regardless of status.\nThe mandate becomes effective at 12:01 a.m. Friday in 12 of 17 counties in Nevada, according to state health officials on Tuesday. \n\"Businesses and residents in counties with substantial or high transmission are strongly urged to adopt the changes as soon as possible,\" officials said in a .\n\nThe mandate follows guidance from the Centers for Disease Control and Prevention (CDC), which earlier in the day urged fully vaccinated Americans to wear masks indoors in areas with high transmission. In May, Gov. Steve Sisolak signed an emergency directive  on mask-wearing, FOX 5 Vegas reported.\nLas Vegas, Carson City, and Reno are among the cities the indoor mask requirement applies to. The Nevada Gaming Control Board noted the mandate would also apply to casinos in counties with high transmission rates.\nIn Nevada, and throughout the U.S., the highly contagious Delta variant continues to fuel a recent spike in cases. As of Tuesday, at least 1,143 people in the state were , according to state data. \n\n\"This update comes as the Delta variant now accounts for the majority of new cases,\" the statement added. \"The Delta variant has shown to be much more contagious and spreads more than twice as easily from one person to another, compared with earlier strains.\"\nMost new infections continue to be among unvaccinated people. Breakthrough cases have occurred, but they generally cause milder illness.\n\nSisolak’s directive instructs officials to adopt new CDC mask guidelines for students and teachers, though officials said Tuesday that they intend to have \"continued conversations\" with school officials about recommendations and implementation.\nReno officials added that they plan on requiring masks at their facilities – including city hall and indoor pools – starting Wednesday.\n","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"610180804a0d38160528a2fe"},"imageUrl":"32537764-e3a1-450f-a092-73aac8ec32df","title":"Minnesota police officer’s shooting death on Indian reservation prompts FBI probe: report","description":"A police officer was fatally shot in the line of duty on an Indian reservation in Minnesota on Tuesday morning – prompting an FBI investigation, according to a report.","url":"/us/minnesota-police-officer-shooting-death-red-lake-indian-reservation-fbi","publicationDate":"2021-07-28T03:23:36-04:00","lastPublishedDate":"2021-07-28T03:25:30-04:00","category":{"name":"Minnesota","url":"/category/us/us-regions/midwest/minnesota"},"isBreaking":false,"isLive":false,"duration":"","contents":"A tribal  was  in the line of duty on an Indian reservation in  on Tuesday morning – prompting an FBI investigation, according to a report.\nThe victim was identified as Officer Ryan Bialke, 37, of the Red Lake Police Department, FOX 9 of Minneapolis reported.\nAccording to the station, Red Lake police had responded to the Red Lake Indian Reservation on a report of a potentially suicidal male at a residence. \nWhen officers arrived, a suspect fired at them, striking Bialke, the report said. The officer later died at a hospital, the Bemidji Pioneer newspaper reported.\nThe suspect, who was not immediately identified, was ultimately taken into custody, according to FOX 9.\n\nHe had fled into a wooded area after shooting the officer, .\nFurther details about the suspect’s alleged actions or possible motivation were not immediately available.\nThe suspect is expected to face federal charges in the coming days in connection with the officer’s death, .\nBialke was a six-year veteran of the department and leaves behind a wife and four children, the newspaper reported.\nAll non-essential tribal activity at the reservation was halted Tuesday in response to the officer’s death, the station reported, and tribal offices and businesses were directed to lower flags to half-staff.\n\n\"It is with heavy hearts to announce that the Red Lake Nation lost a police officer this morning,\" the Red Lake Tribal Council wrote in a statement, .\nThe Red Lake reservation is located in northern Minnesota, about 275 miles north of the Twin Cities area.\n","author":" \n        By\n        Dom Calicchio   | Fox News"}
{"_id":{"$oid":"610180854a0d38160528a2ff"},"imageUrl":"5b7f0fd6-822c-4b42-9e45-c6310c871db3","title":"Texas chemical leak kills 2, injures 6; described as 'mass casualty' incident","description":"At least two people are dead and six others are injured after a chemical leak at a Texas facility on Tuesday, officials said.","url":"/us/chemical-leak-texas-facility-leaves-least-2-dead-injured","publicationDate":"2021-07-28T02:26:08-04:00","lastPublishedDate":"2021-07-28T02:26:08-04:00","category":{"name":"Texas","url":"/category/us/us-regions/southwest/texas"},"isBreaking":false,"isLive":false,"duration":"","contents":"At least two people are dead and six others are injured after a chemical leak at a facility on Tuesday, officials said. \nEmergency officials responded to a \"mass casualty\" incident at the LyondellBasell complex in La Porte, just after 7:30 p.m., according to the Harris County Fire Marshal. \nLyondellBasell said in a statement that its complex experienced an acetic acid leak, which occurred within its acetyls unit area that had been shut down earlier in the day for planned maintenance.\n\n\"The leak is stopped and clean-up is in progress,\" LyondellBasell . \"Air monitoring continues to demonstrate no levels of concern for the community. All appropriate regulatory agencies have been notified.\"\nLyondellBasell said two contractors were killed. Among the injured were five contractors and a LyondellBasell employee, who were transported to local hospitals for treatment, the chemical industry company said. \n\nOfficials told that the chemicals involved in the incident were methyl iodide, hydrogen iodide, and methyl acetate. They could potentially cause severe burns and are toxic if inhaled, according to the station. \nHarris County Fire Marshal Laurie Christensen told the  that a decontamination process was currently underway for workers.\nChristensen also stated that a \"chemical type explosion release\" occurred that was very small and contained within the plant. Video taken by Houston's KTRK-TV appeared to show first responders spraying water onto plant equipment. \nFOX 4 reported that officials later stated there was no explosion or fire.\nLee Woodward, City Secretary and Public Information Officer for the City of La Porte added there is no active shelter-in-place order for the local community. \n\nAn investigation is underway into the cause of this incident, the company stated. ","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"610180894a0d38160528a300"},"imageUrl":"84eb34c1-9c09-418f-a2bf-38caa790a386","title":"Abbott orders Texas National Guard to assist with arrests at US-Mexico border","description":"Gov. Greg Abbott on Tuesday ordered Texas National Guard members to assist the Department of Public Safety (DPS) in arresting illegal immigrants at the border who break state laws.","url":"/us/abbott-texas-national-guard-migrant-arrests-us-mexico-border","publicationDate":"2021-07-28T00:57:21-04:00","lastPublishedDate":"2021-07-28T00:57:21-04:00","category":{"name":"Greg Abbott","url":"/category/person/greg-abbott"},"isBreaking":false,"isLive":false,"duration":"","contents":"Texas Gov. on Tuesday ordered the state's  members to assist the Department of Public Safety (DPS) in arresting  at the US.-Mexico border who break  laws.\nAbbott's order was included in a letter sent to Major Gen. Tracy R. Norris of the Texas Military Department. \nThe order expands on Abbott's June disaster declaration, which  the DPS to enforce all federal and state criminal laws, including those on criminal trespassing, smuggling, and human trafficking. That declaration had allowed the use of all available state resources to assist state and local law enforcement in from \"criminal activity and property damage.\" \n\n\"To respond to this disaster and secure the rule of law at our Southern border, more manpower is needed,\" Abbott . \"DPS needs help in arresting those who are violating state law. … I hereby order that the Texas National Guard assist DPS in enforcing Texas law by arresting lawbreakers at the border.\"\nThe order comes as the tackles a surge in migration and illegal contraband at the border.  the surge on a rollback of Trump-era border policies and enforcement, while the Biden administration has blamed the Trump administration and \"root causes\" in Central America.\n\"President Biden's open-border policies have paved the way for dangerous gangs and cartels, human traffickers, and deadly drugs like fentanyl to pour into our communities,\" Abbott said in a statement last month. \n\nIn June, border authorities stopped crossings, which was the highest this year, according to the Texas Tribune. The previous high of 180,641 was set in May.\nAbbott, a Republican, held a security briefing at the Texas Statehouse in Austin this month, where sheriffs from local communities expressed their need for more manpower, more jail space, and more judges, FOX 7 of Austin . \n\n\"People think that this is a border-related issue and it is, but this is also an issue that affects counties across the entire state of Texas,\" said Abbott.","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"6101808c4a0d38160528a301"},"imageUrl":"d0bc6fb0-680f-4b76-98e7-acbc5a7db579","title":"California movie theater shooting during 'Forever Purge' leaves 1 dead, 1 wounded, police say","description":"Gunfire erupted inside a movie theater in Corona, California, on Monday night, killing a woman, 18, and leaving a man fighting for his life.","url":"/us/california-movie-theater-shooting-forever-purge-corona-1-dead-1-wounded","publicationDate":"2021-07-27T23:41:35-04:00","lastPublishedDate":"2021-07-27T23:41:35-04:00","category":{"name":"California","url":"/category/us/us-regions/west/california"},"isBreaking":false,"isLive":false,"duration":"","contents":"Gunfire erupted inside a movie theater in Corona, , on Monday night, killing a woman, 18, and leaving a man fighting for his life.\nAuthorities responded to Regal Edwards Corona Crossings around 11:45 p.m. and found the two victims suffering from gunshot wounds, the Corona Police Department said. \nThe woman, who died at the scene, was identified as Rylee Goodrich. The other victim, Anthony Barajas, 19, was transported to a hospital and was on life support, police said. Authorities had yet to announce any arrests, FOX 11 of Los Angeles . \n\n the victims, both from Corona, were inside the theater watching the 9:35 p.m. showing of \",\" which they attended together. Six tickets were sold for that showing, police added. \nGloria Jennifer Castro said she was watching a movie with her family in another part of the theater when the film stopped abruptly. \n\"They told us to leave. There was an emergency, just leave fast,\" Castro said, according to . \"It's pretty scary, the fact we didn't know nothing was going on. Just scary.\"\n\nDuring the investigation and sweep of the theater Tuesday, police said detectives recovered items of \"evidentiary value,\" but did not locate a firearm inside. \nThey added there was no evidence from witnesses or surveillance footage that someone shot the victims and fled the scene, The Press-Enterprise . \nDetectives are following up on leads to identify \"the person(s) responsible for this heinous crime,\" police said. \n\nAnyone with information on the shooting is asked to call the Corona Police Department at 951-817-5839.\nCorona is about 50 miles southeast of Los Angeles. ","author":" \n        By\n        David Aaro   | Fox News"}
{"_id":{"$oid":"6101810978d95900127a8cf4"},"imageUrl":"11e87ab5-1dc4-448c-b27c-6a439f3ab2c9","title":"Maryland police show bodycam video of deadly officer-involved shooting of Black man at McDonald’s drive-thru","description":"Maryland authorities played body camera video at a press conference Tuesday of the fatal officer-involved shooting of a Black man allegedly seen with a weapon in his vehicle at a McDonald’s drive-thru.","url":"/us/maryland-police-bodycam-mcdonalds-officer-shooting-black-man-drive-thru","publicationDate":"2021-07-28T12:03:11-04:00","lastPublishedDate":"2021-07-28T12:03:11-04:00","category":{"name":"Police and Law Enforcement","url":"/category/us/crime/police-and-law-enforcement"},"isBreaking":false,"isLive":false,"duration":"","contents":" authorities played body camera video at a press conference Tuesday of the fatal  shooting of a Black man allegedly seen with a weapon in his vehicle at a McDonald’s drive-thru. \nSpeaking while the video played on a projector screen, Montgomery County Police Chief Marcus Jones narrated a 28-minute-long compilation of body camera footage excerpts and a recorded phone call between police and the driver, 21-year-old Ryan LeRoux, before the July 16 shooting in Gaithersburg. Police responded to a call about a McDonald’s customer who refused to pay or remove his vehicle from the drive-thru. \nJones said officers who initially arrived at the scene saw a handgun in the front passenger seat and called for backup when LeRoux refused their commands to step out of the vehicle. A half-hour standoff ensued. \nOfficers taking cover behind a shield approached LeRoux’s SUV and placed \"stop sticks\" in front of the vehicle. Police also placed a body camera in the drive-thru window to get a better vantage point of the gun in his car, Jones said.\n\nVideo played Tuesday appeared to show LeRoux moving inside a parked car, apparently sitting up from a reclining position, moments before four officers opened fire on him. Jones said police recovered a loaded Glock 47 from LeRoux’s lap – though he did not disclose whether investigators believe LeRoux raised a weapon or posed a threat to police at any point leading up to the shooting.\nJones said there was no evidence that LeRoux fired at officers. A woman from the police department’s emergency command center had spoken to LeRoux via his cellphone. LeRoux said he saw the officers and complied with their commands to raise his hands.\n\"I can hear them just fine,\" he said.\n\"We’re just trying to help you here,\" she told LeRoux, asking him to extend his hands out a window.\nJones said the officers didn’t see LeRoux’s hands up or out the window.\nA police sergeant later called LeRoux.\n\"What’s going on, man?\" the sergeant asked. \"Hello? He just hung up on me.\"\nA crisis negotiator was en route to the scene but didn’t arrive before the shooting, Jones said. \nMontgomery County City Council used LeRoux’s death to emphasize the need \"for appropriate alternative responses to mental health crises,\" arguing \"policies and procedures are reviewed to provide our police officers with the tools they need to successfully deescalate these types of situations.\" \nLeRoux died at a hospital. Speaking to reporters later Tuesday, his mother, Rhonda LeRoux, said he was depressed, had lost his job and girlfriend, and was grieving the recent death of his grandmother. She said her son was living out of his car and had legally purchased a gun to protect himself.\n\nThe four officers involved were placed on administrative leave, a standard procedure after a shooting. \nAll four officers are White, and LeRoux was Black, police department spokeswoman Shiera Goff said. The Howard County State’s Attorney’s Office will review LeRoux’s shooting under an agreement with its counterpart in neighboring Montgomery County.\n","author":" \n        By\n        Danielle Wallace   | Fox News"}
{"_id":{"$oid":"6101810b78d95900127a8cf5"},"imageUrl":"1918217f-8457-433f-984b-ec7674aecd04","title":"Pennsylvania man confesses to 33-year-old cold case murder after DNA match, police say","description":"A Pennsylvania man has admitted to the 1987 cold case murder of an 85-year-old woman after DNA linked him to the gruesome crime, investigators said Tuesday.","url":"/us/pennsylvania-man-arrest-cold-case-murder-dna","publicationDate":"2021-07-28T11:50:52-04:00","lastPublishedDate":"2021-07-28T11:50:52-04:00","category":{"name":"Cold Case","url":"/category/us/crime/cold-case"},"isBreaking":false,"isLive":false,"duration":"","contents":"A  man has admitted to the 1987  murder of an 85-year-old woman after DNA linked him to the gruesome , investigators said Tuesday.\nChristopher Speelman, 58, was arrested in connection to the murder and rape of 85-year-old Edna Laughman, Pennsylvania State Police .\n\n\"This is an example that killers and rapists will never avoid capture,\" Adams County District Attorney Brian Sinnett said.\nNeighbors discovered Laughman beaten, suffocated and sexually assaulted at her home in Oxford Township on Aug. 13, 1987, investigators said. \nDuring the initial investigation, a family member had falsely confessed to her killing and spent 16 years in jail before his release and exoneration in 2004.\nThe case remained cold until 2018 when investigators sent the same DNA evidence that exonerated the family member to Parabon Nanolabs for genetic genealogy analysis.\nThe results identified common ancestors of the DNA, revealing two surnames of Laughman and Speelman, , citing court documents. Additional testing determined the DNA belonged to Christopher Speelman.\nDetectives interviewed Speelman, who denied knowing Laughman, and asked for his DNA. While Speelman consented to give his DNA, he became visibly shaken and told police that he was \"worked up,\" according to the documents.\n\nTest results found that the DNA sample Speelman provided matched the DNA sample found on the victim, police said.\nAfter Speelman was arrested, investigators said he admitted to breaking into Laughman’s home to commit robbery. Speelman told authorities that he attacked Laughman, suffocating and killing her, before raping her.\nSpeelman faces charges of robbery, rape, and homicide. He was being held without bail in the Adams County Prison.","author":" \n        By\n        Stephen Sorace   | Fox News"}
{"_id":{"$oid":"6101810e78d95900127a8cf6"},"imageUrl":"24008801-a433-4386-849a-42ab8a90bb89","title":"Maryland man threatened Fauci, vowed to ‘set on fire’ he and his family, Justice Department says","description":"A Maryland man is now facing federal charges after allegedly sending threatening emails to Dr. Anthony Fauci, including one vowing that he and his family would be “dragged into the street, beaten to death, and set on fire,” the Justice Department says.","url":"/us/maryland-man-charged-threatening-anthony-fauci","publicationDate":"2021-07-28T11:37:21-04:00","lastPublishedDate":"2021-07-28T11:37:21-04:00","category":{"name":"Anthony Fauci","url":"/category/person/anthony-fauci"},"isBreaking":false,"isLive":false,"duration":"","contents":"A Maryland man is now facing federal charges after allegedly sending threatening emails to , including one vowing that he and his family would be \"dragged into the street, beaten to death, and set on fire,\" the Justice Department says. \nThomas Connally, 56, of Greenbelt, risks being  if convicted on charges of threats against a federal official and interstate communication containing a threat to harm. \n\"We will never tolerate violent threats against public officials,\" Acting U.S. Attorney Jonathan Lenzner . \"Our public health officials deserve our thanks and appreciation for their tireless work, and we will not hesitate to bring charges against those individuals who seek to use fear to silence these public servants.\" \n\nThe Justice Department, citing an affidavit and criminal complaint, alleges that \"from December 28, 2020 to July 21, 2021, Connally used an email account from a provider of secure, encrypted email services based in Switzerland, to send a series of emails to Dr. Anthony Fauci, the current Director of the National Institute of Allergy and Infectious Diseases (\"NIAID\") and the Chief Medical Advisor to President of the United States, threatening to harm and/or kill him and members of his family.\" \nIn the , prosecutors say one of Connally’s emails to Fauci contained the line \"I hope you have every bone in your skull broken with crowbars and sledgehammers.\" \n\"You and your entire family will be dragged into the street, beaten to death, and set on fire,\" read another one of the messages, according to the affidavit. \n\n\"As detailed in the affidavit, also on April 24, 2021, just 30 minutes before the seven emails were sent to Dr. Fauci, Dr. Francis Collins, the Director of the NIH, received a total of four threatening emails from the same encrypted email address associated with Connally,\" the Justice Department added in their statement. \nConnally is set to make his first court appearance Wednesday. ","author":" \n        By\n        Greg Norman   | Fox News"}
{"_id":{"$oid":"6101811078d95900127a8cf7"},"imageUrl":"df9108a9-53ae-4944-9700-58721b238052","title":"New York shark sightings, potential attack forces officials to monitor beaches","description":"Shark sightings and a potential attack have forced beachgoers in New York out of the water this week.","url":"/us/new-york-beach-shark-sighting-potential-attack","publicationDate":"2021-07-28T11:08:17-04:00","lastPublishedDate":"2021-07-28T11:08:17-04:00","category":{"name":"US","url":"/category/us"},"isBreaking":false,"isLive":false,"duration":"","contents":"Shark sightings and a potential  have forced  in  out of the water this week. \n said Tuesday that they would use drones and helicopters to surveil Long Island beaches for the creatures after a lifeguard said he was bitten by something near Central Mall on Monday morning. \n\n, the Office of Parks, Recreation and Historic Preservation said that it would work together with New York State , increasing staffing and deploying patrol and surfboats to monitor the area. \n\"Long Island beaches are a crucial resource for New Yorkers in summer, and we must make sure people feel safe when visiting,\" . \"With assistance from New York State Police, we are expanding our measures to patrol for sharks and other potentially dangerous . I encourage all New Yorkers to familiarize themselves with the steps they can take to stay safe while enjoying a day at the beach.\"\nThe department noted that additional sightings had been reported at Jones Beach in the past week, including one on Tuesday, and that the investigation into Monday's incident was ongoing. \nA photo from  shows an injury on the lifeguard's left calf and George Gorman Jr., the regional director for the state park system, said the lifeguard \"felt a tug and then he saw a fin\" at around 11 a.m. ET that day. \nThe station reported that the lifeguard was treated at the scene before moving to a nearby  for \"further examination.\"\nBoth WNBC and  that the second sighting happened on Tuesday morning just after 11 a.m. ET, prompting an order for swimmers to get out of the water. \n\nAccording to PIX11, there were 20 confirmed shark sightings at Long Island beaches in the summer of 2020.\nIn June,  nicknamed \"Freya\" was seen off the coast of Long Island and the  shoreline.\n, the recovery of shark prey species is leading to an increase in shark bites around the world, rising from 157 incidents between 1970 and 1979 to almost 800 between 2010 and 2019.\nIn 2020, the U.S. experienced , the most in the world.\nThe state parks department assured that it will continue to follow shark alert protocols including suspending swimming while shores are inspected by drones.\n\"Swimming is only allowed to resume at least an hour after the last sighting. All sightings, including today's incident, are referred to the Long Island Coastal Awareness Group, which consists of 160 municipalities, agencies and private beach operators stretching from Queens through Long Island,\" the department wrote. \"State Parks created this alert system in 2018 after shark interactions off Fire Island. State Park lifeguards are continuously scanning and patrolling the waters and are on the lookout for any dangerous marine life, such as sharks.\"\n\nTo minimize the risk of shark interactions, the New York Department of Environmental Conservation advises that residents avoid areas with seals, schools of bait fish, areas with people fishing, murky water and isolation. \nAdditionally, the department recommends swimmers avoid swimming in the ocean at dusk, dawn or at night, swim close to shore in shallow water, follow the instructions of lifeguards and staff and adhere to all important signage. \n","author":" \n        By\n        Julia Musto   | Fox News"}
{"_id":{"$oid":"6101811278d95900127a8cf8"},"imageUrl":"8a94830e-3a0d-424e-ae3c-fd50f8b2af2a","title":"Pennsylvania officer faces child luring charge after being busted by ‘concerned citizens'","description":"A Pennsylvania police officer was busted in an underage sex sting conducted by a group of “concerned citizens” posing as children, police said.","url":"/us/pennsylvania-officer-child-luring-charge-busted-by-concerned-citizens","publicationDate":"2021-07-28T10:51:02-04:00","lastPublishedDate":"2021-07-28T10:51:02-04:00","category":{"name":"Police and Law Enforcement","url":"/category/us/crime/police-and-law-enforcement"},"isBreaking":false,"isLive":false,"duration":"","contents":"A  police officer was busted in an underage sex sting conducted by a group of \"concerned citizens\" posing as children, police said. \nClifford Horn, a 54-year-old corporal for the Central Bucks Regional , had little to say when approached in Atlantic City, New Jersey, Sunday by a man who runs Colorado Ped Patrol — a group that attempts to nab child predators, video shows. \n\"We’re just having a conversation with a gentleman trying to meet with a child,\" Thomas Fellows of the vigilante group tells Horn as the officer was allegedly caught in the act. \n\n\"Your zipper’s down, by the way,\" Fellows continues. \"You’re standing in front of the running car. We got your text messages. Listen, man, you want to talk and tell us why you’re here?\" \n\"I’m not trying to meet with a child,\" replies Horn, who apparently said his name was Matt in the purported texts. \nThe officer then starts to walk away as Fellows urges him to \"take accountability\" for his actions. \nHe was later arrested by waiting cops, video shows. \nAtlantic City police confirmed Horn’s arrest Sunday, saying in a statement he was among four men charged with luring/enticing a child by various means following \"assistance\" from the public. \n\"The concerned citizens were engaged in posing as underage children on various social media sites,\" police said. \"They would confront the individual and notify law enforcement.\" \n\nResponding cops were provided screenshots of conversations between the suspects and the citizen group prior to their arrests, police said. \nHorn, of Chalfont, allegedly went onto Grindr to set up a sex act with someone he thought was a 14-year-old boy, sending a photo of himself in his underwear, WPVI reported. \nFellows told the Philadelphia Inquirer he confronted Horn at a location that had been arranged online hours earlier. He said he was unaware that the man was a police officer, but suspected he was an attorney. \n\"He was just too good,\" Fellows told the newspaper. \"He wouldn’t talk.\" \nFellows, who started his group in April after one of his sons was sexually assaulted, said he creates dating app profiles posing as young teen girls or boys and waits for people to respond. Meetings then usually occur within hours, Fellows said. \n\"They reach out to us,\" he said. \"We never reach out to them.\" \n\nHorn and the three other men who were arrested since Thursday on the same charge were released on a summons, Atlantic City police said. \nThe other suspects were identified as Jose Machuca, 51, of Hyattsville, Maryland; Sambatrimiaina Raminoson, 26, of Atlantic City; and Eugene Pulley, 49, of Philadelphia. \nHorn was suspended late Monday without pay effective immediately, CBS Philadelphia reported. \nBucks County District Attorney Matt Weintraub said Monday his office will start evaluating all criminal cases in which Horn was involved. \n\n\"Our office has assigned personnel to assist New Jersey authorities in any capacity, and to investigate and prosecute any criminal activity that may have occurred in Bucks County,\" Weintraub said in a statement. \n\"This office protects all victims, regardless of whether the accused perpetrator is an officer of the law or not. No one is above the law.\" \n","author":"  New York Post"}
{"_id":{"$oid":"6101811ab9afba0e0888367f"},"imageUrl":"bfe8add1-0e5e-4c76-a628-db2926286329","title":"Maryland police show bodycam video of deadly officer-involved shooting of Black man at McDonald’s drive-thru","description":"Maryland authorities played body camera video at a press conference Tuesday of the fatal officer-involved shooting of a Black man allegedly seen with a weapon in his vehicle at a McDonald’s drive-thru.","url":"/us/maryland-police-bodycam-mcdonalds-officer-shooting-black-man-drive-thru","publicationDate":"2021-07-28T12:03:11-04:00","lastPublishedDate":"2021-07-28T12:03:11-04:00","category":{"name":"Police and Law Enforcement","url":"/category/us/crime/police-and-law-enforcement"},"isBreaking":false,"isLive":false,"duration":"","contents":" authorities played body camera video at a press conference Tuesday of the fatal  shooting of a Black man allegedly seen with a weapon in his vehicle at a McDonald’s drive-thru. \nSpeaking while the video played on a projector screen, Montgomery County Police Chief Marcus Jones narrated a 28-minute-long compilation of body camera footage excerpts and a recorded phone call between police and the driver, 21-year-old Ryan LeRoux, before the July 16 shooting in Gaithersburg. Police responded to a call about a McDonald’s customer who refused to pay or remove his vehicle from the drive-thru. \nJones said officers who initially arrived at the scene saw a handgun in the front passenger seat and called for backup when LeRoux refused their commands to step out of the vehicle. A half-hour standoff ensued. \nOfficers taking cover behind a shield approached LeRoux’s SUV and placed \"stop sticks\" in front of the vehicle. Police also placed a body camera in the drive-thru window to get a better vantage point of the gun in his car, Jones said.\n\nVideo played Tuesday appeared to show LeRoux moving inside a parked car, apparently sitting up from a reclining position, moments before four officers opened fire on him. Jones said police recovered a loaded Glock 47 from LeRoux’s lap – though he did not disclose whether investigators believe LeRoux raised a weapon or posed a threat to police at any point leading up to the shooting.\nJones said there was no evidence that LeRoux fired at officers. A woman from the police department’s emergency command center had spoken to LeRoux via his cellphone. LeRoux said he saw the officers and complied with their commands to raise his hands.\n\"I can hear them just fine,\" he said.\n\"We’re just trying to help you here,\" she told LeRoux, asking him to extend his hands out a window.\nJones said the officers didn’t see LeRoux’s hands up or out the window.\nA police sergeant later called LeRoux.\n\"What’s going on, man?\" the sergeant asked. \"Hello? He just hung up on me.\"\nA crisis negotiator was en route to the scene but didn’t arrive before the shooting, Jones said. \nMontgomery County City Council used LeRoux’s death to emphasize the need \"for appropriate alternative responses to mental health crises,\" arguing \"policies and procedures are reviewed to provide our police officers with the tools they need to successfully deescalate these types of situations.\" \nLeRoux died at a hospital. Speaking to reporters later Tuesday, his mother, Rhonda LeRoux, said he was depressed, had lost his job and girlfriend, and was grieving the recent death of his grandmother. She said her son was living out of his car and had legally purchased a gun to protect himself.\n\nThe four officers involved were placed on administrative leave, a standard procedure after a shooting. \nAll four officers are White, and LeRoux was Black, police department spokeswoman Shiera Goff said. The Howard County State’s Attorney’s Office will review LeRoux’s shooting under an agreement with its counterpart in neighboring Montgomery County.\n","author":" \n        By\n        Danielle Wallace   | Fox News"}
